{
  "courseId": "4e03c4ea-9842-4248-a04d-eab457509c42",
  "title": "Everyday English Course 25",
  "description": "Improve your English comprehension skills through short everyday conversations and situational dialogues.",
  "imageUrl": "/public/images/courses/end46c00-6746-4c45-a867-a8f08666a5c6.png",
  "totalSections": 3,
  "sections": [
    {
      "title": "Section 1: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "M: Please take a seat!\nW: Thank you!\nM: Now, you're applying for a job as secretary with us. I'd like to ask you some questions. Now, first of all, how many foreign languages can you speak?\nW: Well, I can speak English quite well. And I also know a little Japanese.\nM: English and a bit of Japanese. Um, can you type?\nW: Oh, yes, I can type.\nM: Uh-huh, and can you use a computer?\nW: Oh yes. I am very good at computers.\nM: Apple and PC?\nW: Both, yes. And I can do word processing and other things as well.\nM: Right, and um, can you take shorthand?\nW: Yes, not very fast, but I can.\nM: OK, fine. And can you drive a car?\nW: No, I'm afraid I can't.\nM: Well, that's not very important.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Teacher.",
                "Secretary.",
                "Computer programmer."
              ],
              "correctAnswer": "Secretary.",
              "variables": {
                "a": "What job is the woman applying for?"
              }
            },
            {
              "answerOptions": [
                "English.",
                "Japanese.",
                "French."
              ],
              "correctAnswer": "English.",
              "variables": {
                "a": "Which foreign language can she speak very well?"
              }
            },
            {
              "answerOptions": [
                "Typing, using a computer and taking shorthand.",
                "Typing, doing computer processing and driving.",
                "Typing, doing word processing and driving."
              ],
              "correctAnswer": "Typing, using a computer and taking shorthand.",
              "variables": {
                "a": "What other skills does she have?"
              }
            }
          ]
        },
        {
          "text": "W: May I help you,sir?\nM: Yes, please. I want to buy a personal gift for my brother. He's taking a trip to South America.\nW: Is he going by ship or by plane?\nM: He's flying. My gift will have to be something light in weight. What can you suggest?\nW: What about this leather wallet? It's made of crocodile leather.\nM: My sister has already given him one. I'd like something unusual.\nW: Here is a gift for the man who has everything.\nM: Oh,a folding toothbrush. That's a wonderful idea. How much is it?\nW: 3.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Friends.",
                "Passenger and air hostess.",
                "Customer and shop assistant."
              ],
              "correctAnswer": "Customer and shop assistant.",
              "variables": {
                "a": "What is the most probable relationship between the two speakers?"
              }
            },
            {
              "answerOptions": [
                "Something that has good weight.",
                "Something extraordinary and light.",
                "Something expensive and wonderful."
              ],
              "correctAnswer": "Something extraordinary and light.",
              "variables": {
                "a": "What kind of gift does the man want to buy for his brother?"
              }
            },
            {
              "answerOptions": [
                "A crocodile leather wallet.",
                "A model ship and a model plane.",
                "A toothbrush that can be folded."
              ],
              "correctAnswer": "A toothbrush that can be folded.",
              "variables": {
                "a": "What does the man buy in the end?"
              }
            }
          ]
        },
        {
          "text": "W: I keep feeling dizzy, and I've got a headache.\nM: How long has this been going on?\nW: It started yesterday.\nM: You've been studying too much recently.\nW: I have no other choice. Next month will be the most important exam of this term.\nM: I can understand that. But anyway, you should take better care of yourself.\nW: What should I do now?\nM: I think you should stay in bed for a little while and I will call the doctor.\nW: It's very kind of you. Thank you very much.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She worked too hard",
                "She ate something wrong.",
                "She was caught in the rain."
              ],
              "correctAnswer": "She worked too hard",
              "variables": {
                "a": "Why is the woman sick?"
              }
            },
            {
              "answerOptions": [
                "This week.",
                "Next week.",
                "Next month."
              ],
              "correctAnswer": "Next month.",
              "variables": {
                "a": "When will she have an exam?"
              }
            },
            {
              "answerOptions": [
                "Help her prepare the exam.",
                "Buy her some medicine.",
                "Send for the doctor."
              ],
              "correctAnswer": "Send for the doctor.",
              "variables": {
                "a": "What will the man do for her?"
              }
            }
          ]
        },
        {
          "text": "M: Hello.\nW: Hi, Tom. This is Diana from the creative writing class.\nM: Oh, hi, Diana. What's up?\nW: Well, I have a new project which I thought you might be interested in. I'm setting up a writer's group, you know, a support group for people who are trying to get published.\nM: Well, how would it work?\nW: We get together once a week. I've already arranged for a meeting room in the library, and then we share what we were working on and offer each other some advice.\nM: I could use some advice. I'm working on a short story that I'd like to get published in the Campus Literature Review. You've done that, haven't you? Didn't I see a poem of yours in the last issue?\nW: Yes, I was so excited to finally see my work in print. It was presented three times. You just have to keep trying if they turn you down.\nM: Well, I'm sure the group could help me, but I don't know how much I can contribute. I'm just starting out.\nW: That's OK. I know from your comments in class that you will be a valuable member. We will get someone more experienced to help us, too.\nM: Sounds great. You can definitely count me in.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "To teach students some basic writing skills.",
                "To write articles for the Campus Literature Review.",
                "To help those who want to get their works published."
              ],
              "correctAnswer": "To help those who want to get their works published.",
              "variables": {
                "a": "What is the purpose of Diana's new project?"
              }
            },
            {
              "answerOptions": [
                "Keep trying even if he is turned down.",
                "Ask an experienced writer to be his consultant.",
                "Try to polish his works in the creative writing class."
              ],
              "correctAnswer": "Keep trying even if he is turned down.",
              "variables": {
                "a": "What is Diana's suggestion to Tom?"
              }
            },
            {
              "answerOptions": [
                "He can get his poems published.",
                "He can contribute essays to the group.",
                "He can get some advice from other members."
              ],
              "correctAnswer": "He can get some advice from other members.",
              "variables": {
                "a": "Why does Tom agree to join the group?"
              }
            }
          ]
        },
        {
          "text": "W: Are you all right, Mark? Is anything wrong?\nM: I'm so homesick, I could die. All this studying, all this pressure, I just can't stand it.\nW: It takes time to get used to all this.\nM: Yes. But, you know, I lost sleep last night.\nW: It seems like you've really got the blues. Have you heard from home recently?\nM: It's been almost a month since I got a letter from my mum. I'm going to write to her and explain the situation. By the way, do you have an envelope that I can borrow?\nW: Sorry, I don't have any. I hardly ever send any letters.\nM: The bookstore is closed today. Is there another place I can get some stamps?\nW: You can go to the post office on North Street to buy stamps.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A student.",
                "A teacher.",
                "A postman."
              ],
              "correctAnswer": "A student.",
              "variables": {
                "a": "Who is the man?"
              }
            },
            {
              "answerOptions": [
                "Nearly a month.",
                "Nearly two weeks.",
                "Nearly a week."
              ],
              "correctAnswer": "Nearly a month.",
              "variables": {
                "a": "How long hasn't the man gotten a letter from his mother?"
              }
            },
            {
              "answerOptions": [
                "Go to the bookstore.",
                "Go to the post office.",
                "Get online."
              ],
              "correctAnswer": "Go to the post office.",
              "variables": {
                "a": "What will the man do next?"
              }
            }
          ]
        },
        {
          "text": "W: Well, you know I had a good time tonight.\nM: I'm pleased to hear that.\nW: But I have to say goodbye right now.\nM: Why? It's not late. Can't you stay a little longer?\nW: No, I'm sorry, but I really must go. I don't know whether I can catch the last bus if I don't hurry now.\nM: When does the bus go?\nW: At ten o'clock. Oh dear! It's already a quarter past ten.\nM: Don't worry, Kate. Since you have missed the bus, it is unnecessary for you to hurry. I can drive you home.\nW: Thank you. You are so kind. But my mother will worry about me if I'm too late getting home. I must get home before 11:00.\nM: That's all right. Let's go now. But I hope to have a chance to see you again.\nW: Thank you, John.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In a restaurant.",
                "At a pub.",
                "At John's home."
              ],
              "correctAnswer": "At John's home.",
              "variables": {
                "a": "Where are the two speakers?"
              }
            },
            {
              "answerOptions": [
                "She didn't like to stay any longer with John.",
                "She was afraid of walking alone at night.",
                "She didn't want to make her mother worried."
              ],
              "correctAnswer": "She didn't want to make her mother worried.",
              "variables": {
                "a": "Why did she have to leave at that time?"
              }
            },
            {
              "answerOptions": [
                "She took the last bus back home.",
                "John drove her back home.",
                "She drove John's car back home."
              ],
              "correctAnswer": "John drove her back home.",
              "variables": {
                "a": "How did Kate probably get back home?"
              }
            }
          ]
        },
        {
          "text": "W: Hello, Mr. Tompkins. Our newspaper is going to print an article about new products. Could you tell me about the new home your company has built? I understand it promises to be a model for the houses of the future.\nM: Certainly. The idea is not to have a house full of different things. This is a complete home system. It will make people's lives easier.\nW: OK! So tell me how this house will make my life easier?\nM: When you arrive at the front door, you won't need a key. The door will open with a touch of your finger. You'll be able to call your refrigerator when you're at the grocery store and find out how much you need to buy. Isn't it wonderful?\nW: Can I call the washing machine as well?\nM: Sure. But you won't need to. The house comes with a robot. It is programmed to clean the house and do the washing.\nW: What does it cost?\nM: A million dollars.\nW: A million dollars! It will be the 22nd century before I can afford to buy one!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Reporter and manager.",
                "Customer and salesman.",
                "Housewife and shopkeeper."
              ],
              "correctAnswer": "Reporter and manager.",
              "variables": {
                "a": "What is the probable relationship between the two speakers?"
              }
            },
            {
              "answerOptions": [
                "Shopping and calculating.",
                "Repairing and guarding.",
                "Cleaning and washing."
              ],
              "correctAnswer": "Cleaning and washing.",
              "variables": {
                "a": "What is the robot programmed to do?"
              }
            },
            {
              "answerOptions": [
                "It's safe enough.",
                "It's too expensive.",
                "It's worth buying."
              ],
              "correctAnswer": "It's too expensive.",
              "variables": {
                "a": "What does the woman think of the new home?"
              }
            }
          ]
        },
        {
          "text": "W: Mr. Parker, when did you arrive home yesterday evening?\nM: At about 8 o'clock.\nW: What did you do right after you entered your flat?\nM: Well, I washed my hands and then watched sports news.\nW: When did you have supper?\nM: At about a quarter to nine, I guess.\nW: Did you stay at home all evening?\nM: Yes.\nW: But your friend says that he found you several times between 8 and 9. But you didn't answer.\nM: Well, I think I was in the bath at that time.\nW: No, you weren't. You were not even at home last night. You robbed a bank in James Street.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He washed his hands.",
                "He had his supper.",
                "He took a path."
              ],
              "correctAnswer": "He washed his hands.",
              "variables": {
                "a": "According to the man, what did he do before he watched TV?"
              }
            },
            {
              "answerOptions": [
                "James Street.",
                "A restaurant.",
                "A friend's home."
              ],
              "correctAnswer": "James Street.",
              "variables": {
                "a": "What place had the man been to the night before?"
              }
            },
            {
              "answerOptions": [
                "To prove the truth.",
                "To find the truth.",
                "To hide the truth."
              ],
              "correctAnswer": "To hide the truth.",
              "variables": {
                "a": "What does the man try to do in the conversation?"
              }
            }
          ]
        },
        {
          "text": "M: Hi, Jane. It's nice to see you again. I heard that you went to the US during the vacation.\nW: Yes. I went to New York to attend a summer course in English.\nM: Wow. You were lucky. How long did you stay there?\nW: About 50 days. I went there on July 5th and came back on August 25th.\nM: How about the course?\nW: The course was very good. The teachers were nice. They taught us to listen, speak, read and write in English, but it was mostly speaking. One interesting thing I found was that the American classes are different from our classes here because the students have a lot more freedom. You can sit anywhere you like in the classroom. You can ask the teachers questions at any time during the class, and you are welcome to share your ideas with the class. I really like this kind of class.\nM: How interesting! Maybe our teacher should try that.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "To learn English.",
                "To do business.",
                "To visit her teachers."
              ],
              "correctAnswer": "To learn English.",
              "variables": {
                "a": "Why did the woman go to New York during the vacation?"
              }
            },
            {
              "answerOptions": [
                "In an American university.",
                "In New York.",
                "At home."
              ],
              "correctAnswer": "At home.",
              "variables": {
                "a": "Where was the woman on July 4th?"
              }
            },
            {
              "answerOptions": [
                "The students had a lot more freedom in class.",
                "The teachers were nice.",
                "There were a lot of activities in class."
              ],
              "correctAnswer": "The students had a lot more freedom in class.",
              "variables": {
                "a": "What did the woman like particularly about the American classes?"
              }
            }
          ]
        },
        {
          "text": "W: Can I help you?\nM: Yes, I'd like to read some articles that are on reserve about British culture.\nW: Professor Grand's class?\nM: That's right. How could you know?\nW: Let's just say you are not the first person coming in asking for those articles.\nM: Oh, well, seeing as how I haven't read any of them yet, it doesn't really matterwhich one you give me first.\nW: I'm afraid I can't give you any of them at the moment. They've all been checked out.\nM: You're joking, all of them?\nW: Every month. I've asked professor Grand twice already to bring in additional copies of the articles, but no sooner do I place them on the shelves than they are gone. See that girl in the black sweater? She's been waiting for half an hour for those same articles to be returned.\nM: And here's me. I went out of my way to free out the whole afternoon to read.\nW: I'm sorry, but there is not a whole lot I can do about it. All I can suggest is that you come in first thing tomorrow morning and try again. We open at eight.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "That the library opens at 8:00.",
                "That no one else has read the articles.",
                "That none of the material he needs is available."
              ],
              "correctAnswer": "That none of the material he needs is available.",
              "variables": {
                "a": "What is the man surprised to learn?"
              }
            },
            {
              "answerOptions": [
                "He is not cooperative.",
                "He already brought in extra copies of the articles.",
                "He has not read any of the articles himself."
              ],
              "correctAnswer": "He already brought in extra copies of the articles.",
              "variables": {
                "a": "What does the woman say about Professor Grand?"
              }
            },
            {
              "answerOptions": [
                "Return early the next day.",
                "Photocopy the articles he needs.",
                "Ask professor Grand for a copy of the articles."
              ],
              "correctAnswer": "Return early the next day.",
              "variables": {
                "a": "What does the woman suggest that the man do?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 2: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "W: Excuse me, but could you tell me when the plane for Berlin leaves?\nM: In 40 minutes, at eleven o'clock. The plane for Berlin leaves every two hours.\nW: How much is a second class ticket, please?\nM: We have only first class tickets left. It is $ 350 one way.\nW: OK. I'd like one for the next flight.\nM: I'm sorry, but I don't sell tickets. You can get one from the machine over there.\nW: All right. By the way, what's the gate number?\nM: Four. Down the hall and to the left.\nW: Thanks a lot.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In fourteen minutes.",
                "In more than two hours.",
                "At four o'clock."
              ],
              "correctAnswer": "In more than two hours.",
              "variables": {
                "a": "When will the next plane leave?"
              }
            },
            {
              "answerOptions": [
                "The 11 o'clock plane.",
                "The 1 o'clock plane.",
                "The 3 o'clock plane."
              ],
              "correctAnswer": "The 1 o'clock plane.",
              "variables": {
                "a": "Which plane will the woman take?"
              }
            },
            {
              "answerOptions": [
                "The woman will buy a first class ticket.",
                "The woman will spend 315 dollars for a ticket.",
                "The woman can buy a ticket from the man."
              ],
              "correctAnswer": "The woman will buy a first class ticket.",
              "variables": {
                "a": "What's the possible result?"
              }
            }
          ]
        },
        {
          "text": "M: What are you doing, Mary?\nW: I am cooking the dinner, John.\nM: Oh. Look! The Capital Building caught on a big fire today.\nW: What? How about the people in the building?\nM: More than 220 people were killed and the building was destroyed.\nW: It must have taken the fire fighters a long time to put it out.\nM: Yes, they spent about five hours putting it out. Hm, what a strange smell!\nW: Oh, I forgot the food cooking on the fire!\nM: Be quick! Turn the gas off. You should be careful next rime, otherwise you'd have our house on fire!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Cooking.",
                "The Capital Building.",
                "The fire of the Capital Building."
              ],
              "correctAnswer": "The fire of the Capital Building.",
              "variables": {
                "a": "What are John and Mary talking about?"
              }
            },
            {
              "answerOptions": [
                "More than 220 people.",
                "About 50 people.",
                "More than 300 people."
              ],
              "correctAnswer": "More than 220 people.",
              "variables": {
                "a": "How many people were killed in the fire?"
              }
            },
            {
              "answerOptions": [
                "He advises her to cook more quickly.",
                "He advises her to be careful of the fire.",
                "He advises her not to turn the gas off."
              ],
              "correctAnswer": "He advises her to be careful of the fire.",
              "variables": {
                "a": "What advice does John give Mary?"
              }
            }
          ]
        },
        {
          "text": "M: Mary, have you ever wondered why some cultures have more proverbs than others? For example, the Mayans, the Incas, and the North American Indian tribes seem to have fewer proverbs than cultures like, the Arabians, and the Chinese. I wonder why this is.\nW: What would you say about our ... our own culture? Would you say we're a culture that's rich in proverbs or one that lacks proverbs?\nM: I think we, we have a rich heritage of proverbs - the Benjamin Franklin maxims, proverbs, wise sayings have been handed down to us.\nW: Well, I think the fact that we're no longer creating proverbs today maybe says something ... maybe perhaps explains to some extent why proverbs in certain cultures were not as extended or extensive as in other cultures.\nM: Mm, hmm. That's true. I wonder why we are not creating as many proverbs as we did in 1700s and 1800s. I agree with you. I don't think there are nearly as many. I can't think of any. I'm sure there are some, but I wonder why this is so.\nW: Yeah, well, I think we all know a great many proverbs. If we sit down, we can think of some that we can ... we can list. But we don't seem to use them to explain things. We find many times that they're used too much and too simple - too general. Today we're much more sophisticated, you might say, and analytical, and therefore we don't use proverbs to explain things the way, say, our grandfathers and parents did.\nM: Life is too complicated now to just quote a simple proverb to take care of things.\nW: Right, and maybe to some extent that's why the North American Indians and the Mayans among others don't have as many proverbs. At least there's no record of as many proverbs. Since their own culture ... their traditions were highly eroded and they were wiped out during this era of change.\nM: Well, that's interesting.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "How proverbs are created.",
                "Why people don't use proverbs now.",
                "Why there are more proverbs in some cultures."
              ],
              "correctAnswer": "Why there are more proverbs in some cultures.",
              "variables": {
                "a": "What are the two speakers discussing?"
              }
            },
            {
              "answerOptions": [
                "They don't have a rich culture.",
                "They find proverbs too simple to explain things now.",
                "They don't like using proverbs."
              ],
              "correctAnswer": "They find proverbs too simple to explain things now.",
              "variables": {
                "a": "Why do the Americans have fewer proverbs now?"
              }
            },
            {
              "answerOptions": [
                "Mayans.",
                "Arabians.",
                "North American Indians."
              ],
              "correctAnswer": "Arabians.",
              "variables": {
                "a": "Who has a more developed culture according to the speaker?"
              }
            }
          ]
        },
        {
          "text": "W: Clinic, can I help you?\nM: This is Frank Smith. Can I make an appointment with Dr Milton?\nW: Yes, of course, Mr. Smith. Can you manage this afternoon?\nM: I am afraid not. I can manage tomorrow.\nW: I am afraid Dr Milton's not on duty tomorrow. He'll be here the day after tomorrow. That's Thursday, March 27th.\nM: Fine.\nW: Will 5:30 pm be all right?\nM: Yes. But what time is the clinic closed?\nW: We start at 5:00 am and close at 7:00 pm on weekdays. We don't work on the weekends.\nM: I'd prefer a later time.\nW: Then what about 6:15 pm?\nM: Well, that's fine.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A friend of the woman.",
                "A visitor to the clinic.",
                "A patient of Dr Milton."
              ],
              "correctAnswer": "A patient of Dr Milton.",
              "variables": {
                "a": "Who is Frank Smith?"
              }
            },
            {
              "answerOptions": [
                "At 7:00 pm, Tuesday.",
                "At 6:15 pm, Thursday.",
                "At 5:30 pm, Thursday."
              ],
              "correctAnswer": "At 6:15 pm, Thursday.",
              "variables": {
                "a": "When will Mr. Smith come?"
              }
            },
            {
              "answerOptions": [
                "He is not free.",
                "Dr Milton is not on duty.",
                "The hospital is closed."
              ],
              "correctAnswer": "Dr Milton is not on duty.",
              "variables": {
                "a": "Why can't Frank Smith come tomorrow?"
              }
            }
          ]
        },
        {
          "text": "W: When are you going to take your vacation?\nM: I've got a sixteen day vacation starting from July 1.\nW: Where are you going?\nM: Florida and Hong Kong.\nW: That's interesting. Is your family going as well?\nM: Yeah. We'll stay in Florida for ten days and spend the rest of the time in Hong Kong. Then plan to climb some mountains,go swimming and do some shopping.\nW: Have a good trip.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Shopping.",
                "Taking a vacation.",
                "Visiting a friend."
              ],
              "correctAnswer": "Taking a vacation.",
              "variables": {
                "a": "What are they talking about?"
              }
            },
            {
              "answerOptions": [
                "10 days.",
                "16 days.",
                "A couple of days."
              ],
              "correctAnswer": "16 days.",
              "variables": {
                "a": "How long will the man be away from home?"
              }
            },
            {
              "answerOptions": [
                "His family.",
                "Miss Emily.",
                "His family and the woman."
              ],
              "correctAnswer": "His family.",
              "variables": {
                "a": "Whom is he going with for the holiday?"
              }
            }
          ]
        },
        {
          "text": "M: What do you usually do in your spare time?\nW: I have joined a singing group and we practice two afternoons each week.\nM: That's a very interesting thing to do.\nW: Yes. It's a small group of only fifteen girls and boys. But nobody has been late for the practice.\nM: I see. How many songs can you sing now?\nW: We started only three months ago, but we've practiced eight songs.\nM: Are you going to perform any time?\nW: Yes, there will be a school show next month and we are going to sing a song in it. We are practicing a new song now. It's written by one of the singers in our group.\nM: Really? What's the name of the song?\nW: Sunny Days.\nM: That's a nice name. I hope to listen to it soon. Can I visit you when you practice?\n{a}",
          "instances": [
            {
              "answerOptions": [
                "It's made up of 15 girls.",
                "It practices once every other week.",
                "Every member comes on time for each practice."
              ],
              "correctAnswer": "Every member comes on time for each practice.",
              "variables": {
                "a": "What can we know about the singing group?"
              }
            },
            {
              "answerOptions": [
                "Practicing eight songs.",
                "Performing a new song.",
                "Practicing for a school show."
              ],
              "correctAnswer": "Practicing for a school show.",
              "variables": {
                "a": "What is the singing group doing these days?"
              }
            },
            {
              "answerOptions": [
                "Its name is Sundays.",
                "It's written by a famous musician.",
                "It's written by a singer of the group."
              ],
              "correctAnswer": "It's written by a singer of the group.",
              "variables": {
                "a": "What can we know about the new song?"
              }
            }
          ]
        },
        {
          "text": "W: I'm not looking forward to the English lesson tomorrow.\nM: Why not?\nW: Because the teacher has said that we're going to have a quiz.\nM: But you had a test week, didn't you?\nW: Yes, we did. That's why I don't want another one tomorrow,\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Have an English lesson.",
                "Have a history lesson.",
                "Have a Chinese lesson."
              ],
              "correctAnswer": "Have an English lesson.",
              "variables": {
                "a": "What does the girl not want to do?"
              }
            },
            {
              "answerOptions": [
                "Yesterday.",
                "Last week.",
                "Two weeks ago."
              ],
              "correctAnswer": "Last week.",
              "variables": {
                "a": "When did they have a test?"
              }
            },
            {
              "answerOptions": [
                "She likes tests very much.",
                "She likes English lessons better than English tests.",
                "She doesn't like English at all."
              ],
              "correctAnswer": "She likes English lessons better than English tests.",
              "variables": {
                "a": "What does this dialogue infer?"
              }
            }
          ]
        },
        {
          "text": "M: (Sniffing) Phew! Is that French coffee?\nW: Pardon?\nM: Is that French coffee you are drinking?\nW: Yes,that's right. Why? What's the matter?\nM: I don't understand why you drink French coffee. It makes a strong smell.\nW: I like it very much, I prefer it to English coffee.\nM: Have you got a lot of it?\nW: Yes. Why?\nM: Well.., er...could I get some from you?\nW: Get some from me? But...you don't like French coffee!\nM: No, I don't, but my wife does and I can't understand why.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "American coffee.",
                "French coffee.",
                "English coffee."
              ],
              "correctAnswer": "French coffee.",
              "variables": {
                "a": "What does the woman prefer?"
              }
            },
            {
              "answerOptions": [
                "He wants to do something for his wife.",
                "He wants to do something for the woman.",
                "He wants to help himself to some coffee."
              ],
              "correctAnswer": "He wants to do something for his wife.",
              "variables": {
                "a": "Why does the man start the talk?"
              }
            },
            {
              "answerOptions": [
                "Seller and buyer.",
                "Husband and wife.",
                "Friends."
              ],
              "correctAnswer": "Friends.",
              "variables": {
                "a": "What's the relationship between the two speakers?"
              }
            }
          ]
        },
        {
          "text": "M: Welcome. Last month big leap in new job, some 300, 000 plus, is a huge increase over what the country has seen in the past 6 months when the average growth has been just 75, 000 new jobs a month. For a closer look at what's happening, we turn to Lisa Lynch, an economics professor at Tofts University. Lisa Lynch, when you look at these numbers, do you think job creation is on the rise?\nW: It certainly is. It was a great report. It indicates that the job market, broadly speaking, has turned the corner after 3 very long, lean years. I think we are going to see improvement. It's not only the March gain. It was gain in January and February. They were both revised higher, and moreover, the job gains were very broadly-based across many industries. It was a very positive report.\nM: What do you see in the numbers? Who's getting the new jobs?\nW: As I mentioned, when we looked at the numbers, \"we are seeing employment across the board in all sectors, with one important exception, and that's in manufacturing. Well, we do not have any job loss in manufacturing sector for the first time in 44 months. We did not see pick up in the manufacturing sector, but we saw restaurant and hotel workers being added on. We saw workers in supermarket being added on. Part of that reflects the settlement of the grocery stores strike out California. We saw workers in the health care sector and hospitals being added on. We saw business services adding employees. So in general, with the very important exception of manufacturing, we are seeing job growth across all of these different types of occupations.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "There was a huge increase in new jobs lately.",
                "About 75, 000 new jobs were created last month.",
                "Some 300, 000 new workers were employed last year."
              ],
              "correctAnswer": "There was a huge increase in new jobs lately.",
              "variables": {
                "a": "What happened to the U. S. job market?"
              }
            },
            {
              "answerOptions": [
                "It should be revised.",
                "It is positive.",
                "It covers a broad area."
              ],
              "correctAnswer": "It is positive.",
              "variables": {
                "a": "What does Lisa Lynch think about the Labor Department's report?"
              }
            },
            {
              "answerOptions": [
                "Restaurants and hotels.",
                "Manufacturing.",
                "Health care and hospitals."
              ],
              "correctAnswer": "Manufacturing.",
              "variables": {
                "a": "In which sector is little job growth seen?"
              }
            }
          ]
        },
        {
          "text": "M: Hello, can I help you?\nW: Yes, I'd like to go on a sailing holiday this summer in Italy.\nM: Have you been sailing before?\nW: No. I wanted to go to Sweden last year, but I didn't have enough money.\nM: Well, it is quite expensive. Sailing holidays start at about three hundred pounds.\nW: Yes, my friends went in August last year. They paid four hundred and fifty pounds each. The most I can pay is three hundred and eighty pounds.\nM: Well, that should be enough. Would you like to be by the sea or a lake?\nW: Well, I'd prefer a lake in the mountains.\nM: Okay. The Aqua Center in north Italy will be best for you. That costs £370.\nW: Okay. Can I pay by credit card? I haven't got my checkbook.\nM: Yes, that's fine.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Never.",
                "Once.",
                "Twice."
              ],
              "correctAnswer": "Never.",
              "variables": {
                "a": "How many times has the woman been sailing before?"
              }
            },
            {
              "answerOptions": [
                "By check.",
                "With cash.",
                "By credit card."
              ],
              "correctAnswer": "By credit card.",
              "variables": {
                "a": "In which way will the woman pay for her trip?"
              }
            },
            {
              "answerOptions": [
                "The man is planning a trip for the woman.",
                "The woman is going to climb mountains.",
                "They are talking about their travel experience."
              ],
              "correctAnswer": "The man is planning a trip for the woman.",
              "variables": {
                "a": "What can we learn from the conversation?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 3: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "W: I'm losing my sleep. I feel tired and sleepy all the time. I've got to do something about it.\nM: I'm so sorry for you. But what are you going to do?\nW: I want to move out of the dorm and rent a small flat.\nM: That's a good idea. It will be much more convenient for you.\nW: But I need your help.\nM: How? To find one person for you?\nW: Yes\nM: I'll sleep on it tonight and tell you my decision tomorrow. OK?\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She has caught a cold.",
                "She has a headache.",
                "She feels tired and sleepy all the time."
              ],
              "correctAnswer": "She feels tired and sleepy all the time.",
              "variables": {
                "a": "What's wrong with the woman?"
              }
            },
            {
              "answerOptions": [
                "She wants to stop learning the text.",
                "She wants to rent a small flat.",
                "She wants to see a doctor."
              ],
              "correctAnswer": "She wants to rent a small flat.",
              "variables": {
                "a": "What's the woman going to do with the problem?"
              }
            },
            {
              "answerOptions": [
                "Because she is afraid of living by herself and she is short of money.",
                "Because she is afraid of seeing a doctor.",
                "Because she needs to rent a fiat."
              ],
              "correctAnswer": "Because she is afraid of living by herself and she is short of money.",
              "variables": {
                "a": "Why does the woman need the man's help?"
              }
            }
          ]
        },
        {
          "text": "W: Say, Fred, I read a bad review of the movie we were going to see tonight. Would you like to do something else? Maybe we could go to the jazz concert at the school auditorium instead. It starts at eight.\nM: I don't know whether I would like that kind of music or not, Mary.\nW: Well, in that case, let's go to the new production of Hamlet. It's supposed to be a good one, but tickets are hard to get.\nM: I think I'd like that. I'll meet you there at seven thirty.\nW: I think we should get there earlier to be sure we get tickets. Could you make it at seven?\nM: Sure. I'll see you then.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Go to a movie.",
                "Go to a concert.",
                "Go to a play."
              ],
              "correctAnswer": "Go to a movie.",
              "variables": {
                "a": "What had Fred and Mary first decided to do?"
              }
            },
            {
              "answerOptions": [
                "There was a bad review.",
                "He doesn't think he will like it.",
                "Tickets are hard to get."
              ],
              "correctAnswer": "He doesn't think he will like it.",
              "variables": {
                "a": "Why does Fred not want to go to the concert?"
              }
            },
            {
              "answerOptions": [
                "At 8:30.",
                "At 7:30.",
                "At 7:00."
              ],
              "correctAnswer": "At 7:00.",
              "variables": {
                "a": "When do Mary and Fred agree to meet?"
              }
            }
          ]
        },
        {
          "text": "M: Hi, Jenny. We will have our midterm exams next month. I plan to look for some important books and study at the library. Do you want to join me?\nW: Sure. I need to return some books. They are due today. Besides, I can also read some weekly publications, magazines and newspapers.\nM: Great. We can go to the swimming pool in the gymnasium after that.\nW: Sounds a good idea. Summer is approaching. Today's temperature has reached 35 degree Centigrade. Are you good at swimming?\nM: Well, that's a good question. I haven't swum for almost two years. I think I need more practice.\nW: Oh, it's almost 9. I need to hurry. I am running late now. See you after class at the gate of the library then. Bye!\nM: See you then.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Return some books.",
                "Prepare for the coming exam.",
                "Read some magazines and newspapers."
              ],
              "correctAnswer": "Prepare for the coming exam.",
              "variables": {
                "a": "What does the man plan to do in the library?"
              }
            },
            {
              "answerOptions": [
                "Spring.",
                "Summer.",
                "Autumn."
              ],
              "correctAnswer": "Spring.",
              "variables": {
                "a": "What season is it now?"
              }
            },
            {
              "answerOptions": [
                "In the classroom.",
                "In the gymnasium.",
                "In front of the library."
              ],
              "correctAnswer": "In front of the library.",
              "variables": {
                "a": "Where will they meet?"
              }
            }
          ]
        },
        {
          "text": "M: Hello, Ms Thomas. What can I do for you?\nW: Well, I've been having bad stomach pains lately, doctor.\nM: Oh, I'm sorry to hear that. How long have you been having them?\nW: Just in the last few weeks. I get a very sharp pain about an hour after having meals.\nM: I see. Do you get this after every meal?\nW: Let me think. No, it's usually in the afternoon, after lunch.\nM: Well, what do you have for lunch?\nW: Oh, I mostly just have a quick hamburger and rush back to the office. We're very busy at the moment.\nM: Well, I don't think it's a serious thing. Maybe you eat too quickly. It's bad for your health.\nW: My husband is always telling me that.\nM: Anyway, I'll give you something for it and see what happens. Take the medicine three times a day.\nW: After meals or before?\nM: After eating.\nW: Thank you, doctor.\nM: You're welcome.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In a restaurant.",
                "In a hospital.",
                "At the office."
              ],
              "correctAnswer": "In a hospital.",
              "variables": {
                "a": "Where does this conversation take place?"
              }
            },
            {
              "answerOptions": [
                "About an hour after she has eaten.",
                "About an hour before she has eaten.",
                "Just when she begins to eat."
              ],
              "correctAnswer": "About an hour after she has eaten.",
              "variables": {
                "a": "When does the woman get a pain in stomach?"
              }
            },
            {
              "answerOptions": [
                "He eats very quickly.",
                "He doesn't eat as quickly as his wife.",
                "He sometimes eats more slowly than his wife."
              ],
              "correctAnswer": "He doesn't eat as quickly as his wife.",
              "variables": {
                "a": "What can you conclude about the woman's husband from this conversation?"
              }
            }
          ]
        },
        {
          "text": "W: Hello, Thomas Brothers.\nM: Hello, this is Mike Landon here. Is Jack Cooper there by any chance?\nW: I am afraid not, he is away for a day or two, back on, let's see, Monday morning.\nM: Oh, well perhaps I can live a message for him.\nW: Yes, of course, just a minute. Now, let's see, to Jack Cooper from Mike London.\nM: No, Landon, L-a-n-d-o-n.\nW: Sorry, yes, got that, and what's the message?\nM: Well it's just this: could he come to a meeting on Monday afternoon at 5:00 pm?\nW: That's this coming Monday, October 12th?\nM: Right, it's to discuss the new factory in France.\nW: Fine, I've got that. I will see that he gets it as soon as he comes in on Monday.\nM: Good, thank you, goodbye.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Thomas Brothers.",
                "Mike Landon.",
                "Jack Cooper."
              ],
              "correctAnswer": "Mike Landon.",
              "variables": {
                "a": "Who is making the telephone call?"
              }
            },
            {
              "answerOptions": [
                "His wife.",
                "His boss.",
                "His secretary."
              ],
              "correctAnswer": "His secretary.",
              "variables": {
                "a": "What relation is the woman to Mr. Cooper?"
              }
            },
            {
              "answerOptions": [
                "A meeting.",
                "A visit to France.",
                "The date for a trip."
              ],
              "correctAnswer": "A meeting.",
              "variables": {
                "a": "What is the message about?"
              }
            }
          ]
        },
        {
          "text": "M: Hello, Joan. Why are you late today? You are never late for work.\nW: No, I never. But ...\nM: Wow! You coat's got very dirty! Did you fall?\nW: Yes, I had a terrible experience on the underground train. Listen to this! A man came up to me and pulled out a knife. He pointed it right at me!\nM: Oh, no! Are you all right? Did he hurt you?\nW: No, he didn't hurt me, but he took my handbag.\nM: Then what happened? What did you do?\nW: I caught hold of his knife, and he pushed me to the floor.\nM: Oh, no! Why did you catch hold of his knife? That's dangerous.\nW: I don't know. I didn't think.\nM: What did the other passengers do? Did they help you?\nW: Yes, they did. Two men ran after the robber and held him.\nM: Did the police come?\nW: Yeah. The conductor called a policeman, and he took the robber to the police station.\nM: Wow! What a story! Thank God you're all right.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She got up very late that morning.",
                "The train was late.",
                "She was robbed and tried to catch the robber."
              ],
              "correctAnswer": "She was robbed and tried to catch the robber.",
              "variables": {
                "a": "Why was Joan late for work?"
              }
            },
            {
              "answerOptions": [
                "Her handbag.",
                "Some money.",
                "Her wallet."
              ],
              "correctAnswer": "Her handbag.",
              "variables": {
                "a": "What was robbed of her?"
              }
            },
            {
              "answerOptions": [
                "There are more and more robbers nowadays.",
                "The woman was very brave.",
                "The woman often got her coat dirty."
              ],
              "correctAnswer": "The woman was very brave.",
              "variables": {
                "a": "What do we learn from the conversation?"
              }
            }
          ]
        },
        {
          "text": "M: Wow, I had no idea it was going to be so sunny here! I thought Alaska was supposed to be cold.\nW: Well, it is pretty cold for much of the year. But during the summer, it's just as warm as it is in states like Washington and Oregon.\nM: Interesting. The days are really long right now. I don't think the sun has been down for more than a few hours the whole time I've been here.\nW: Yeah, that's another interesting thing about the summers here. We're so far north that we're exposed to the sun for almost the entire day. In winter, the opposite is true.\nM: You mean it's dark the whole time?\nW: Well, not the whole time... but maybe for two-thirds of every day from December to February.\nM: Whoa! How do you make it through every year? As a California native, I wouldn't be able to handle that for more than one season!\nW: I guess I'm used to it. When I was a kid, it was pretty fun to play with flashlights and have campfires outside in the afternoon. I never noticed that life was worse because it was always dark.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "They are very dark.",
                "They are pretty cold.",
                "They ale quite bright."
              ],
              "correctAnswer": "They ale quite bright.",
              "variables": {
                "a": "What aye the summers like in Alaska?"
              }
            },
            {
              "answerOptions": [
                "In Oregon.",
                "In California.",
                "In Washington."
              ],
              "correctAnswer": "In California.",
              "variables": {
                "a": "Where did the man grow up?"
              }
            },
            {
              "answerOptions": [
                "She doesn't mind them at all.",
                "She thinks they have gotten worse.",
                "She couldn't stand them for very long."
              ],
              "correctAnswer": "She doesn't mind them at all.",
              "variables": {
                "a": "What does the woman think of the winters in Alaska?"
              }
            }
          ]
        },
        {
          "text": "W: Hello. Sunnyside Hotel. May I help you?\nM: Yes, I'd like to book a room for two on the 21st of March.\nW: Okay. Let me check our books here for a moment. The 21st of May, right?\nM: No. March, not May.\nW: Oh, sorry. Let me see here. Hmm,\nM: Are you all booked that night?\nW: I'm sorry. They are all booked that day.\nM: Then do you have a room available either on the 20th or the 22nd?\nW: Well, would you like a smoking or non-smoking room?\nM: Non-smoking, please.\nW: Okay, we do have a few rooms available on the 20th; we're full on the 22nd, unless you want a smoking room.\nM: Well, how much is the non-smoking room on the 20th?\nW: $ 80, plus the 10% room tax.\nM: Okay, that'll be fine.\nW: All right. Could I have your name, please?\nM: Yes. David Smith.\nW: Okay, Mr. Smith, we look forward to seeing you.\nM: Okay. Goodbye.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "March 21st.",
                "March 20th.",
                "March 22nd."
              ],
              "correctAnswer": "March 20th.",
              "variables": {
                "a": "For which day does the man book a room finally?"
              }
            },
            {
              "answerOptions": [
                "A non-smoking room.",
                "A smoking room.",
                "Either one is okay."
              ],
              "correctAnswer": "A non-smoking room.",
              "variables": {
                "a": "What kind of room does the man prefer?"
              }
            },
            {
              "answerOptions": [
                "80 dollars.",
                "88 dollars.",
                "90 dollars."
              ],
              "correctAnswer": "88 dollars.",
              "variables": {
                "a": "Including tax, how much is the man's room?"
              }
            }
          ]
        },
        {
          "text": "M: Don't be mad at me. I'm only five minutes late.\nW: This is the last time I'm waiting for you. I mean it.\nM: You know, I always have a good excuse. I promise you: you'll never have to wait for me again.\nW: I hope so. Come on, let's go get our tickets now. Oh, by the way, you have got your wallet with you, don't you? I left mine at home.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She doesn't believe the man's excuse.",
                "She's been waiting far too long.",
                "She's really angry with the man."
              ],
              "correctAnswer": "She's really angry with the man.",
              "variables": {
                "a": "What do you know about the woman?"
              }
            },
            {
              "answerOptions": [
                "He got there in only five minutes.",
                "He has a good reason for being late.",
                "He is used to waiting for the woman."
              ],
              "correctAnswer": "He has a good reason for being late.",
              "variables": {
                "a": "What does the man mean?"
              }
            },
            {
              "answerOptions": [
                "Buy the tickets.",
                "Buy her a wallet.",
                "Go back for her wallet"
              ],
              "correctAnswer": "Buy the tickets.",
              "variables": {
                "a": "What does the woman want the man to do?"
              }
            }
          ]
        },
        {
          "text": "M: You know the weather's been awful so far this summer.\nW: I know. This is very unusual for Japan. Usually by now, it's really hot and humid. I'm not sure why, but this summer we've had very little rain and surprisingly cool temperatures.\nM: Well, either way I love it. I remember last summer. Oh, it was terrible. I didn't have an air-conditioner, and my apartment was on the fifth floor. Every night I slept on top of my bed with the windows wide-open and a fan six inches from my face.\nW: That sounds pretty tough. I guess I've gotten used to the heat, so I don't notice it as much. However, last year was definitely a lot hotter than this year. And, to be honest, I am enjoying the break. What are summers like for you back home?\nM: For one thing, there's little humidity. Seattle is right on the ocean so we always have a nice offshore breeze blowing in, and it doesn't really get hot until late July. That's why I found it so oppressive last year. Our summers are just so different.\nW: Interesting. Seattle sounds like a great place to be during the summer.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "It rained every day so he had nothing to do but sleep.",
                "He had no air-conditioner so he left the window wide-open every night.",
                "He slept with no fan at all."
              ],
              "correctAnswer": "He had no air-conditioner so he left the window wide-open every night.",
              "variables": {
                "a": "What kind of situation was the boy in last summer?"
              }
            },
            {
              "answerOptions": [
                "She doesn't agree with the boy on last summer's weather.",
                "She is not accustomed to the heat.",
                "She enjoys the summer holiday."
              ],
              "correctAnswer": "She enjoys the summer holiday.",
              "variables": {
                "a": "What do we know about the girl?"
              }
            },
            {
              "answerOptions": [
                "Seattle is a coastle city.",
                "Seattle doesn't get hot until late July.",
                "It is rather humid in Seattle in summer."
              ],
              "correctAnswer": "It is rather humid in Seattle in summer.",
              "variables": {
                "a": "What is NOT true on Seattle according to the boy?"
              }
            }
          ]
        }
      ]
    }
  ]
}