{
  "courseId": "5e3a7682-ad09-48b0-8743-f6a721c9e82d",
  "title": "Everyday English Course 29",
  "description": "Improve your English comprehension skills through short everyday conversations and situational dialogues.",
  "imageUrl": "/public/images/courses/end46c00-6746-4c45-a867-a8f08666a5c6.png",
  "totalSections": 3,
  "sections": [
    {
      "title": "Section 1: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "M: There will be a party at my new house this Saturday. Would you like to come?\nW: That sounds good, but I have French class in the morning and dance class in the afternoon.\nM: That's OK. The party is to start in the evening, and you can come after the dance class.\nW: Great! Should I bring something?\nM: Yes, it's a potluck party, so you should prepare something to eat.\nW: No problem. A roast turkey, salad, or pudding... I was wondering which to prepare.\nM: Anything will be fine.\nW: I think I'm good at pudding. I'll make banana-flavored pudding for you.\nM: Nice. See you then.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In the morning.",
                "In the afternoon.",
                "In the evening."
              ],
              "correctAnswer": "In the evening.",
              "variables": {
                "a": "When will the party be held?"
              }
            },
            {
              "answerOptions": [
                "Puddings.",
                "Salads.",
                "Turkey"
              ],
              "correctAnswer": "Puddings.",
              "variables": {
                "a": "What will the woman probably bring?"
              }
            }
          ]
        },
        {
          "text": "W: John, my dad's new MP3 player seems to be missing. Did you move it?\nM: No, I didn't. Isn't it right next to the computer?\nW: No, and I don't see it anywhere. I have the feeling one of our party guests took it.\nM: Really? What are you going to do now?\nW: I'll just tell my parents what happened, I guess.\nM: Then they'll know you had people over without permission. Won't they be angry about that?\nW: Probably. I wish I'd done that from the start, instead of keeping my plans secret. They'd have said no to a party, and the MP3 player would still be here.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "The girl.",
                "The boy.",
                "One of the girl's guests."
              ],
              "correctAnswer": "One of the girl's guests.",
              "variables": {
                "a": "Who seemed to have taken the MP3 player?"
              }
            },
            {
              "answerOptions": [
                "Not telling her parents about the party.",
                "Not keeping her plans secret.",
                "Not keeping tile MP3 player well."
              ],
              "correctAnswer": "Not telling her parents about the party.",
              "variables": {
                "a": "What did the girl regret?"
              }
            }
          ]
        },
        {
          "text": "M: Lin Yang. It's twelve already. What about having some thing to eat?\nW: Are you hungry?\nM: Well, I am a bit. Aren't you?\nW: Not very. But I don't mind going somewhere for a light meal.\nM: Where shall we go? What about McDonald's?\nW: I'm fed up with French fries and hamburgers. I think we'd better go to the restaurant around the corner. It's a family-type. It serves good food at very reasonable prices.\nM: OK, let's go.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Breakfast.",
                "Brunch.",
                "Lunch."
              ],
              "correctAnswer": "Lunch.",
              "variables": {
                "a": "What meal are they going to have?"
              }
            },
            {
              "answerOptions": [
                "Expensive.",
                "Cheap.",
                "Reasonable."
              ],
              "correctAnswer": "Reasonable.",
              "variables": {
                "a": "What does the woman think of the food price in the restaurant around the corner?"
              }
            }
          ]
        },
        {
          "text": "M: Hello, Kate. Have you been to the new sports center yet?\nW: Not yet. Where is it?\nM: On Mill Road, near Stone Street, behind Santa Station.\nW: What about it?\nM: It's wonderful. You can do a lot of sports there. I played table tennis last Saturday, and watched a basketball match.\nW: What about the swimming pool?\nM: It's very good. Would you like to go there with me next week?\nW: Good idea. Every day is OK except Monday.\nM: Well. Why not go there on Saturday? Then we can stay for a long time.\nW: OK. See you.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "On Mill Road.",
                "Near Santa Station.",
                "Behind Stone Street."
              ],
              "correctAnswer": "On Mill Road.",
              "variables": {
                "a": "Where is the new sports center?"
              }
            },
            {
              "answerOptions": [
                "Went swimming.",
                "Played table tennis.",
                "Played basketball."
              ],
              "correctAnswer": "Played table tennis.",
              "variables": {
                "a": "What did the man do last week?"
              }
            }
          ]
        },
        {
          "text": "M: Hi, Sally.\nW: Hello, Tom. How are you?\nM: I'm fine. Where are you going?\nW: Oh, I'm on my way home from work.\nM: I didn't know you had a job.\nW: Yeh. I work part-time at a supermarket.\nM: What do you do there?\nW: I work in the produce section. Trimming and wrapping fresh fruit and vegetables. I also stock shelves. Sometimes when it really gets busy, work at the check-out counter. Have you got a job, Tom?\nM: Yeh. I do yard work for people. You know, cutting grass, raking leaves. pulling weeds, things like that.\nW: I'd like doing that. It must be nice to work outdoors.\nM: Sometimes it is. Except when it rains or snows or gets too hot or too cold or...\nW: Ha. Ha. I think every job has its shortcomings. There are times when get pretty tired of carrying things around at my job. But a job's a job Gotta earn money for school.\nM: Me, too. Tuition is sure high, isn't it? Well, I'd better get going. I've got to plant some trees for my neighbours this afternoon.\nW: Well, don't work too hard. Holding down a job, going to class, studying. Sometimes it can become too much for one person. Take it easy.\nM: You, too. It was great seeing you. Sally!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He sometimes has to work in bad weather.",
                "He has to work too many hours.",
                "He doesn't have time for lunch."
              ],
              "correctAnswer": "He sometimes has to work in bad weather.",
              "variables": {
                "a": "Why doesn't Tom like his job?"
              }
            },
            {
              "answerOptions": [
                "Finish his homework.",
                "Cut grass.",
                "Plant trees."
              ],
              "correctAnswer": "Plant trees.",
              "variables": {
                "a": "What is Tom going to do next?"
              }
            }
          ]
        },
        {
          "text": "W: I like this apartment. Do you think we can afford it?\nM: Yes, I think so. It's not a very expensive apartment. It's in the right area, and it has everything that we are looking for. The rooms are quite large, too.\nW: I love the balcony. We can sit outside and enjoy the sun in summer. We are on the 12th floor now, so there's a very nice view from the balcony.\nM: The neighborhood is nice, too. There is a park nearby.\nW: Yes, and there are many houses nearby. I like it that the neighborhood isn't full of apartment blocks.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "It's too expensive.",
                "It's exactly what he wants.",
                "The rooms should be larger."
              ],
              "correctAnswer": "It's exactly what he wants.",
              "variables": {
                "a": "What does the man think of the apartment?"
              }
            },
            {
              "answerOptions": [
                "A park.",
                "A parking lot.",
                "Many apartments."
              ],
              "correctAnswer": "A park.",
              "variables": {
                "a": "What is nearby?"
              }
            }
          ]
        },
        {
          "text": "M: Good morning. Anything wrong?\nW: I've been suffering from a fever since yesterday.\nM: Do you have any other problems? Like a headache or cough?\nW: No, I don't. I think it's only a fever.\nM: Let me check... It's 39 degrees. I'll give you some medicine.\nW: Thank you, doctor.\nM: You'd better take two or three days' rest.\nW: Thanks.\nM: This medicine is for one day only. Take two pills as soon as you get home, and another two before going to bed.\nW: I see. Thank you.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She has a cough.",
                "She has a headache.",
                "She has a fever."
              ],
              "correctAnswer": "She has a fever.",
              "variables": {
                "a": "What's wrong with the woman?"
              }
            },
            {
              "answerOptions": [
                "One day.",
                "Two days.",
                "Three days."
              ],
              "correctAnswer": "One day.",
              "variables": {
                "a": "How long is the medicine for?"
              }
            }
          ]
        },
        {
          "text": "M: Do you remember the days in our small cabin last summer?\nW: Yes, of course. I especially like the walk in the mountain.\nM: If you'd like to, we can go there again this summer.\nW: I'd love to enjoy the moment of peace out there.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "They went to the beach.",
                "They went to the mountain.",
                "They went to the riverside."
              ],
              "correctAnswer": "They went to the mountain.",
              "variables": {
                "a": "Where did they go last summer?"
              }
            },
            {
              "answerOptions": [
                "She liked to take a walk in the mountain.",
                "She liked to enjoy the silence.",
                "She liked to live in the cabin."
              ],
              "correctAnswer": "She liked to take a walk in the mountain.",
              "variables": {
                "a": "What did the woman especially like to do?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, Robert, what happened to your face? It looks swollen.\nM: I have to go and get my teeth filled.\nW: Did it hurt?\nM: I don't even want to talk about it. It killed me!\nW: Well, I guess you've learned a good lesson, huh! You have to take good care of your teeth.\nM: No kidding. I can't stand the pain, but the bill is too large!\nW: Don't you have a dental insurance?\nM: I do. but it doesn't cover everything.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Headache.",
                "Toothache.",
                "Insurance."
              ],
              "correctAnswer": "Toothache.",
              "variables": {
                "a": "What is the topic of the dialogue?"
              }
            },
            {
              "answerOptions": [
                "Learn how to prevent pain.",
                "Know how to stand the pain.",
                "Take good care of his teeth."
              ],
              "correctAnswer": "Take good care of his teeth.",
              "variables": {
                "a": "What should the man do according to the woman?"
              }
            }
          ]
        },
        {
          "text": "M: Still feeling ill?\nW: Yes. And that medicine hasn't helped. Not a good start to our vacation, I'm afraid.\nM: Do you have any idea what caused it?\nW: Well, I thought it might be last night's dinner.\nM: But I am fine. Could it be the heat? It's enough to make anyone ill.\nW: I know. But we've been here a week now. Anyway, I've been careful in the sun and I've been drinking bottled water.\nM: Then we'd better stay in the hotel today.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Bast night's dinner.",
                "The hot weather.",
                "Bottled wather."
              ],
              "correctAnswer": "The hot weather.",
              "variables": {
                "a": "What does the man think is the cause of the woman's illness?"
              }
            },
            {
              "answerOptions": [
                "Husband and wife.",
                "Doctor and patient.",
                "Guest and receptionist."
              ],
              "correctAnswer": "Husband and wife.",
              "variables": {
                "a": "What is the probable relationship between the two speakers?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 2: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "M: I just saw Professor Black. He finished the budget for our concert tour. It's going to cost $1,500 per person.\nW: Where are we going to get that kind of money?\nM: It sounds like a lot, but by the time you add up the air fare, meals and hotels, it's pretty reasonable.\nW: But I doubt we'll all be able to go. Remember there were 32 people in the band last year.\nM: We can make it. For our last trip, we got some money from some companies.\nW: Who was in charge of money raising?\nM: Mary. She took care of it last time.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Expenses of a concert tour.",
                "A coming concert.",
                "A travel experience."
              ],
              "correctAnswer": "Expenses of a concert tour.",
              "variables": {
                "a": "What are the speakers mainly talking about?"
              }
            },
            {
              "answerOptions": [
                "Act as a director.",
                "Leave for a vacation.",
                "Take charge of money raising."
              ],
              "correctAnswer": "Take charge of money raising.",
              "variables": {
                "a": "What will Mary probably do?"
              }
            }
          ]
        },
        {
          "text": "M: Hello, Nancy. This is Bob. How are you?\nW: Fine, thank you. A hit too busy though. You know, I'm trying to put everything in order in my new flat.\nM: Oh, I see. Well, I am wondering if you'd like to go to a concert tomorrow night. I think it will be good. And if I remember correctly, you did say you liked country music.\nW: Yes. That's fight. It's nice of you to ask, Bob. But I don't think I can. Mother has already asked me to see a friend and then we'll go to the theatre together. In fact she's getting the tickets this evening.\nM: Oh, well, never mind. What about next weekend? This concert is still on then, I think, if you are free next Saturday.\nW: Oh, I'd like to very much. But what time exactly?\nM: It starts at 7:30, I think.\nW: Oh, good. That'll be fine. The tennis match will be over by 5 o'clock, I'm sure.\nM: Good, I'll call you again when I get the tickets.\nW: Sure. Bye.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "To ask if she's got the tickets.",
                "To invite her out for an evening concert.",
                "To offer his help with her new flat."
              ],
              "correctAnswer": "To invite her out for an evening concert.",
              "variables": {
                "a": "Why did Bob call Nancy?"
              }
            },
            {
              "answerOptions": [
                "Watching a tennis match.",
                "Cleaning up the new flat.",
                "Visiting a friend with Margaret."
              ],
              "correctAnswer": "Watching a tennis match.",
              "variables": {
                "a": "What will Nancy be doing next Saturday afternoon?"
              }
            }
          ]
        },
        {
          "text": "M: Did you hear what Fred did last night?\nW: No,not yet. What happened to him?\nM: I guess he was a little drunk and he had a fight with his brother. Well, he got so mad that he drove his car straight into the front of a drugstore.\nW: What do you mean?\nM: I mean he drove inside. The front of the store was completely destroyed. I actually saw it just now as I walked by. The car is still inside the store.\nW: I'm afraid Fred is in trouble. Where is he now?\nM: I hear he's in the police station. It's lucky no one was hurt.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "His brother.",
                "The policeman.",
                "The storekeeper."
              ],
              "correctAnswer": "His brother.",
              "variables": {
                "a": "Who did Fred have a fight with last night?"
              }
            },
            {
              "answerOptions": [
                "Fred was slightly hurt.",
                "The car was moved away by the policemen.",
                "The drugstore was destroyed by Fred."
              ],
              "correctAnswer": "The drugstore was destroyed by Fred.",
              "variables": {
                "a": "What can we learn from the conversation?"
              }
            }
          ]
        },
        {
          "text": "W: Good morning, sir. May I help you?\nM: Oh, yes. I'm looking for a pair of sports shoes in size 8.\nW: Are you looking for a pair for yourself?\nM: No. It's for my 17-year-old son.\nW: OK. Follow me, please...What do you think of this pair?\nM: They look nice. How much are they?\nW: They are 40 dollars, but I can give you a 10 percent discount.\nM: Good.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Size 7",
                "Size 8.",
                "Size 10."
              ],
              "correctAnswer": "Size 8.",
              "variables": {
                "a": "What size shoes does the man's son wear?"
              }
            },
            {
              "answerOptions": [
                "$32.",
                "$36.",
                "$40."
              ],
              "correctAnswer": "$36.",
              "variables": {
                "a": "How much will the man pay?"
              }
            }
          ]
        },
        {
          "text": "M: Hello, Susan.\nW: Macman Dossor, my favorite customer. How are you?\nM: I'm fine. I heard you weren't well.\nW: Well, I was away for a couple of weeks. But I an, fine now. Er, you were going to the States, weren't you?\nM: Well, I didn't make it. What I've been doing is reorganizing the whole department nonstop since I saw you, and I just haven't had a moment to myself. This is the first time I've been in here since Christmas.\nW: Well, it's good to see you again. Are you ready to order?\n{a}",
          "instances": [
            {
              "answerOptions": [
                "The man has been to the States.",
                "The man has been busy.",
                "The man has been ill."
              ],
              "correctAnswer": "The man has been busy.",
              "variables": {
                "a": "Why haven't they seen each other lately?"
              }
            },
            {
              "answerOptions": [
                "To report for duty.",
                "To do business.",
                "To have dinner."
              ],
              "correctAnswer": "To have dinner.",
              "variables": {
                "a": "Why does the man come to the place?"
              }
            }
          ]
        },
        {
          "text": "W: Why don't you sit down? Now, there are several questions I must ask, if you don't mind.\nM: Not at all. Go ahead.\nW: What is the purpose of your visit to the States?\nM: I'm going to attend a conference on air pollution.\nW: When and where is this conference being held?\nM: It's being held in the first three weeks of February at the University of Stanford in California.\nW: Who will pay your expenses?\nM: The University of California. Here is the official letter of invitation.\nW: I see. Fine. When do you want to go?\nM: I'd like to leave in mid-January if my passport is ready by then.\nW: That shouldn't be difficult. Why don't you phone me about January 10th? I should be able to give you an answer then.\nM: Thank you.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In early January.",
                "In mid-January.",
                "In early February."
              ],
              "correctAnswer": "In mid-January.",
              "variables": {
                "a": "When does the man want to leave for America?"
              }
            },
            {
              "answerOptions": [
                "A scientist.",
                "A reporter.",
                "Am embassy staff."
              ],
              "correctAnswer": "Am embassy staff.",
              "variables": {
                "a": "What is probably the woman's job?"
              }
            }
          ]
        },
        {
          "text": "M: Any interesting jobs listed on the Internet today?\nW: Well, there are a lot of retail jobs-selling clothes and stuff. But you have to work Saturdays and Sundays.\nM: Hmm. I hate working on weekends.\nW: Hmm... so do I.\nM: Oh, here's a job in sales. It's a job selling children's books to bookstores.\nM: That sounds interesting.\nW: Yes.\nM: Let's see.\nW: You need to have a driver's license. And you have to work some evenings.\nM: I don't mind working evenings during the week. And I enjoy driving. So, what's the phone number?\nW: It's 798-3455.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Reading newspapers.",
                "looking for jobs.",
                "Surfing the Internet."
              ],
              "correctAnswer": "Surfing the Internet.",
              "variables": {
                "a": "What was the woman probably doing?"
              }
            },
            {
              "answerOptions": [
                "Because it was to sell clothes and stuff.",
                "Because the employee has to work Saturdays and Sundays.",
                "Because it was to sell children's books."
              ],
              "correctAnswer": "Because the employee has to work Saturdays and Sundays.",
              "variables": {
                "a": "Why did the man dislike the first job?"
              }
            }
          ]
        },
        {
          "text": "M: Can I help you?\nW: Yes, well, I bought this tie last week for my husband's birthday, and er...well he doesn't like it. Could I change it for something else, such as a shirt or a hat?\nM: Certainly, madam, provided that it hasn't been worn, and if you have the receipt.\nW: Yes, here it is.\nM: OK, er... this tie looks as if it were worn. I'm afraid I can't put that back on the shelf.\nW: Oh, that's a pity.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A hat.",
                "A tie.",
                "A shirt."
              ],
              "correctAnswer": "A tie.",
              "variables": {
                "a": "What did the woman buy as her husband's birthday present?"
              }
            },
            {
              "answerOptions": [
                "Because the woman didn't show him the receipt.",
                "Because the thing she wanted to change had been worn.",
                "Because the woman told a lie."
              ],
              "correctAnswer": "Because the thing she wanted to change had been worn.",
              "variables": {
                "a": "Why did the assistant refuse to help the woman?"
              }
            }
          ]
        },
        {
          "text": "M: I don't like our new teacher. Do you?\nW: Oh, he's not too bad. I've had worse teachers.\nM: Doesn't he give us too much homework?\nW: Yes. He does give us a lot.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He is too bad.",
                "He is not too bad.",
                "He is good."
              ],
              "correctAnswer": "He is not too bad.",
              "variables": {
                "a": "How does the woman think of the new teacher?"
              }
            },
            {
              "answerOptions": [
                "at a repair shop.",
                "at school.",
                "at an airport."
              ],
              "correctAnswer": "at school.",
              "variables": {
                "a": "Where are they?"
              }
            }
          ]
        },
        {
          "text": "W: Did you hear Jakie's going to work in another department? We need to have a really good party so that we can send her off really well. So, what shall we do?\nM: Why don't we have a surprise party, Maggie?\nW: That's a good idea. We could go to the Holiday Inn Hotel.\nM: That's too expensive. Maybe we can ask Carrie to make a cake.\nW: Yeah, let's do that. Perhaps we could just give the party in the office and put up some balloons.\nM: That's great. I think we should also buy a really big card, a huge card, and we should get everybody to sign it.\nW: Shall we have some music?\nM: I was thinking exactly that myself. But ...\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Ask Carrie for help.",
                "Buy a huge cake.",
                "Play cards."
              ],
              "correctAnswer": "Ask Carrie for help.",
              "variables": {
                "a": "What do the speakers decide to do?"
              }
            },
            {
              "answerOptions": [
                "Maggie.",
                "The man.",
                "Jackie."
              ],
              "correctAnswer": "Jackie.",
              "variables": {
                "a": "Who will probably get surprised at the party?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 3: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "M: Hi Alice, what are you doing? You look worried.\nW: Oh. There's something wrong with my electronic calculator.\nM: Do you want me to have a look at it?\nW: It's very kind of you, but I would like to have a try first. Er... You know... I can do without it in class this afternoon.\nM: Oh, well, if you need any help, just let me know. I'm free after school.\nW: I will. Thank you very much.\nM: You're welcome.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Offering help.",
                "Giving advice.",
                "Making appointments."
              ],
              "correctAnswer": "Offering help.",
              "variables": {
                "a": "What is the man doing?"
              }
            },
            {
              "answerOptions": [
                "Doctor and patient.",
                "Husband and wife.",
                "Classmates."
              ],
              "correctAnswer": "Classmates.",
              "variables": {
                "a": "What is the relationship between the two speakers?"
              }
            }
          ]
        },
        {
          "text": "W: What do you want to do tonight?\nM: How about going to the cinema? I haven't seen a movie for a long time and I really miss it.\nW: What do you want to see?\nM: There's a good film at the Green House Cinema,The Speed and Passion 8. I've watched all the former movies in that series and I really like them. The movie starts at 6:15 pm.\nW: I don't think I can make it. I won't be able to leave the office until 6:00 pm.\nM: Then let's watch the one that starts at 8:20 pm. We can eat first and then go to the cinema.\nW: That sounds better.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Six.",
                "Seven.",
                "Eight."
              ],
              "correctAnswer": "Seven.",
              "variables": {
                "a": "How many movies in that series has the man watched?"
              }
            },
            {
              "answerOptions": [
                "At 6:00 pm.",
                "At 6:15 pm.",
                "At 8:20 pm."
              ],
              "correctAnswer": "At 8:20 pm.",
              "variables": {
                "a": "When will the speakers watch the movie?"
              }
            }
          ]
        },
        {
          "text": "W: May I help you, sir?\nM: Yes, please. I want to buy a personal gift for my brother. He's taking a trip to South America.\nW: Is he going by ship or plane?\nM: He,s flying. My gift will have to be something light in weight. What can you suggest?\nW: What about this tie? It's made of pure silk.\nM: My sister already gave him one. I'd like something unusual. Let me look around...oh, that clock looks nice, but...\nW: Hey,here is a gift for the man who has everything.\nM: Oh,a folding toothbrush! That's a wonderful idea! I'll take it.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "By ship.",
                "By plane.",
                "By train."
              ],
              "correctAnswer": "By plane.",
              "variables": {
                "a": "How will the man's brother go to South America?"
              }
            },
            {
              "answerOptions": [
                "A toothbrush.",
                "A silk tie.",
                "A clock."
              ],
              "correctAnswer": "A toothbrush.",
              "variables": {
                "a": "What will the man probably buy for his brother?"
              }
            }
          ]
        },
        {
          "text": "W: What can I do for you?\nM: I'd like to exchange this sweater.\nW: What seems to be the matter?\nM: Well, you see I got this as a birthday present, but it's the wrong size, and what's more, I really don't like the colour.\nW: Do you have the receipt?\nM: Yes.\nW: Can I have a look at it, please?\nM: Certainly\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In a friend's house.",
                "In a shop.",
                "At a party."
              ],
              "correctAnswer": "In a shop.",
              "variables": {
                "a": "Where does the conversation probably take place?"
              }
            },
            {
              "answerOptions": [
                "It doesn't fit him and the color isn't satisfactory.",
                "It is a birthday present from his friend.",
                "He has got the receipt."
              ],
              "correctAnswer": "It doesn't fit him and the color isn't satisfactory.",
              "variables": {
                "a": "Why does the man want to exchange the sweater?"
              }
            }
          ]
        },
        {
          "text": "M: We're having a picnic tomorrow. Why don't you come with us?\nW: I'd like to, but I think it's going to rain. The weatherman says so.\nM: I don't think he is right. It hasn't rained for a week and it isn't cloudy, either.\nW: But he is usually correct in his weather news.\nM: The temperature is 32t this afternoon. I'm sure we'll have fine weather for our picnic.\nW: Well, I'll go, but I'll take my umbrella with me.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Rainy.",
                "Cloudy.",
                "Sunny."
              ],
              "correctAnswer": "Sunny.",
              "variables": {
                "a": "What does the man think the weather is going to be like tomorrow?"
              }
            },
            {
              "answerOptions": [
                "Go to the picnic with an umbrella.",
                "Stay home because of the rain.",
                "Make sure of the weather."
              ],
              "correctAnswer": "Go to the picnic with an umbrella.",
              "variables": {
                "a": "What will the woman probably do tomorrow?"
              }
            }
          ]
        },
        {
          "text": "M: Sally, do you like seafood?\nW: Yes, of course.\nM: Is there anything you especially like?\nW: Well, I really don't know. I can never remember the names.\nM: Okay. Is there any food you don't eat?\nW: Well, I don't eat chicken. And I don't like eggs, either. But I like all kinds of fish and vegetables.\nM: Then let's look at the menu and see what they've got for us.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Chicken.",
                "Fish.",
                "Eggs."
              ],
              "correctAnswer": "Fish.",
              "variables": {
                "a": "What food does Sally like?"
              }
            },
            {
              "answerOptions": [
                "Cook dinner.",
                "Go shopping.",
                "Order dishes."
              ],
              "correctAnswer": "Order dishes.",
              "variables": {
                "a": "What are the speakers going to do?"
              }
            }
          ]
        },
        {
          "text": "Woman: How did you like the dishes, Sir?\nMan: Delicious. Everything was excellent here. Thank you!\nWoman: Do you want some coffee, tea, sir?\nMan: No. thanks, I'm fine. Ah, just have the bill, please. How much is your service charge?\nWoman: Fifteen percent and it's included in your bill. Thank you very much, sir. We look forward to seeing you again.\nMan: Sure, good night.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Just so-so.",
                "Quite satisfactory.",
                "A bit disappointing."
              ],
              "correctAnswer": "Quite satisfactory.",
              "variables": {
                "a": "What did the man think of the meal?"
              }
            },
            {
              "answerOptions": [
                "The food.",
                "The drinks.",
                "The service."
              ],
              "correctAnswer": "The service.",
              "variables": {
                "a": "What was the 15% on the bill paid for?"
              }
            }
          ]
        },
        {
          "text": "M: So tell me a little more about yourself, Sharon.\nW: Well, when I graduated from drama school, I tried to get a job as an actress in Hollywood.\nM: Really?\nW: Yeah, but I didn't get any parts. Two years later, I finally got a job with Universal Studios.\nM: So you finally got to be an actress?\nW: No, I'm a tour guide at the studio!But while I'm on the job, I get to see a lot of stars!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "An actress.",
                "A guide.",
                "A film star."
              ],
              "correctAnswer": "A guide.",
              "variables": {
                "a": "What is Sharon now?"
              }
            },
            {
              "answerOptions": [
                "She is working at Universal Studios.",
                "She's tired of her job.",
                "She's disappointed at her job."
              ],
              "correctAnswer": "She is working at Universal Studios.",
              "variables": {
                "a": "Which of the following is TRUE?"
              }
            }
          ]
        },
        {
          "text": "M: Can I help you, Miss?\nW: No, thanks, I'm just looking. How much is that necklace?\nM: 2,999 dollars.\nW: Too expensive! My sister's birthday is tomorrow. I'm thinking what I should buy for her.\nM: You'll find that the prices of our goods are quite reasonable.\nW: Well, that's certainly nice to know. I'll take it.\nM: It's a good choice. I'm sure she'll love it. Cash or card, Miss?\nW: I hope so. Card, please.\nM: That comes to 3,199 dollars with tax. Please sign here.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In a store.",
                "In a factory.",
                "In a museum."
              ],
              "correctAnswer": "In a store.",
              "variables": {
                "a": "Where does the conversation take place?"
              }
            },
            {
              "answerOptions": [
                "2,199.",
                "2,999.",
                "3,199."
              ],
              "correctAnswer": "3,199.",
              "variables": {
                "a": "How much did the woman pay for the necklace finally?"
              }
            }
          ]
        },
        {
          "text": "W: It's ten o'clock. I'm going to have to be leaving.\nM: Leaving? Already?\nW: Yes. I've got to get up early tomorrow.\nM: Ok. Stop over again sometime.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "10:00.",
                "11:00.",
                "9:00."
              ],
              "correctAnswer": "10:00.",
              "variables": {
                "a": "What time was it?"
              }
            },
            {
              "answerOptions": [
                "Because he had to go home.",
                "Because he had to get up early.",
                "Because he was tire"
              ],
              "correctAnswer": "Because he had to get up early.",
              "variables": {
                "a": "Why did the man have to be leaving?"
              }
            }
          ]
        }
      ]
    }
  ]
}