{
  "courseId": "3a59eb13-0b5d-4d59-b1c8-9cba61cec59c",
  "title": "Everyday English Course 28",
  "description": "Improve your English comprehension skills through short everyday conversations and situational dialogues.",
  "imageUrl": "/public/images/courses/end46c00-6746-4c45-a867-a8f08666a5c6.png",
  "totalSections": 3,
  "sections": [
    {
      "title": "Section 1: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "M: Hello, Jean!\nW: Mike Carstairs! My favorite customer. You haven't been in for ages.\nM: No, I haven't. That's right.\nW: How are you?\nM: I'm fine. I heard you weren't well.\nW: Well, I was away for a couple of weeks. But I'm fine now. Ah! You were going to the States, weren't you?\nM: I planned to go there, but I didn't.\nW: Oh, didn't you?\nM: What I have been doing is reorganizing the whole department non-stop since I saw you. And this is the first time I've been in here since Christmas.\nW: Well, it's good to see you. Are you ready to order?\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She is a waitress.",
                "She is a teacher.",
                "She is a secretary."
              ],
              "correctAnswer": "She is a waitress.",
              "variables": {
                "a": "What does the woman do?"
              }
            },
            {
              "answerOptions": [
                "He has been ill.",
                "He has been busy.",
                "He has been away."
              ],
              "correctAnswer": "He has been busy.",
              "variables": {
                "a": "Why haven't they seen each other lately?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, Mike! How are you feeling now?\nM: How did you know I was here? Is it Tom?\nW: I was talking with Bob yesterday and I learnt your right leg had been injured. How did it happen?\nM: Their right back Tom knocked me down when I rushed to their goal with the ball.\nW: Wow! He must have hit you hard.\nM: Of course. He hit me from the back and sent me rolling over and over. At the time I had a lot of pain. Anyway, they brought me here.\nW: Nothing serious, I hope.\nM: The doctor said there weren't any internal injuries, but that I'd better stay here a couple of days.\nW: Well, Mike. Take it easy.\nM: Thank you for your coming. And thanks for the flowers.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In a hospital.",
                "In a playground.",
                "In the man's home."
              ],
              "correctAnswer": "In a hospital.",
              "variables": {
                "a": "Where does the conversation take place?"
              }
            },
            {
              "answerOptions": [
                "He was knocked down in the street.",
                "He got injured in a football match.",
                "He was on the same team as Tom."
              ],
              "correctAnswer": "He got injured in a football match.",
              "variables": {
                "a": "What do we know about the man?"
              }
            }
          ]
        },
        {
          "text": "M: Hello, Amy. Are you coming to my birthday party?\nW: Yes, I am. How do I get to your house from the station?\nM: Well, call me when you get to the station and I'll come and pick you up in my car.\nW: Are you sure it won't be too much trouble?\nM: It's no trouble at all. It only takes about 15 minutes.\nW: Oh, I want to check your phone number. Is it 828816887?\nM: No. It's 81881688.\nW: Oh, really? I'm glad I checked.\nM: What time do you plan to arrive at the station?\nW: I plan to get there around 8:30.\nM: OK. See you then.\nW: See you. Goodbye.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She will be picked up at the station.",
                "She will be picked up at her own house.",
                "She will take a train there."
              ],
              "correctAnswer": "She will be picked up at the station.",
              "variables": {
                "a": "How can the woman get to the man's house?"
              }
            },
            {
              "answerOptions": [
                "Around 6 p.m.",
                "Around 8:30 p. m.",
                "Around 8:30 a.m."
              ],
              "correctAnswer": "Around 8:30 p. m.",
              "variables": {
                "a": "When does the woman plan to get to the station?"
              }
            }
          ]
        },
        {
          "text": "M: What kind of dress are you looking for?\nW: Since it's getting warmer at this time of year, I want something light. What materials do you have?\nM: A cotton dress is suitable in spring. We have many kinds. What color would you like? I think yellow or green would be good colors for you.\nW: I'm afraid I want a white dress.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Husband and wife.",
                "Salesman and customer.",
                "Teacher and student."
              ],
              "correctAnswer": "Salesman and customer.",
              "variables": {
                "a": "What's the probable relationship between the two speakers?"
              }
            },
            {
              "answerOptions": [
                "White.",
                "Yellow.",
                "Green."
              ],
              "correctAnswer": "White.",
              "variables": {
                "a": "What color will the woman choose?"
              }
            }
          ]
        },
        {
          "text": "M: Hi, Ann. I hear you've started evening discussions on popular music. How is it going?\nW: Pretty well. I must say I've learned a lot. But it would be nicer to have someone who knows more about the subject. Could you possibly join us?\nM: Certainly. When do you usually meet?\nW: We meet twice a week-Tuesday and Saturday. Is the time convenient for you?\nM: Tuesday is OK. But I don't think I can come on Saturday.\nW: What about Friday evenings? We hope to see you present.\nM: OK. I'm free on Friday evenings.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Because he is free most of the time.",
                "Because he is easy to get along with.",
                "Because he knows a lot about pop music."
              ],
              "correctAnswer": "Because he knows a lot about pop music.",
              "variables": {
                "a": "Why does the woman invite the man to attend the discussion?"
              }
            },
            {
              "answerOptions": [
                "On Tuesdays and Saturdays.",
                "On Tuesdays and Fridays.",
                "On Fridays and Saturdays."
              ],
              "correctAnswer": "On Tuesdays and Fridays.",
              "variables": {
                "a": "When will the man come to the discussion?"
              }
            }
          ]
        },
        {
          "text": "W: What shall we do this weekend?\nM: Let's go for a swim.\nW: Where shall we go for it?\nM: Let's go to the Workers' stadium. We haven't been there for a long time.\nW: That's a good idea. We can meet at the school gate at eleven o'clock. Is that all right for you?\nM: Yes. That'll be perfect, See you tomorrow. Goodbye.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Watch a swimming race.",
                "Go swimming.",
                "Go skating."
              ],
              "correctAnswer": "Go swimming.",
              "variables": {
                "a": "What are they going to do?"
              }
            },
            {
              "answerOptions": [
                "At seven o'clock.",
                "At eleven o'clock.",
                "At two o'clock."
              ],
              "correctAnswer": "At eleven o'clock.",
              "variables": {
                "a": "When are they going to meet?"
              }
            }
          ]
        },
        {
          "text": "W: Packages Express. May I help you?\nM: Yes. Hi. I sent a package last Thursday, and I'd like to track my order.\nW: No problem. I can check the shipment on the computer for you. This Monday's order... Let me see. Ah, it's here, last Thursday. Do you have your order number?\nM: Sure. It's 6-0-1-4-2-8.\nW: OK. And the last name on that order?\nM: It's Conley. That's C-O-N-L-E-Y.\nW: And where did you send the package to?\nM: San Francisco.\nW: Mm-hmm. And the postal code there is 9-5-1-2-6. Yes, it looks like the pack arrived safely on Tuesday morning. Your friend can get the package at the counter numbered 4-2-3-6.\nM: That's great. Thank you very much for your help.\nW: You're welcome.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Last Thursday.",
                "This Monday.",
                "Tuesday morning."
              ],
              "correctAnswer": "Last Thursday.",
              "variables": {
                "a": "When did the man send the package?"
              }
            },
            {
              "answerOptions": [
                "At Counter 601428.",
                "At Counter 95126.",
                "At Counter 4236."
              ],
              "correctAnswer": "At Counter 4236.",
              "variables": {
                "a": "Where can the man's friend get the package?"
              }
            }
          ]
        },
        {
          "text": "M: Marissa, if your papers continue to be late, I will have to give you a failing grade for the course.\nW: I'm sorry! I've been having a really hard semester.\nM: You need to try a little harder, okay?\nW: I know, I will. There's just been a lot going on lately. I'm moving out of my house, and my brother is in the hospital.\nM: I'm sorry to hear that, but this is the 7th paper you've turned in late.\nW: I promise I'll get the next one in on time. Just please don't fail me.\nM: I'll give you one more chance, but just one. Don't let me down.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Teacher and student.",
                "Parent and child.",
                "Boss and employee."
              ],
              "correctAnswer": "Teacher and student.",
              "variables": {
                "a": "What is the probable relationship between the speakers?"
              }
            },
            {
              "answerOptions": [
                "Annoyed.",
                "Let down.",
                "Sorry."
              ],
              "correctAnswer": "Sorry.",
              "variables": {
                "a": "How does the woman most likely feel?"
              }
            }
          ]
        },
        {
          "text": "M: Would you like something to drink, Mum?\nW: Yes, give me some coffee, please. No milk, no sugar.\nM: Certainly.\nW: My friend is coming in a minute, and he loves sweet juice. What kind of juice do you recommend?\nM: We have apple juice and strawberry juice. They're both sweet. But recommend strawberry juice. It's upon ordinary. And the apple juice was made yesterday, and stored in the refrigerator.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Milk.",
                "Juice.",
                "Coffee."
              ],
              "correctAnswer": "Milk.",
              "variables": {
                "a": "What has the woman ordered for herself?"
              }
            },
            {
              "answerOptions": [
                "It's sweeter.",
                "It's fresher.",
                "It's colder."
              ],
              "correctAnswer": "It's fresher.",
              "variables": {
                "a": "Why does the man recommend strawberry juice?"
              }
            }
          ]
        },
        {
          "text": "M: Is that Ann?\nW: Yes.\nM: This is Mike. How are things with you?\nW: Oh, very well, but I'm very busy.\nM: Busy? But you've finished all your exams?\nW: Yes, but I have to help my little sister with her foreign language.\nM: How about coming out with me this evening? There's a new film on.\nW: I'm afraid I can't. A friend of mine is coming from the south and I have to go to the station to meet him.\nM: What a pity! How about the weekend then?\nW: No, I've arranged to go to an art exhibition with my parents.\nM: What about next week sometime?\nW: Maybe.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In the street.",
                "At the woman's home.",
                "Over the phone."
              ],
              "correctAnswer": "Over the phone.",
              "variables": {
                "a": "Where does this conversation most likely take place?"
              }
            },
            {
              "answerOptions": [
                "Help her sister with English.",
                "Meet her friend at the station.",
                "Go to an exhibition with her parents."
              ],
              "correctAnswer": "Meet her friend at the station.",
              "variables": {
                "a": "What is the woman going to do tonight?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 2: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "W: There are so many people in your house. What are they doing?\nM: We are having a party. I am the host and my wife is the hostess.\nW: Are they your guests?\nM: Yes, they are. They are all my friends.\nW: Who is that man?\nM: He is Professor Zhang. He is a Chinese teacher. His wife is a teacher, too. Their daughter is a college student.\nW: Who is that young man?\nM: He is her boyfriend. He is a young doctor. His name is Karl Black.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "They're having dinner.",
                "They're having a party.",
                "They're watching TV."
              ],
              "correctAnswer": "They're having a party.",
              "variables": {
                "a": "What are the people in the house doing?"
              }
            },
            {
              "answerOptions": [
                "He is the man's daughter's boyfriend.",
                "He is the woman's daughter's boyfriend.",
                "He is Miss Zhang's boyfriend."
              ],
              "correctAnswer": "He is Miss Zhang's boyfriend.",
              "variables": {
                "a": "Who is Karl Black?"
              }
            }
          ]
        },
        {
          "text": "W: Let's get started. Where were we last class?\nM: We learned the dialogue on Page 40.\nW: Have you all memorized it?\nM: Yes, we have.\nW: All right. Now, go on to Unit 5. Listen carefully to the tape,and then finish the questions.\nM: Do we have to do them?\nW: I'm afraid you have to.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She is a hostess.",
                "She is a student.",
                "She is a teacher."
              ],
              "correctAnswer": "She is a teacher.",
              "variables": {
                "a": "What does the woman do?"
              }
            },
            {
              "answerOptions": [
                "Listen to the tape.",
                "Memorize the dialogue.",
                "Finish the questions."
              ],
              "correctAnswer": "Listen to the tape.",
              "variables": {
                "a": "What will the man do next?"
              }
            }
          ]
        },
        {
          "text": "W: Hello, glad to see you. Come in, please.\nM: Thanks. It looks like the party is exciting and all are in high spirits.\nW: My brother, Tom is visiting me for the weekend.\nM: Where is he?\nW: He is sitting in the corner over there, and beside the yound woman.\nM: And who is the yound woman? Uh, the woman wearing a red coat.\nW: Oh, that's Ann, my piano teacher.\nM: Piano teacher! I never knew you were practicing the piano.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Her brother.",
                "Her student.",
                "Her teacher."
              ],
              "correctAnswer": "Her brother.",
              "variables": {
                "a": "Who is visiting the woman for the weekend?"
              }
            },
            {
              "answerOptions": [
                "She has just been introduced to her.",
                "She has taken piano lessons from her.",
                "They have met at a party before."
              ],
              "correctAnswer": "She has taken piano lessons from her.",
              "variables": {
                "a": "How does the woman know Ann?"
              }
            }
          ]
        },
        {
          "text": "W: Good afternoon! Dr. Perkins' office.\nM: Good afternoon. I'd like to speak to the doctor. Is he in?\nW: Who is that calling, please?\nM: My name is Li Hong. I'm from China.\nW: I'm sorry. Dr. Perkins is now at an important meeting and can't answer your call.\nM: I'm an exchange scholar. Dr. Perkins asked me to give a lecture. There are some details I want to discuss with him.\nW: I see, but you must speak to himself about that. Oh, well, if you leave your number, I'll tell him to ring you as soon as he is available.\nM: Thanks. My number is 7838298.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "To discuss something with the doctor.",
                "To ask Dr. Perkins to give a lecture.",
                "To see him about his illness."
              ],
              "correctAnswer": "To discuss something with the doctor.",
              "variables": {
                "a": "Why does the man want to talk to Dr. Perkins on the phone?"
              }
            },
            {
              "answerOptions": [
                "Giving an operation.",
                "Giving a lecture.",
                "Having a meeting."
              ],
              "correctAnswer": "Having a meeting.",
              "variables": {
                "a": "What is the doctor doing at the moment?"
              }
            }
          ]
        },
        {
          "text": "M: The manager just emailed to say that the meeting would be put off till the next Sunday. Will you have everything ready by then? Anna, what's wrong? Are you hearing me?\nW: Sorry, I was thinking about my brother. I haven't heard from him for two weeks.\nM: How often do you call each other?\nW: Usually at least once a week, but he's now a volunteer teacher at a mountain village. I can only write to him.\nM: The mail can be really slow sometimes. I'm sure you'll hear from him soon.\nW: I hope so.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Neighbors.",
                "Colleagues.",
                "A couple."
              ],
              "correctAnswer": "Colleagues.",
              "variables": {
                "a": "What is the probable relationship between the speakers?"
              }
            },
            {
              "answerOptions": [
                "By phone.",
                "By email.",
                "By letter."
              ],
              "correctAnswer": "By letter.",
              "variables": {
                "a": "How can Anna reach her brother now?"
              }
            }
          ]
        },
        {
          "text": "M: Helen, can I have a look at your newspaper?\nW: Sure, go ahead.\nM: I want to know what's on this weekend.\nW: Is there anything interesting?\nM: The Fools Garden is giving a performance today.\nW: They are a pop group. They are said to be very good. What time does the performance start?\nM: 7 P.m., will you be free then?\nW: Yes, I'd like to go.\nM: Let's go together then.\nW: All right.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Classical group.",
                "Pop group.",
                "Jazz group."
              ],
              "correctAnswer": "Pop group.",
              "variables": {
                "a": "What does the Fools Garden refer to?"
              }
            },
            {
              "answerOptions": [
                "The man will go alone.",
                "The woman will go alone.",
                "They will go together."
              ],
              "correctAnswer": "They will go together.",
              "variables": {
                "a": "What have the two speakers decided to do?"
              }
            }
          ]
        },
        {
          "text": "M: Hello, Mary.\nW: Hello, Jason. What are you going to do this evening?\nM: I've no idea. What about you?\nW: I have two tickets for the football match. Will you go with me?\nM: Certainly. You know I haven't watched a football match for a long time.\nW: Neither have I Shall we go there by bus?\nM: All right. After supper let's meet at the street corner. OK?\nW: OK. Let's hurry up. Now it's 6:30. The match will begin in an hour. Be sure not to be late.\nM: Sure, I'll get to the street corner on time.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "To go to see a play.",
                "To go to see a movie.",
                "To go to watch a football match."
              ],
              "correctAnswer": "To go to watch a football match.",
              "variables": {
                "a": "What are they going to do this evening?"
              }
            },
            {
              "answerOptions": [
                "At 6:30.",
                "At 6:45.",
                "At 7:30."
              ],
              "correctAnswer": "At 7:30.",
              "variables": {
                "a": "When will the football match begin?"
              }
            }
          ]
        },
        {
          "text": "Man: I'm not sure if I can find work this summer. There aren't many jobs out there for inexperienced workers, and I can't just sit around all day.\nWoman: Have you ever heard about house-sitting? Tom is going to house sit for Mary's family this summer when they travel to China.\nMan: What exactly is house-sitting?\nWoman: It's kind of like baby-sitting except that you're watching a house instead of kids.\nMan: It sounds too good to be true. But I guess it won't be that simple. Anyhow, I'd like to have a try.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Sitting around all day.",
                "Taking care of the house while the owner is away.",
                "Watching a family's kids in their house."
              ],
              "correctAnswer": "Taking care of the house while the owner is away.",
              "variables": {
                "a": "What is house-sitting?"
              }
            },
            {
              "answerOptions": [
                "He will attend summer school.",
                "He plans to house sit.",
                "He plans to baby sit."
              ],
              "correctAnswer": "He plans to house sit.",
              "variables": {
                "a": "What's the man's plan for this summer?"
              }
            }
          ]
        },
        {
          "text": "W: Happy birthday, Jimmy. Are you ready for the next present?\nM: You mean there's more besides the watch?\nW: Come with us. It's in the car. Now, here we are. You've been talking about this for months.\nM: Oh, it's a new computer. It's just what I want. I'm so happy about it. Thank you so much, Mum and Dad.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A car.",
                "A watch.",
                "A computer."
              ],
              "correctAnswer": "A computer.",
              "variables": {
                "a": "What is the second gift for Jimmy?"
              }
            },
            {
              "answerOptions": [
                "He lives with his parents.",
                "He's got what he dreamt of.",
                "He's received lots of presents."
              ],
              "correctAnswer": "He's got what he dreamt of.",
              "variables": {
                "a": "Why does Jimmy feel happy?"
              }
            }
          ]
        },
        {
          "text": "M: I've been thinking about joining a health club myself. My doctor has been encouraging me to get more exercise. Which club do you belong to?\nW: It's called the Good-life Health Club. I've only been going since Jan., but I've already noticed a big improvement. I feel like a new person.\nM: Really? What do you do there?\nW: They have a gym with exercise equipment and an indoor pool. I usually start by working out for about half an hour. Then I take a swim. After exercising, the water feels great.\nM: That sounds good. But aren't you afraid of over-working yourself?\nW: No, no. Everything is carefully controlled and supervised. If you're interested in seeing for yourself, I'm going again on Tuesday. Why don't you come along as my guest? You'll enjoy yourself.\nM: That's a good idea. Thanks. I just might.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Take more exercise.",
                "Have some rest.",
                "Join a club."
              ],
              "correctAnswer": "Take more exercise.",
              "variables": {
                "a": "What did the doctor suggest the man do?"
              }
            },
            {
              "answerOptions": [
                "Work out for a while first.",
                "Take a swim before exercising.",
                "Visit the club and see for himself."
              ],
              "correctAnswer": "Visit the club and see for himself.",
              "variables": {
                "a": "What will the man probably do?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 3: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "W: Waiter, can you come here for a second please?\nM: What's the problem, ma'am?\nW: This soup is cold.\nM: I'm sorry. I'll bring you some hot soup.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Because she wants to eat food.",
                "Because the soup is cold.",
                "Because she'll pay the bill."
              ],
              "correctAnswer": "Because the soup is cold.",
              "variables": {
                "a": "Why does the woman ask the waiter to come?"
              }
            },
            {
              "answerOptions": [
                "Sister-brother.",
                "Husband-wife.",
                "Customer-waiter."
              ],
              "correctAnswer": "Customer-waiter.",
              "variables": {
                "a": "What's the relationship between the two speakers?"
              }
            }
          ]
        },
        {
          "text": "M: Did you finish typing that report?\nW: Yes, I did, but I worked late.\nM: But it must be a long report, I guess.\nW: Exactly. Twelve pages. I spent three hours on it.\nM: By the way, what time did you go home?\nW: I left the office at nine o'clock. I got home at ten.\nM: What did have for dinner?\nW: I sent out for a sandwich and ate at my desk.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Typing a report.",
                "Rewriting a report.",
                "Reviewing a report."
              ],
              "correctAnswer": "Typing a report.",
              "variables": {
                "a": "What was the woman doing before she went home?"
              }
            },
            {
              "answerOptions": [
                "In a restaurant.",
                "In her office.",
                "At home."
              ],
              "correctAnswer": "In her office.",
              "variables": {
                "a": "Where did the woman have her dinner?"
              }
            }
          ]
        },
        {
          "text": "W: Did you get the injury playing football, Jim?\nM: Yes. One of the boys kicked my foot instead of the ball.\nW: The best thing for you to do is to rest your leg for 48 hours.\nM: When can I go back to school?\nW: You can go back in 4 days, but you'll need to avoid sports for a month.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He was kicked by a boy.",
                "He was hit by a football.",
                "He fell down on the ground."
              ],
              "correctAnswer": "He was kicked by a boy.",
              "variables": {
                "a": "How did Jim get hue?"
              }
            },
            {
              "answerOptions": [
                "In 48 hours.",
                "In 4 days.",
                "In a month."
              ],
              "correctAnswer": "In a month.",
              "variables": {
                "a": "When can Jim play sports again?"
              }
            }
          ]
        },
        {
          "text": "M: It's Julia's birthday tomorrow.\nW: Are you sure? I think it should be the day after tomorrow.\nM: Well, let me see. Oh, I'm sorry. You're fight. It is the day after tomorrow. Shall we buy her a gift?\nW: Yes, of course. Shall we get her a new pen?\nM: That sounds good. But I think it's better to buy her a box of chocolates.\nW: Julia doesn't like sweet things. Didn't you know that?\nM: You're right. Er... I know. We can give her a record, for she loves music very much.\nW: That's great. Let's go to the music shop now.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "The next day.",
                "The day after next.",
                "The day they had the talk."
              ],
              "correctAnswer": "The day after next.",
              "variables": {
                "a": "When is Julia's birthday?"
              }
            },
            {
              "answerOptions": [
                "A record.",
                "A new pen.",
                "A box of chocolates."
              ],
              "correctAnswer": "A record.",
              "variables": {
                "a": "What will the man and the woman buy for Julia?"
              }
            }
          ]
        },
        {
          "text": "W: Hello. Is that reception?\nM: Yes, madam.\nW: This is Mrs. Bates, Room 504. I sent some clothes to the laundry this morning. But they are not back yet. You see, we are leaving early tomorrow morning.\nM: Just a moment, madam. I'll put you through to the housekeeper.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "The laundry lady.",
                "The receptionist.",
                "The operator."
              ],
              "correctAnswer": "The receptionist.",
              "variables": {
                "a": "Who was Mrs. Bates calling?"
              }
            },
            {
              "answerOptions": [
                "To stay at the hotel.",
                "To leave the hotel.",
                "To return home."
              ],
              "correctAnswer": "To leave the hotel.",
              "variables": {
                "a": "What were Mrs. Bates and her husband going to do the next morning?"
              }
            }
          ]
        },
        {
          "text": "W: Excuse me, sir, could you tell me how I can get to the railway station?\nM: Sorry, I don't understand. I can speak little English.\nW: Do you speak German?\nM: No, I don't.\nW: What is your first language, French or Spanish?\nM: Spanish is my mother language. I am not good at speaking English.\nW: But I think your English is very good.\nM: I don't think so. I only can speak some simple words and expressions.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "The bus station.",
                "The railway station.",
                "Germany."
              ],
              "correctAnswer": "The railway station.",
              "variables": {
                "a": "Where will the woman go?"
              }
            },
            {
              "answerOptions": [
                "English.",
                "Spanish.",
                "French."
              ],
              "correctAnswer": "Spanish.",
              "variables": {
                "a": "What language is the man's mother language?"
              }
            }
          ]
        },
        {
          "text": "M: Why you don't like going to the cinema?\nW: Well, there are too many problems. For example, when a film is popular, the cinema is rather crowded.\nM: Is that all?\nW: No, the worst is the people - children running up and down, people chatting endlessly, and so on. So, I'd rather stay home and wait to see the films when they are shown on TV.\nM: Then you may see the films a bit later than other people.\nW: Yes, but I'll be more comfortable in the quietness of my living room.\nM: Well, I prefer seeing films at the cinema as soon as they come out.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "New films.",
                "Popular cinemas.",
                "Film-seeing habits."
              ],
              "correctAnswer": "Film-seeing habits.",
              "variables": {
                "a": "What are the speakers talking about?"
              }
            },
            {
              "answerOptions": [
                "Noisy surroundings.",
                "Long waiting time.",
                "Uncomfortable seats."
              ],
              "correctAnswer": "Noisy surroundings.",
              "variables": {
                "a": "What seems to bother the woman at the cinema?"
              }
            }
          ]
        },
        {
          "text": "M: Is this blue too bright for me?\nW: Mmm-hmm. It is a very bright blue. Try this. It's size ten.\nM: But 1 wear size eleven.\nW: How about black? It's size eleven.\nM: Let me try it on. I'm taking too much of your time.\nW: It's seven o'clock. Where's my friend Jack? I was expecting him here at six forty-five.\nM: Don't worry. The traffic is very heavy at this hour.\nW: I know. But we're going to be late for tonight's party.\nM: I'll take this black sweater. I like the color on me. How do you think?\nW: I think it looks terrific on you.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A blue sweater in size ten.",
                "A black sweater in size eleven.",
                "A black sweater in size ten."
              ],
              "correctAnswer": "A black sweater in size eleven.",
              "variables": {
                "a": "What is the man's final choice for the sweater?"
              }
            },
            {
              "answerOptions": [
                "She is going to meet her friend.",
                "She is going to expecting her friend.",
                "She is going to take part in a party with her friend."
              ],
              "correctAnswer": "She is going to take part in a party with her friend.",
              "variables": {
                "a": "What is the woman going to do that night?"
              }
            }
          ]
        },
        {
          "text": "M: Are you free on the weekend?\nW: I haven't got any plans yet, why?\nM: There is an exhibition of Chinese paintings at the public library. Would you like to go with me?\nW: I'd love to, but when?\nM: How about Saturday morning? It's cooler in the morning and maybe less crowded.\nW: I'm afraid I can not get up early on weekends. I'd prefer Saturday afternoon. Believe me there won't be too many people.\nM: So, shall we meet at 2:00, Saturday afternoon?\nW: OK, that would be great. I'll be waiting for you at my home.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A library.",
                "A museum.",
                "The woman's home."
              ],
              "correctAnswer": "A library.",
              "variables": {
                "a": "Where do the speakers plan to go?"
              }
            },
            {
              "answerOptions": [
                "To avoid the crowd.",
                "To enjoy nice weather.",
                "To sleep late in the morning."
              ],
              "correctAnswer": "To sleep late in the morning.",
              "variables": {
                "a": "Why does the woman want to go on Saturday afternoon?"
              }
            }
          ]
        },
        {
          "text": "W: The movie Fang Hua is a hit, have you ever seen it? It was on since last Friday.\nM: Yes, I went last Sunday. How about you?\nW: I saw it on the first day. Not bad, is it?\nM: Mm, it made me want to read the novel again.\nW: Yeah, it really brought the world of the novel to me.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Last Friday.",
                "Last Saturday.",
                "Last Sunday."
              ],
              "correctAnswer": "Last Friday.",
              "variables": {
                "a": "When did the woman see the movie Fang Hua?"
              }
            },
            {
              "answerOptions": [
                "It was very bad.",
                "It was true to the novel.",
                "It made her think of the world."
              ],
              "correctAnswer": "It was true to the novel.",
              "variables": {
                "a": "What is the woman's opinion about the film?"
              }
            }
          ]
        }
      ]
    }
  ]
}