{
  "courseId": "59b4e4fc-53aa-4e82-8178-c35f41f0a9e9",
  "title": "Everyday English Course 27",
  "description": "Improve your English comprehension skills through short everyday conversations and situational dialogues.",
  "imageUrl": "/public/images/courses/end46c00-6746-4c45-a867-a8f08666a5c6.png",
  "totalSections": 3,
  "sections": [
    {
      "title": "Section 1: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "W: Why do we have to walk to the station? And where is it?\nM: It's just down that road...I think.\nW: Look! There's a policeman! Ask him the way.\nM: All right. I'll go and ask him.\nW: (pause for 6 seconds) So,what did he say?\nM: Well, we have to walk down this road, take the first turning on the left. Then walk until we come to the river and...\nW: The river?\nM: Yes. It's over there, and there's a bridge. Across the bridge, we will be able to see some road signs which will tell us the way.\nW: But how far is it? How long does it take to walk there?\nM: About fifteen minutes, if we walk quickly.\nW: Fifteen minutes! We may be late for the train. And with these heavy bags, too! I think we ought to take a taxi.\nM: Not at this hour. Look at the traffic. It's moving very slowly. We can get there just as quickly on foot.\nW: Well, I can't possibly carry this bag any farther.\nM: All right. Let me take it, then.\nW: Don't be silly. You can't carry two bags at the same time.\nM: Yes, I can. The bags aren't that heavy...hmm!\nW: You see! They're heavier than you thought!\nM: Perhaps it's not such a bad idea after all.\nW: What isn't such a bad idea? What do you mean?\nM: Taxi! Taxi!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "To the bus station.",
                "To the police station.",
                "To the railway station."
              ],
              "correctAnswer": "To the railway station.",
              "variables": {
                "a": "Where are the man and the woman going?"
              }
            },
            {
              "answerOptions": [
                "Take a taxi.",
                "Walk slowly.",
                "Leave the bags with the police."
              ],
              "correctAnswer": "Take a taxi.",
              "variables": {
                "a": "What does the woman think they should do?"
              }
            },
            {
              "answerOptions": [
                "Fifteen minutes is too long.",
                "The traffic is moving too slowly.",
                "He is not able to carry two bags."
              ],
              "correctAnswer": "He is not able to carry two bags.",
              "variables": {
                "a": "What does the man find out at last?"
              }
            }
          ]
        },
        {
          "text": "W: Hello, Tom. I haven't seen you for some time. How are you doing?\nM: Oh! Not too bad. I have been busy writing an article.\nW: Really? Have you finished it?\nM: Yes. I finished it yesterday.\nW: Congratulations! Are you doing something this evening?\nM: No, nothing important. Why?\nW: Well, do you feel like going to a concert? I have two tickets.\nM: Oh. Good idea. I want to do something relaxing, and I like music very much.\nW: Great. I'll meet you at your house at seven. Is that OK?\nM: OK! See you at seven.\nW: All right. See you then.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Preparing for the final exams.",
                "Preparing a speech.",
                "Writing an article."
              ],
              "correctAnswer": "Writing an article.",
              "variables": {
                "a": "What has the man been doing?"
              }
            },
            {
              "answerOptions": [
                "Take a walk.",
                "Go to a concert.",
                "Go to see a film."
              ],
              "correctAnswer": "Go to a concert.",
              "variables": {
                "a": "What will the man do this evening?"
              }
            },
            {
              "answerOptions": [
                "At 7 o'clock.",
                "At 6 o'clock.",
                "At 5 o'clock."
              ],
              "correctAnswer": "At 7 o'clock.",
              "variables": {
                "a": "When will the woman meet the man?"
              }
            }
          ]
        },
        {
          "text": "W: The Spring Festival is coming. Danny. How do you want to celebrate it?\nM: I don't know. We have no Spring Festival in our country.\nW: But the Spring Festival is the biggest holiday of the year in our country. People are busy shopping and preparing presents for their relatives and friends before the, New Year's Eve.\nM: That sounds exciting.\nW: Children usually put on their new clothes on the first day of the Lunar New Year. And they also can get some money given by the elders as a Lunar New Year gift on the New Year's Eve.\nM: It's really quite interesting.\nW: And all the family members must come back home on the New Year's Eve no matter how far they are away from home. We call it \"get--together\". What are you going to do on the New Year's Eve?\nM: My teacher, Professor Wang and his wife have invited me to have dinner together.\nW: Sounds great.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Chinese New Year's day.",
                "Christmas Day.",
                "The Chinese Spring Festival."
              ],
              "correctAnswer": "The Chinese Spring Festival.",
              "variables": {
                "a": "What are they mainly talking about?"
              }
            },
            {
              "answerOptions": [
                "On the first day of the Lunar New Year.",
                "On the New Year's Eve.",
                "Before the New Year's Eve."
              ],
              "correctAnswer": "On the New Year's Eve.",
              "variables": {
                "a": "When will the children get some money from the elder as a gift for the Lunar New Year according to the text?"
              }
            },
            {
              "answerOptions": [
                "Do some reading.",
                "Write to his parents.",
                "Visit his teacher."
              ],
              "correctAnswer": "Visit his teacher.",
              "variables": {
                "a": "What will Danny do on the New Year's Eve?"
              }
            }
          ]
        },
        {
          "text": "M: The time has come to say goodbye.\nW: So soon. It seems as if you've just got here.\nM: I feel that way, too, but they say all good things must come to an end.\nW: It certainly has been a pleasure seeing you again and renewing old memories.\nM: I've had a nice time and I really want to thank you for spending so much time showing me the sights.\nW: Oh. It was fun for me, too. It gave me the chance to get away from my everyday work and do something a little bit different.\nM: You'll be out to see us next year, then, as you promised?\nW: Oh, yes. That's our present plan unless something bad comes up. We should be there sometime in early September.\nM: We'll be expecting you.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Taking a holiday.",
                "Nothing lasts forever.",
                "Going to work."
              ],
              "correctAnswer": "Nothing lasts forever.",
              "variables": {
                "a": "Why is the man leaving?"
              }
            },
            {
              "answerOptions": [
                "Sightseeing.",
                "Doing business.",
                "Attending a meeting."
              ],
              "correctAnswer": "Sightseeing.",
              "variables": {
                "a": "What have the speakers been doing together?"
              }
            },
            {
              "answerOptions": [
                "Visiting the man.",
                "Changing her job.",
                "Going to a doctor's."
              ],
              "correctAnswer": "Visiting the man.",
              "variables": {
                "a": "What's going to happen to the woman next September?"
              }
            }
          ]
        },
        {
          "text": "W: My colleagues at work say I should get a health insurance. What do you think?\nM: I think it's important. I can give you my insurance agent's card if you want.\nW: But I'm not sure what kind I need. In Germany, we have a national insurance program. But here you have nothing.\nM: Yes, I know. Many countries have national health insurance. America doesn't.\nW: Why is that?\nM: Well, it's because of the American culture. Americans think private companies can do things better than the government. So we depend on private companies for insurance.\nW: But isn't that expensive?\nM: You're right. It is expensive. And many people criticize it. They say it is not fair to poor people. They say the health systems are better in other countries, especially in Europe.\nW: But what do you think?\nM: I have no idea. I just do my best to have good insurance. It's important.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In the USA.",
                "In Europe.",
                "In China."
              ],
              "correctAnswer": "In the USA.",
              "variables": {
                "a": "Where are the two speakers?"
              }
            },
            {
              "answerOptions": [
                "The government hasn't realized its importance.",
                "The people don't think the government can do it better.",
                "The government hasn't paid enough money for it."
              ],
              "correctAnswer": "The people don't think the government can do it better.",
              "variables": {
                "a": "Why is there no national health insurance here?"
              }
            },
            {
              "answerOptions": [
                "Expensive.",
                "Unnecessary.",
                "Important."
              ],
              "correctAnswer": "Important.",
              "variables": {
                "a": "What does the man think of having good insurance?"
              }
            }
          ]
        },
        {
          "text": "M: Hey, Mary! You have really been gone a long time. How did you do that?\nW: Hi! Well, I talked with my teachers before I left about the work I would miss. Besides, my aunt in Denver made me study a lot there.\nM: I thought she was your rich aunt.\nW: Not very. But she didn't have any children to raise, so she does have some money, even though she was a teacher.\nM: How was the holiday?\nW: Cold, at least three of the days I went. And I saw so many people on the mountain on Washington's Birthday.\nM: The beaches here were full on Washington's Birthday, too. It really was warm here, so lots of people went swimming.\nW: Well, we should have stayed home that day. There were so many people. We took the train over to the mountain, so at least we didn't have to drive. It is a good thing we did-there were so many cars and buses, and no place to park anywhere.\nM: Just like the beaches here.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "How Mary went on the holiday.",
                "Why Mary went to Denver.",
                "How Mary was able to miss so much school."
              ],
              "correctAnswer": "How Mary was able to miss so much school.",
              "variables": {
                "a": "What did the boy mean by saying \"Mary, how did you do that\"?"
              }
            },
            {
              "answerOptions": [
                "May be there was a national holiday near that day.",
                "It was fine that day and nobody wanted to stay in.",
                "All the students were on their winter holiday that day."
              ],
              "correctAnswer": "May be there was a national holiday near that day.",
              "variables": {
                "a": "What can we infer about Washington's Birthday from the dialogue?"
              }
            },
            {
              "answerOptions": [
                "She stayed at home.",
                "She went to the mountain by car.",
                "She went to the mountain by train for a holiday."
              ],
              "correctAnswer": "She went to the mountain by train for a holiday.",
              "variables": {
                "a": "What did Mary do on Washington's Birthday?"
              }
            }
          ]
        },
        {
          "text": "M: Two more miles to go...we have an hour before school starts. Let's take our time. Do you want to stop and get a breakfast sandwich?\nW: We decided to start walking to school for the exercise. We want to get fit. Why would we want to eat a fattening breakfast sandwich?\nM: McDonald's has an egg muffin sandwich that has only 320 calories. What's wrong with that? I bet we walked off 320 calories already. After two more miles, we can probably walk off another 100 calories.\nW: I do need energy. I hardly ate dinner last night. My mom made leg of lamb, and it's definitely not my favorite. In fact, I think I'm going to become a vegetarian.\nM: Good for you! I gave up meat a long time ago. Now, almost all of my meals are salads. Funny thing is, when I make my food, I also make food for my rabbit. We mostly eat the same things now.\nW: My bird eats seeds and berries. We could probably share our meals, too!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "It's close to home.",
                "They want to get in shape.",
                "They can stop at McDonald's on the way."
              ],
              "correctAnswer": "They want to get in shape.",
              "variables": {
                "a": "Why are the speakers walking to school?"
              }
            },
            {
              "answerOptions": [
                "25 calories.",
                "320 calories.",
                "100 calories."
              ],
              "correctAnswer": "320 calories.",
              "variables": {
                "a": "How many calories does the breakfast sandwich have?"
              }
            },
            {
              "answerOptions": [
                "Meat.",
                "Salads.",
                "Seeds and berries."
              ],
              "correctAnswer": "Meat.",
              "variables": {
                "a": "What does the woman want to avoid?"
              }
            }
          ]
        },
        {
          "text": "W: What's wrong with you?\nM: Nothing serious.\nW: Maybe you'd better have a medical examination.\nM: I think there is no need. I'm just having a cough and feel tired.\nW: You need to take an X-ray photo of your lungs. I advise you to do as I told you. After all, whatever work you want to do, you must have good health. Don't you think so?\nM: Thank you. But shall I make some calls to arrange some important business affairs first?\nW: OK.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He has a cough.",
                "He has a cold.",
                "He has a headache."
              ],
              "correctAnswer": "He has a cough.",
              "variables": {
                "a": "What is wrong with the man?"
              }
            },
            {
              "answerOptions": [
                "Brother and sister.",
                "Workmates.",
                "Doctor and patient."
              ],
              "correctAnswer": "Workmates.",
              "variables": {
                "a": "What is the relationship between the two speakers?"
              }
            },
            {
              "answerOptions": [
                "Take a medical examination.",
                "Refuse the woman's advice.",
                "Arrange the business affairs."
              ],
              "correctAnswer": "Arrange the business affairs.",
              "variables": {
                "a": "What will the man do next?"
              }
            }
          ]
        },
        {
          "text": "W: Hey, Bob. How long have you been here?\nM: I started swimming this morning at 5:00.\nW: My goodness! That's early! I got here at 6:00. How many lanes have you done?\nM: I swam 50 lanes before 6:00, but I can't remember how many lanes I've done since then.\nW: I have 10 more to do and it'll be done.\nM: I'm almost finished, too. Do you have any classes right after you finish?\nW: No, I don't have to go to class until 11:00. How about you?\nM: No, I don't have to go to class until 10:00. I usually go out for breakfast after I swim. Would you like to join me today?\nW: Sure, that sounds like fun. Let me finish and I'll meet you outside the locker room.\nM: OK, see you then.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In a classroom.",
                "In a pool.",
                "On a baseball field."
              ],
              "correctAnswer": "In a pool.",
              "variables": {
                "a": "Where does this conversation take place?"
              }
            },
            {
              "answerOptions": [
                "6.",
                "10.",
                "50."
              ],
              "correctAnswer": "50.",
              "variables": {
                "a": "How many lanes had the man completed by 6:00?"
              }
            },
            {
              "answerOptions": [
                "To eat breakfast.",
                "To eat dinner.",
                "To go to class."
              ],
              "correctAnswer": "To eat breakfast.",
              "variables": {
                "a": "Where will the speakers probably go after they meet outside the locker room?"
              }
            }
          ]
        },
        {
          "text": "Woman: Can I help you?\nMan: Yes. My daughter bought this camera here for my wife's birthday. But it doesn't work. So I'd like to change it for another one.\nWoman: I see. Let me have a look. Well, we'll be happy to change it for you. But I am afraid we don't have another pink one.\nMan: Oh? What will I do then?\nWoman: Would you like to choose a different color? We do have this camera in black and orange.\nMan: My wife doesn't like either of those colors.\nWoman: If you want, we can order another camera just like this one. There wouldn't be any extra charge for it.\nMan: That sounds fine. Would you please go ahead and do that?\nWoman: We'd be very happy to but it'll take at least a week. Maybe ten days. We'll call you when it comes in.\nMan: Thank you very much.\nWoman: You are welcome.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "To order a camera for his wife.",
                "To have a camera repaired.",
                "To get a camera changed."
              ],
              "correctAnswer": "To get a camera changed.",
              "variables": {
                "a": "Why is the man at the shop?"
              }
            },
            {
              "answerOptions": [
                "Pink.",
                "Black.",
                "Orange."
              ],
              "correctAnswer": "Pink.",
              "variables": {
                "a": "What colour does the man want?"
              }
            },
            {
              "answerOptions": [
                "Make a phone call.",
                "Wait until further notice.",
                "Come again the next day."
              ],
              "correctAnswer": "Wait until further notice.",
              "variables": {
                "a": "What will the man do afterwards?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 2: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "W: Tell me, Jack. Do you look through the Web much?\nM: Well, to tell the truth, I'm so busy with my work. I don't really have much time to surf the Web. Let me think...I suppose I log on a couple of times a week, for about two or three hours at a time.\nW: So, what do you do on the Internet when you log on?\nM: Well, sometimes I look up information I need for my job. It saves a lot of time looking through books in the library.\nW: Yes, it sure does.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "When they surf the Web.",
                "What they do on the Internet.",
                "How they look up information online."
              ],
              "correctAnswer": "What they do on the Internet.",
              "variables": {
                "a": "What are the two speakers mainly talking about?"
              }
            },
            {
              "answerOptions": [
                "Once a week.",
                "Twice a week.",
                "Several times a week."
              ],
              "correctAnswer": "Several times a week.",
              "variables": {
                "a": "How often does the man probably surf the Internet?"
              }
            },
            {
              "answerOptions": [
                "He has never sent e-mail.",
                "He gets some help from the Web.",
                "He shows no interest in the Internet."
              ],
              "correctAnswer": "He gets some help from the Web.",
              "variables": {
                "a": "What do we know about the man?"
              }
            }
          ]
        },
        {
          "text": "Father: Time to eat!\nDaughter: Coming. Oh, I'm starving. [Good, good.] Oh yuck! What's that?\nFather: Ah, now don't complain!\nDaughter: But what is it, and where is mom?\nFather: Now, mom put me in charge of dinner because she's not feeling well tonight.\nDaughter: But what is it ... and that smell!\nFather: It's pizza. I just followed an old family recipe here, and ...\nDaughter: Let me see that ... Oh, Dad. [What?] You're missing a page!\nFather: Oh, uh, well, uh ... well I couldn't find the second page of the recipe, but don't worry. I have plenty of experience around the house. Plenty of experience cooking.\nDaughter: That's not what mom says.\nFather: Well, wait, wait, here let me try a piece first. Here, let me, let me cool this off here. Ohhh, yeah. Oh, this is great stuff.\nDaughter: Yeah right. Why are you making that face?\nFather: Well, well, it's just, just a little rich for me. That's all.\nDaughter: Let me try it Dad. Uh. Dad. You put a little too much salt in it and besides it's burned. [Well ... ] And what's that?\nFather: Oh, well, well, that's just part of my own adaptation to the recipe. I added some pumpkin.\nDaughter: Oh, not another one of your surprises. Pumpkin doesn't go on pizza!\nFather: Well, okay, well, so what? Uh, what do we do now?\nDaughter: Well, how about some cold cereal ... You can't mess up on that, Dad.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She is busy at work.",
                "She had to run some errands.",
                "She is resting in bed."
              ],
              "correctAnswer": "She is resting in bed.",
              "variables": {
                "a": "What does the conversation imply about the mother?"
              }
            },
            {
              "answerOptions": [
                "It was too salty.",
                "It was burned.",
                "It was too chewy."
              ],
              "correctAnswer": "It was too chewy.",
              "variables": {
                "a": "What problem did the girl NOT mention about the pizza?"
              }
            },
            {
              "answerOptions": [
                "They decide to go out to eat.",
                "They eat something different at home.",
                "They eat at friend's house."
              ],
              "correctAnswer": "They eat something different at home.",
              "variables": {
                "a": "What do they end up doing for lunch?"
              }
            }
          ]
        },
        {
          "text": "M: What's the matter, Anne? Do you have a problem?\nW: Yes, I have a chance to get another job and I don't know what to do.\nM: If it's a better job than your present one, take it. That's my advice.\nW: It isn't as easy as that. I like the job I have now very much. The people in my office are very nice and my work is very interesting.\nM: What about the pay? Will you get more money?\nW: Yes, the pay is better. If I accept the job, I'll get more money right away. What should I do? I have to let them know my choice today.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Getting more money.",
                "Doing better in her job.",
                "Changing her job."
              ],
              "correctAnswer": "Changing her job.",
              "variables": {
                "a": "What is the woman thinking about?"
              }
            },
            {
              "answerOptions": [
                "It is difficult.",
                "It is interesting.",
                "It is highly paid."
              ],
              "correctAnswer": "It is interesting.",
              "variables": {
                "a": "How does the woman like her present job?"
              }
            },
            {
              "answerOptions": [
                "Today.",
                "Tomorrow.",
                "The day after tomorrow."
              ],
              "correctAnswer": "Today.",
              "variables": {
                "a": "When does the woman have to decide?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, Ben, we're having a party tonight. Do you want to come and join us? You can bring your girlfriend.\nM: Well, actually, Camilla and I are breaking up.\nW: What happened? Did you have an argument?\nM: No. She is really a very nice girl.\nW: Yeah, she is. She is pretty, caring, and easy-going. And she's a great cook!\nM: Well, you are right. But sometimes she's too caring... well, no... she's just possessive... and... a kind of control, you know... I need some space for myself.\nW: Oh? Did you talk with her about it?\nM: I've tried, but it didn't work.\nW: Oh, so, when are you going to tell her?\nM: Maybe tonight. I don't know. I don't know how to tell her.\nW: I know she is head over heels in love with you. She'll be badly hurt!\nM: I know.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Have an argument.",
                "Tell the girl about the party.",
                "Talk to his girlfriend."
              ],
              "correctAnswer": "Talk to his girlfriend.",
              "variables": {
                "a": "What is Ben going to do?"
              }
            },
            {
              "answerOptions": [
                "Very nice.",
                "Too caring.",
                "Rather possessive."
              ],
              "correctAnswer": "Very nice.",
              "variables": {
                "a": "What's the woman's opinion about Camilla?"
              }
            },
            {
              "answerOptions": [
                "She is deep in love with Ben.",
                "She isn't going to the party.",
                "She is badly hurt."
              ],
              "correctAnswer": "She is deep in love with Ben.",
              "variables": {
                "a": "What do we know about Camilla?"
              }
            }
          ]
        },
        {
          "text": "M: This is Jack speaking. Who is this?\nW: This is Jenny, Jack. Could you help me?\nM: Certainly. What is the matter?\nW: My sister had an argument with me yesterday because I lost her lovely pet cat. She was really mad at me. And she hasn't talked to me for a whole day.\nM: Oh, Jenny. In fact, you're the one who made a mistake.\nW: Yes, I know that. But what should I do to make her happy?\nM: If I were you, I'd say sorry to her first and then get her another cat.\nW: That's a good idea. But I don't have.., enough money.\nM: Oh, don't worry. I've got some. I can lend some to you.\nW: That's very kind of you.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She had a fight with her sister.",
                "She lost her sister's pet.",
                "She lost her money."
              ],
              "correctAnswer": "She lost her sister's pet.",
              "variables": {
                "a": "What happened to Jenny?"
              }
            },
            {
              "answerOptions": [
                "Turn to her parents for help.",
                "Buy her sister some new clothes.",
                "Apologize to her sister and buy her a cat."
              ],
              "correctAnswer": "Apologize to her sister and buy her a cat.",
              "variables": {
                "a": "What does the man advise Jenny to do?"
              }
            },
            {
              "answerOptions": [
                "Her sister.",
                "Jack.",
                "Her parents."
              ],
              "correctAnswer": "Jack.",
              "variables": {
                "a": "Who will lend some money to Jenny?"
              }
            }
          ]
        },
        {
          "text": "M: Do you know much about computers?\nW: Not a great deal. Why?\nM: I've been reading an article about computers. They are strange and are being used for almost everything.\nW: Yes. But have you learned how to use one?\nM: No. But I'm about to take a course on computers next term.\nW: That's good. You have to know about computers. Computer knowledge is a must whatever you do. You should learn quickly or you will be left behind.\nM: That's true. But first I want to learn the basics. In the library, there are computers. But it's a pity that I could not make use of them.\nW: Well, I can teach you the ABCs, if you like.\nM: That's very kind of you.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A great deal.",
                "Only a little.",
                "Nothing."
              ],
              "correctAnswer": "Nothing.",
              "variables": {
                "a": "How much does the man know about computers?"
              }
            },
            {
              "answerOptions": [
                "It's necessary for everyone no matter what you do.",
                "It's only important for those who use computers in their jobs.",
                "It's a must for English teachers."
              ],
              "correctAnswer": "It's necessary for everyone no matter what you do.",
              "variables": {
                "a": "What does the woman think of computer knowledge?"
              }
            },
            {
              "answerOptions": [
                "To go to the library with the man.",
                "To help the man with his English.",
                "To teach the man the basic knowledge about computers."
              ],
              "correctAnswer": "To teach the man the basic knowledge about computers.",
              "variables": {
                "a": "What does the woman promise to do?"
              }
            }
          ]
        },
        {
          "text": "M: Hi, Jane. It's nice to see you again. I heard that you went to the United Kingdom during the vacation.\nW: Yes. I paid a visit to London and attended a summer course in English.\nM: Wow. It sounds so good. How long did you stay there?\nW: Well, I went there on July 5th and came back on August 15th.\nM: What about the course?\nW: I think the course was well organized. The teachers were nice. They taught us to listen, speak, read and write in English, but it mostly focused on speaking. One interesting thing I found was that the English classes were different from ours because they were very free. You can sit anywhere you like in the classroom. You can ask the teacher questions at any time during the class, and you are welcome to share your ideas with the classmates and teachers. I really enjoy this kind of class.\nM: How interesting! Maybe our teachers should try that.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "To learn English.",
                "To do business.",
                "To visit some teachers."
              ],
              "correctAnswer": "To learn English.",
              "variables": {
                "a": "Why did the woman go to London during the vacation?"
              }
            },
            {
              "answerOptions": [
                "About 30 days.",
                "About 40 days.",
                "About 45 days."
              ],
              "correctAnswer": "About 40 days.",
              "variables": {
                "a": "How long did the woman stay in London?"
              }
            },
            {
              "answerOptions": [
                "The teachers were nice.",
                "There were a lot of activities in class.",
                "The students were quite free in class."
              ],
              "correctAnswer": "The students were quite free in class.",
              "variables": {
                "a": "What did the woman like particularly about the English classes?"
              }
            }
          ]
        },
        {
          "text": "M: You see the list of books for this course?\nW: Yes, Dr. Downs said he expects us to have the first five on the list. He is going to discuss them in detail.\nM: Are you going to buy them?\nW: I don't know. These books are expensive. And I don't have a lot of money on me.\nM: How about sharing them with me?\nW: Sounds good.\nM: Let's do this. I will buy three and you buy two of them.\nW: I would rather do it this way: we pay fifty-fifty for the books now. And at the end of the course you can take the books you find more interesting and I will take the ones I like.\nM: What if we both like the same books?\nW: Come on, we are not going to argue over that, are we?\nM: I was just joking. It's definitely a better idea.\nW: Then let's get the books as soon as possible.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Buying the books for their course.",
                "The money needed for the books.",
                "Sharing the books with each other."
              ],
              "correctAnswer": "Buying the books for their course.",
              "variables": {
                "a": "What are the speakers mainly talking about?"
              }
            },
            {
              "answerOptions": [
                "These books are not expensive.",
                "He wants his students to read more.",
                "He wants to discuss them in detail."
              ],
              "correctAnswer": "He wants to discuss them in detail.",
              "variables": {
                "a": "Why does Dr Downs want his students to have these five books?"
              }
            },
            {
              "answerOptions": [
                "She buys three and the man buys two.",
                "She pays the man fifty dollars for sharing.",
                "They each pay half of the total amount for the books."
              ],
              "correctAnswer": "They each pay half of the total amount for the books.",
              "variables": {
                "a": "How does the woman plan to solve the problems about the books?"
              }
            }
          ]
        },
        {
          "text": "M: Jane, do you have a pen pal?\nW: Yes, I do. Her name is Alice.\nM: Where is she?\nW: In England. But we don't often write to each other because neither of us has much time. We both have a lot of work to do.\nM: Do you know what your pen pal's hobbies are?\nW: Yes. She enjoys listening to music. Among school subjects, she likes math best.\nM: Are you going to write to her soon?\nW: I'm not sure. I'm pretty busy. But I'll write to her when I have time.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In England.",
                "In the US.",
                "In Italy."
              ],
              "correctAnswer": "In England.",
              "variables": {
                "a": "Where is Alice?"
              }
            },
            {
              "answerOptions": [
                "Math.",
                "Music.",
                "P.E."
              ],
              "correctAnswer": "Math.",
              "variables": {
                "a": "Which is Alice's favorite subject?"
              }
            },
            {
              "answerOptions": [
                "Alice's computer isn't working.",
                "She cannot spare the time.",
                "She doesn't want to disturb Alice's study."
              ],
              "correctAnswer": "She cannot spare the time.",
              "variables": {
                "a": "Why can't Jane write to Alice now?"
              }
            }
          ]
        },
        {
          "text": "W: Excuse me. Can I help you?\nM: Er... Could I have some writing paper and envelopes?\nW: Do you mean paper for writing letters?\nM: Yes.\nW: They are here in the showcase. Which one would you like?\nM: I want this kind of paper and that kind of envelope.\nW: All right, sir. Anything else?\nM: Yes, five fifty-- cent stamps.\nW: Er... There will be four dollars and sixty cents altogether.\nM: Here is five dollars.\nW: Thank you. Here is the change.\nM: Thanks.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Something for his study.",
                "Something for his letters.",
                "Something for his showcase."
              ],
              "correctAnswer": "Something for his letters.",
              "variables": {
                "a": "What would the man like to have here?"
              }
            },
            {
              "answerOptions": [
                "Fifty.",
                "Five.",
                "Fifteen."
              ],
              "correctAnswer": "Five.",
              "variables": {
                "a": "How many stamps does the man buy?"
              }
            },
            {
              "answerOptions": [
                "Forty cents.",
                "Sixty cents.",
                "One dollar."
              ],
              "correctAnswer": "Forty cents.",
              "variables": {
                "a": "How much is the change?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 3: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "W: Where are you from?\nM: Australia, from Sydney. I was at university, you know, I just finished and, er...I thought I'd go off around the world for a bit.\nW: What a long way to come! You have a long holiday, I suppose.\nM: Well, I finished my studies, you know, and found a job in a shipping firm. But I have three months,holiday before I start work. So I thought I just take some time to go around the world. If I need money, I just work where I am, you know, mainly teach English to young children. I used to work in a school,and I like children. But at the moment, I'm just having a holiday, wonderful here. I first arrived in Europe a couple of weeks ago. I went to France and, er, I came around... er...through Britain and I went right across to Japan, and then Korea. Now, here I am, in China.\nW: Wonderful! You must tell us all about your travels, because we're all very interested. I'll be working in a foreign trading firm soon. That'll help me learn something about other countries.\nM: Well. There's not much to tell, really. But I can show you photos and postcards.\nW: But...um...listen. Maybe, if you'd like, you can come to my home and have supper with us and, er...\nM: Oh. That's would be lovely.\nW: Well, you can tell us all about your stories and we can make you a very nice meal. How about that?\nM: That would be wonderful. A wonderful Chinese meal! A real Chinese meal! How lovely that would be! Wonderful!\nW: Good!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Trying to find a job.",
                "Traveling round the world.",
                "Teaching English for money."
              ],
              "correctAnswer": "Traveling round the world.",
              "variables": {
                "a": "What is the man doing now?"
              }
            },
            {
              "answerOptions": [
                "In an Australian school.",
                "In a shipping company.",
                "In a foreign trading firm."
              ],
              "correctAnswer": "In a shipping company.",
              "variables": {
                "a": "Where will the man be working?"
              }
            },
            {
              "answerOptions": [
                "Go sightseeing in the city.",
                "Eat in a Chinese restaurant.",
                "Have a home-made dinner."
              ],
              "correctAnswer": "Have a home-made dinner.",
              "variables": {
                "a": "What will the speakers do together in the evening?"
              }
            }
          ]
        },
        {
          "text": "M: 7286712\nW: Hello, Susan's speaking, may I speak to Judy please?\nM: I'm afraid she is not here at the moment. I am her brother, shall I take a massage?\nW: Yes, you see, Judy and I plan to play table tennis tomorrow, but my cosine has broken my bat, I think Judy has an extra one, so please ask her to bring it for me.\nM: So, Susan called, her table tennis bat broke, hope Judy bring an extra one.\nW: Yes, thank you, er.... One more thing, I lent her a book a couple of weeks ago, I think she has probably forgotten it all together, could you possibly ask her to bring along that book as well.\nM: Ok, bring along Susan's book.\nW: Thank you very much!\nM: Bye!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Judy's brother.",
                "Susan's cousin.",
                "Judy's cousin."
              ],
              "correctAnswer": "Judy's brother.",
              "variables": {
                "a": "Who is answering the phone?"
              }
            },
            {
              "answerOptions": [
                "It's stolen.",
                "It's lost.",
                "It's broken."
              ],
              "correctAnswer": "It's broken.",
              "variables": {
                "a": "What has happened to Susan's bat?"
              }
            },
            {
              "answerOptions": [
                "Bring the book and the extra bat.",
                "Call Susan and her cousin back.",
                "Play table tennis with her brother."
              ],
              "correctAnswer": "Bring the book and the extra bat.",
              "variables": {
                "a": "What does Susan ask Judy to do tomorrow?"
              }
            }
          ]
        },
        {
          "text": "W: What topic did you finally choose for the term paper for your World Economy class?\nM: After thinking about a few ideas, I finally settled on the difference between Japanese and American styles of management.\nW: Hmm. Why did you choose a topic like that?\nM: Well, I'm planning to study Business in graduate school next year. After that, I hope to start my own company.\nW: Isn't that a coincidence! I'm also doing a paper on how Japanese management styles are being adapted by American firms for my Comparative Cultures class.\nM: Why don't we sit down and share some of our sources after we've each been to the library?\nW: Great idea! Should we meet at the snack bar next Wednesday at this time?\nM: That's fine with me. See you then.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Topics for their term paper.",
                "Different majors.",
                "Holiday plans."
              ],
              "correctAnswer": "Topics for their term paper.",
              "variables": {
                "a": "What are the speakers mainly talking about?"
              }
            },
            {
              "answerOptions": [
                "Law.",
                "Business.",
                "Literature."
              ],
              "correctAnswer": "Business.",
              "variables": {
                "a": "What does the man plan to study in graduate school?"
              }
            },
            {
              "answerOptions": [
                "At the school gate.",
                "At a reading room.",
                "At a snack bar."
              ],
              "correctAnswer": "At a snack bar.",
              "variables": {
                "a": "Where does the woman suggest they meet next Wednesday?"
              }
            }
          ]
        },
        {
          "text": "W: Please have a seat, Mr. Saunders. I received your job resume last week, and it was very impressed.\nM: Thank you!\nW: We are a small financial company trading mostly stocks and bonds may I ask why you are so interested in working for us?\nM: Your company has an impressive reputation and I've always wanted to work for a smaller company.\nW: That's good to hear. Would you mind telling me a little bit about your present job?\nM: I'm currently working in a large international company in charge of a team of 8 brokers. We buy and sell stocks for major clients worldwide.\nW: Why do you think you are the right candidate for this position?\nM: As a head broker, I have a lot of experiences in the stock market, I deal with the clients on the daily bases, and I enjoy working with people.\nW: Well, you might just be the person we've been looking for. Do you have any questions?\nM: Aha, if I were hired, how many accounts would I be handling?\nW: you will be working with two other head brokers, in another words, you will be handling about a third of our clients.\nM: And who would I report to?\nW: Directly to me.\nM: I see. What kind of benefits package do you offer?\nW: Two weeks of paid vacation in your first year employment, you are also been entitled to medical and dental insurance, but this is something you should discuss with our Personnel Department. Do you have any other questions?\nM: No not at the moment.\nW: Well, I have to discuss you application with my colleagues and we'll get back to you early next week.\nM: OK, thanks, it's been nice meeting you!\nW: Nice meeting you too! And thanks for coming in today.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "To make a business report to the woman.",
                "To be interviewed for a job in the woman's company.",
                "To resign from his position in the woman's company."
              ],
              "correctAnswer": "To be interviewed for a job in the woman's company.",
              "variables": {
                "a": "What's the purpose of Mr. Saunders' visit?"
              }
            },
            {
              "answerOptions": [
                "He is head of a small trading company.",
                "He works in an international insurance company.",
                "He leads a team of brokers in a big company."
              ],
              "correctAnswer": "He leads a team of brokers in a big company.",
              "variables": {
                "a": "What is Mr. Saunders' current job?"
              }
            },
            {
              "answerOptions": [
                "The woman thinks Mr. Saunders is asking for more than they can offer.",
                "The woman seems to be satisfied with Mr. Saunders' past experience.",
                "Mr. Saunders believes that he deserves more paid vacations."
              ],
              "correctAnswer": "The woman seems to be satisfied with Mr. Saunders' past experience.",
              "variables": {
                "a": "What can we conclude from the conversation?"
              }
            }
          ]
        },
        {
          "text": "M: Hi, Tracy. I went into the college today to find out about evening classes.\nW: I still remember the painting course had so many people in it that you couldn't really get any personal help.\nM: Yes, but they have decided to limit the number this year, so if you want to do it you have to book a place. Anyway I wonder whether I ought to do computing really.\nW: But would it be advanced enough for you?\nM: I think so. The woman who runs it is supposed to be very good. She's not just a programmer. She's a well-trained teacher as well.\nW: It's up to you of course. But at the end of a day's work, I just want something relaxing. And I'd have to pay for materials. I can't afford more than the minimum.\nM: Then why don't you try Spanish? And it'd be really useful on holiday.\nW: Don't the language courses last two terms?\nM: I don't think so.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Sign up as soon as possible.",
                "Do a lot of preparations at first.",
                "Ask a teacher for personal help."
              ],
              "correctAnswer": "Sign up as soon as possible.",
              "variables": {
                "a": "What advice does the man give the woman about the painting course?"
              }
            },
            {
              "answerOptions": [
                "The advanced contents.",
                "The bright future.",
                "The good teacher."
              ],
              "correctAnswer": "The good teacher.",
              "variables": {
                "a": "What attracts the man most to study computing?"
              }
            },
            {
              "answerOptions": [
                "The course doesn't last very long.",
                "It won't cost too much and it's useful.",
                "There will be a limit on the number of people next year."
              ],
              "correctAnswer": "It won't cost too much and it's useful.",
              "variables": {
                "a": "Why does the man suggest the woman study Spanish?"
              }
            }
          ]
        },
        {
          "text": "W: I've sent out the invitations for the dinner party.\nM: That's good. Now what should we do?\nW: We need to plan the menu.\nM: Oh, that's right. What do you have in mind?\nW: I think I'm going to make the chicken salad we had at our 39th wedding anniversary. Remember, I asked Thomson, the chef of the restaurant where we often go, for the recipe?\nM: Oh, yes. I remember. Time sure flies! Now we are celebrating our golden anniversary! And Thomson was very friendly. You know, chefs seldom tell people their recipes. They often keep them a secret.\nW: I understand that. So you see, I have promised I will also keep the recipe a secret.\nM: Well, Thomson will appreciate that. Oh, but did you forget that Linda doesn't eat chicken?\nW: Linda? Oh, my Gosh! I forgot to invite her! She'll be mad at me. It just slipped my mind. Thanks for reminding me! I think I'm getting old!\nM: Looks like you are!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Linda's husband.",
                "The man's cousin.",
                "A chef."
              ],
              "correctAnswer": "A chef.",
              "variables": {
                "a": "Who is Thomson?"
              }
            },
            {
              "answerOptions": [
                "40.",
                "50.",
                "60."
              ],
              "correctAnswer": "50.",
              "variables": {
                "a": "How many years have the speakers got married?"
              }
            },
            {
              "answerOptions": [
                "She won't be invited to the party.",
                "She doesn't eat chicken.",
                "She is a good cook."
              ],
              "correctAnswer": "She doesn't eat chicken.",
              "variables": {
                "a": "What do we know about Linda?"
              }
            }
          ]
        },
        {
          "text": "M: Good morning, Madam. What can I do for you?\nW: Good morning. How much should I pay for these books to be sent to New York?\nM: Hm, 20 dollars. Anything else?\nW: Yes, a two-dollar stamp, please.\nM: That will be 22 dollars all together.\nW: Here's 25.\nM: Thank you. And here's the change.\nW: Thank you.\nM: You're welcome.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "At the post office.",
                "At a bookstore.",
                "At the bank."
              ],
              "correctAnswer": "At the post office.",
              "variables": {
                "a": "Where are they most possibly?"
              }
            },
            {
              "answerOptions": [
                "One.",
                "Two.",
                "Four."
              ],
              "correctAnswer": "One.",
              "variables": {
                "a": "How many stamps does the woman buy?"
              }
            },
            {
              "answerOptions": [
                "One dollar.",
                "Two dollars,",
                "Three dollars."
              ],
              "correctAnswer": "Three dollars.",
              "variables": {
                "a": "How much is the change?"
              }
            }
          ]
        },
        {
          "text": "W: Excuse me. I am looking for something local or special here as gifts. Could you give me some suggestions?\nM: Well, we have quite a few choices here: pottery, postcards with our local scenery, hand-made woolen hats and over there some food.\nW: These hats look very beautiful! How much are they?\nM: Forty-five dollars each or eighty dollars for the pair.\nW: OK. I'll take the red one.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In a gift shop.",
                "In a flower shop.",
                "At a bank."
              ],
              "correctAnswer": "In a gift shop.",
              "variables": {
                "a": "Where does the conversation take place most probably?"
              }
            },
            {
              "answerOptions": [
                "Three.",
                "Four.",
                "Five."
              ],
              "correctAnswer": "Four.",
              "variables": {
                "a": "How many kinds of gifts did the man mention?"
              }
            },
            {
              "answerOptions": [
                "The blue one.",
                "The red one.",
                "The yellow one."
              ],
              "correctAnswer": "The red one.",
              "variables": {
                "a": "Which hat does the woman like?"
              }
            }
          ]
        },
        {
          "text": "W: Well, I'm afraid my cooking isn't to your taste.\nM: Actually, I like it very much.\nW: I'm glad you enjoy it. Let me serve you some more fish.\nM: No, thank you. I've had enough fish, but I'd like some soup.\nW: Here it is. Help yourself!\nM: Thanks. I didn't know you were so good at cooking. If only my wife could learn to cook from you.\nW: Why not bring your wife next time? I haven't seen her for quite a while.\nM: OK, I will. She will be very glad to see you, too. Thank you for the wonderful meal.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "It's really terrible.",
                "It's very good indeed.",
                "It's better than what he does."
              ],
              "correctAnswer": "It's very good indeed.",
              "variables": {
                "a": "What does the man think of the woman's cooking?"
              }
            },
            {
              "answerOptions": [
                "Improve cooking skills.",
                "Bring his wife next time.",
                "Have some soup."
              ],
              "correctAnswer": "Bring his wife next time.",
              "variables": {
                "a": "What does the woman ask the man to do?"
              }
            }
          ]
        },
        {
          "text": "W: Hello, this is TBC Television Studios. How can I help you?\nM: Hello. I'm calling because I saw an ad in the campus newspaper. It said you wanted an assistant to work on your local news program.\nW: Right. But you do realize that we just need volunteers. It's an unpaid position.\nM: Oh, sure. I understand that. I just want to get some experience working for television news production after I get my degree.\nW: I see. Well, you'll need to talk to Ms. Black. She is in charge of the program. But first, you'll need to come here to fill out an application form. Can you drop by the studio later today?\n{a}",
          "instances": [
            {
              "answerOptions": [
                "At a university.",
                "At a TV station.",
                "At a newspaper office."
              ],
              "correctAnswer": "At a TV station.",
              "variables": {
                "a": "Where does the woman work?"
              }
            },
            {
              "answerOptions": [
                "He needs a well-paid position.",
                "He has recently lost another job.",
                "He wants some working experience."
              ],
              "correctAnswer": "He wants some working experience.",
              "variables": {
                "a": "Why is the man applying for this position?"
              }
            }
          ]
        }
      ]
    }
  ]
}