{
  "courseId": "a25ea4b5-7788-44fc-a60d-d1e413e8224c",
  "title": "Everyday English Course 31",
  "description": "Improve your English comprehension skills through short everyday conversations and situational dialogues.",
  "imageUrl": "/public/images/courses/end46c00-6746-4c45-a867-a8f08666a5c6.png",
  "totalSections": 3,
  "sections": [
    {
      "title": "Section 1: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "M: Hi, what can I do for you?\nW: I'd like to send this package to France. Can it be delivered in the next five days?\nM: Yes. We offer an overnight service. It'll cost 70 dollars.\nW: Ah, that's a bit expensive. Do you have a three-day service?\nM: No, but we can get your package to France in one week for 40 dollars.\nW: Well, that sounds good. I'll take that. Is the service guaranteed?\nM: Yes. We also offer a service where we can track your package. But that will cost 10 dollars extra.\nW: Oh, I won't need the tracking service...\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In three days.",
                "In five days.",
                "In one week."
              ],
              "correctAnswer": "In one week.",
              "variables": {
                "a": "When will the woman's package reach France?"
              }
            },
            {
              "answerOptions": [
                "$10.",
                "$40.",
                "$70."
              ],
              "correctAnswer": "$40.",
              "variables": {
                "a": "How much will the woman pay at last?"
              }
            }
          ]
        },
        {
          "text": "M: Do you want to go to sleep, or do you want to stay up and watch a movie? I'm pretty tired, but I'm always up for a horror movie. It is Halloween, after all...\nW: I'd love to, but not tonight. I ate too much candy, and I'm so exhausted from trick-or-treating all night with the boys from the neighborhood. I need to rest!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Going to bed right away.",
                "Eating some candy.",
                "Watching a movie."
              ],
              "correctAnswer": "Watching a movie.",
              "variables": {
                "a": "What does the man suggest doing?"
              }
            },
            {
              "answerOptions": [
                "She celebrated a festival.",
                "She took some kids to dinner.",
                "She helped her neighbor with some work."
              ],
              "correctAnswer": "She celebrated a festival.",
              "variables": {
                "a": "Why is the woman so tired?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, Jack, have you thought about your ideal job in the future? Do you want to be an excellent math teacher like your father?\nM: For Gosh's sake! I hate being a teacher. I still have a clear memory of the terrible days when my father helped me with all my subjects. But it is strange that I made great progress in my English learning. How about you, Jessica?\nW: Well, I dream of being a brilliant dancer like my mother. You know, she is 43 now, and she has been dancing since she was 20 years old.\nM: I can't believe it! She looks quite young and has a great figure.\nW: Yes. She has formed a good habit of having enough fruits and vegetables every day. And more importantly, she keeps an optimistic attitude towards life which benefits her physical condition.\nM: Oh, I see. How I wish I had taken enough exercise.\nW: Come on. Don't lose heart! If you think you can, you can. Let's get rid of our bad habits and learn from our great parents.\nM: Why not do it right now? Shall we swim this afternoon?\nW: With pleasure!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "For 20 years.",
                "For 23 years.",
                "For 43 years."
              ],
              "correctAnswer": "For 23 years.",
              "variables": {
                "a": "How long has Jessica's mother been dancing?"
              }
            },
            {
              "answerOptions": [
                "Having an optimistic attitude towards life.",
                "Fruits and vegetables.",
                "Taking enough exercise."
              ],
              "correctAnswer": "Having an optimistic attitude towards life.",
              "variables": {
                "a": "Jessica's mother is in good condition, and what contributes to this more?"
              }
            }
          ]
        },
        {
          "text": "M: It's Alice's birthday tomorrow.\nW: Are you sure? I think it should be the day after tomorrow.\nM: Well, let me see. Oh, I'm sorry. You're right. It is the day after tomorrow. Shall we buy her a present?\nW: Yes, of course. Shall we give her some flowers?\nM: Flowers are lovely. But I think it's better to buy her a nice box of chocolates.\nW: Alice doesn't like sweet things. Didn't you know that?\nM: You're right. Er ... I know. We can give her a record. She loves music.\nW: That's a good idea. Let's go to the music shop and choose one for her.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "The next day.",
                "The day after next.",
                "The day they had the talk."
              ],
              "correctAnswer": "The day after next.",
              "variables": {
                "a": "When is Alice's birthday?"
              }
            },
            {
              "answerOptions": [
                "A record.",
                "Some flowers.",
                "A box of chocolates."
              ],
              "correctAnswer": "A record.",
              "variables": {
                "a": "What will the man and the woman buy for Alice?"
              }
            }
          ]
        },
        {
          "text": "W: So what do you think you are going to do when you graduate, John?\nM: I'm not sure. My dad says I should work in information technology. You know something with computers.\nW: Is that what your dad does?\nM: Not really. He is an engineer.\nW: How about you? What are you interested in doing?\nM: Well. I'm interested in medicine. I'd love to be a doctor.\nW: Yeah, what subject are you good at?\nM: Math is my best subject. And I'm also pretty good at science.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Workmates.",
                "Friends.",
                "Mother and son."
              ],
              "correctAnswer": "Friends.",
              "variables": {
                "a": "What might be the relationship between the two speakers?"
              }
            },
            {
              "answerOptions": [
                "The man's major in college.",
                "The man's favorite subjects.",
                "The man's future job."
              ],
              "correctAnswer": "The man's future job.",
              "variables": {
                "a": "What are they talking about?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, David. I haven't seen you for ages. How are you getting along with your work?\nM: Hi, Susan. Not so well as to be expected. I've left my position. I can't bear the rudeness of my boss any longer.\nW: What are you going to do then?\nM: No idea. Anyway, I've got to think about it seriously. And you?\nW: I've been very successful as a dancer. I like this kind of life. It is so exciting.\nM: You can't do that forever.\nW: No. But I've decided to open a dance school once I've moved to the top. A lot of young dancers need better training.\nM: That's a wonderful idea.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A teacher.",
                "A dancer.",
                "Neither of the above."
              ],
              "correctAnswer": "Neither of the above.",
              "variables": {
                "a": "What does the man do now?"
              }
            },
            {
              "answerOptions": [
                "She hasn't reached the top yet.",
                "She isn't very successful.",
                "She doesn't like her present position."
              ],
              "correctAnswer": "She hasn't reached the top yet.",
              "variables": {
                "a": "How is the woman getting on with her work?"
              }
            }
          ]
        },
        {
          "text": "W: Welcome to Youth Hotel, can I help you?\nM: I'd like a room for a night.\nW: Would you like a single room, a double room or a room for three?\nM: Oh, a single room please. Can I pay by check?\nW: Sure, fill in this form please.\nM: Need my student card number?\nW: No, just your address and telephone number.\nM: OK, here is the form.\nW: Very well. Here is your key to room 212.\nM: Thank you!\nW: Have a good stay!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A single room.",
                "A double room.",
                "A room for three."
              ],
              "correctAnswer": "A single room.",
              "variables": {
                "a": "What kind of room does the man want to take?"
              }
            },
            {
              "answerOptions": [
                "Telephone and student card numbers.",
                "Student card number and address.",
                "Address and telephone number."
              ],
              "correctAnswer": "Address and telephone number.",
              "variables": {
                "a": "What does the man need to put in the from?"
              }
            }
          ]
        },
        {
          "text": "W: Is there anything else that you would like to buy?\nM: No, thank you. I guess that's it. By the way, in case there's a flaw in this CD player. Can I return it?\nW: Yes. But you must return it within 30 days.\nM: Is there a charge for that?I know other stores have a restocking fee.\nW: There will be no charge at all.\nM: I'm glad to hear that.\nW: However,you must show us the receipt. Could you sign it here, please?\nM: OK.\nW: All right. Keep your receipt. If something comes up. you can show it to us and We'll give you a refund.\nM: Thanks. I'll put it in a safe place.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He can return the CD player without a charge in 30 days.",
                "He has already kept the receipt in the safe place.",
                "He signed his name and got refund."
              ],
              "correctAnswer": "He can return the CD player without a charge in 30 days.",
              "variables": {
                "a": "Why is the man very happy?"
              }
            },
            {
              "answerOptions": [
                "The money.",
                "The restocking fee.",
                "The receipt."
              ],
              "correctAnswer": "The receipt.",
              "variables": {
                "a": "What should the man take to return the CD player?"
              }
            }
          ]
        },
        {
          "text": "M: I want to make sure my son receives this letter. It has an important certificate in it.\nW: You can send it either by certified mail or registered mail. If you only want to make sure it is received, send it by certified mail. It's less expensive.\nM: OK. How about this package?\nW: What's in it?\nM: A watch.\nW: You should insure it for the value of the watch, and send it by registered mail. It's more expensive, but it's the safest way.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A valuable book.",
                "An important certificate.",
                "A beautiful postcard."
              ],
              "correctAnswer": "An important certificate.",
              "variables": {
                "a": "What is in the letter?"
              }
            },
            {
              "answerOptions": [
                "By certified mail.",
                "By air mail.",
                "By registered mail."
              ],
              "correctAnswer": "By certified mail.",
              "variables": {
                "a": "In which way do you think the man will send the letter?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, Jim!\nM: Hi, Mary! Where is Hill?\nW: Oh, he's probably at home.\nM: Why?\nW: He drank too much last night.\nM: Now we have to do this work without him.\nW: Even when he comes, he's too lazy to do very much.\nM: Right. I'm fed up with him.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He is at home.",
                "He is in the office.",
                "He is on the way home."
              ],
              "correctAnswer": "He is at home.",
              "variables": {
                "a": "Where is Hill now?"
              }
            },
            {
              "answerOptions": [
                "He likes Hill very much.",
                "He dislikes Hill.",
                "He doesn't know Hill."
              ],
              "correctAnswer": "He dislikes Hill.",
              "variables": {
                "a": "What does the man think about Hill?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 2: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "W: Excuse me. I just received my telephone bill, and there's a problem with it.\nM: May I see your bill, please?\nW: Certainly. There it is. On July 1st, I really don't know anybody in Finland.\nM: OK, don't worry. I'll take the call off. Let's see...it was $42. Your bill was $ 66.10, minus $42, so your new total is $24.10. I'm very sorry about the mistake.\nW: That's OK. It wasn't your fault.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In a bank.",
                "In a store.",
                "In an office."
              ],
              "correctAnswer": "In an office.",
              "variables": {
                "a": "Where are the two speakers?"
              }
            },
            {
              "answerOptions": [
                "$42.",
                "$24.10.",
                "$6.10."
              ],
              "correctAnswer": "$24.10.",
              "variables": {
                "a": "How much is the woman's new bill?"
              }
            }
          ]
        },
        {
          "text": "W: Thanks for coming golfing with me today, Carl.\nM: No problem, Marge. I need to work on my swing. And this weather is just amazing.\nW: I only play on days like this-sunny but cool with a soft breeze.\nM: How long has it been since you last played?\nW: Too long-almost six months. I used to play at least once a month, though.\nM: Oh, really? I try to play at least once every other week.\nW: Well, then you can help me with my game.\nM: No problem.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Playing tennis.",
                "Playing football.",
                "Playing golf."
              ],
              "correctAnswer": "Playing golf.",
              "variables": {
                "a": "What are the speakers doing today?"
              }
            },
            {
              "answerOptions": [
                "Once a month.",
                "Twice a month.",
                "Once a week."
              ],
              "correctAnswer": "Twice a month.",
              "variables": {
                "a": "How often does the man play on average?"
              }
            }
          ]
        },
        {
          "text": "W: Please, please, can you help me? Someone just stole my camera.\nM: Calm down, Madam. Now you said your camera was stolen.\nW: Yes. It was a petards, DF, Super.\nM: Color?\nW: Black.\nM: And how much was it worth?\nW: I only bought it last month. It costs 380 pounds.\nM: Right. Where was it stolen?\nW: In the city center, outside McDonalds, on Hope Avenue.\nM: What time was this?\nW: About 2:30.\nM: And did you get a look at who ever stole it?\nW: It was a young man, maybe 18 with short dark hair, and glasses. He was wearing a green T-shirt.\nM: And were there any other people?\nW: Lots of people was there but...,oh, the ice cream seller, he was standing on the corner.\nM: OK, an ice cream seller. Now what's your name?\nW: Mary Smith.\nM: OK, well Ms Smith, that's all we can do for now, we'll phone you if we have any news.\nW: OK, then, thank you very much.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A police officer.",
                "A man on the street.",
                "A newspaper reporter."
              ],
              "correctAnswer": "A police officer.",
              "variables": {
                "a": "Who is the woman speaking to?"
              }
            },
            {
              "answerOptions": [
                "Outside an ice cream place.",
                "Outside a restaurant.",
                "Outside her home."
              ],
              "correctAnswer": "Outside a restaurant.",
              "variables": {
                "a": "Where was the woman's camera stolen?"
              }
            }
          ]
        },
        {
          "text": "M: Lily, don't you think the scholarship from New York University is something great? Why did you decline this offer?\nW: I do realize the value of the scholarship. But, if I could explain, my mother doesn't want me to go overseas.\nM: Why?\nW: You know, I'm the only child in the family. My mother will be living alone most of the time for three years in my absence. She cannot even think of it.\nM: Nobody to take care of her?\nW: My father travels a lot to many countries and he is doing business in Dubai now. I have to do a lot for my mom at home.\nM: Oh, I see. You are very considerate.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Lily rejected a job offer.",
                "Lily was absent from school.",
                "Lily turned down a scholarship."
              ],
              "correctAnswer": "Lily turned down a scholarship.",
              "variables": {
                "a": "Why does the man sound surprised?"
              }
            },
            {
              "answerOptions": [
                "Travel to Dubai.",
                "Stay with her mom.",
                "Start a business."
              ],
              "correctAnswer": "Stay with her mom.",
              "variables": {
                "a": "What has Lily decided to do?"
              }
            }
          ]
        },
        {
          "text": "W: Can I help you?\nM: Yes, I'd like to read some articles that are on reserve in the library for anthropology 311.\nW: Professor Gilers's class?\nM: That's right. How could you know?\nW: Let's just say you are not the first person.\nM: Oh, well, seeing as how I haven't read any of them yet, it doesn't really matter which one of them you give me first.\nW: I'm afraid I can't give you any of them at the moment. They've all been checked out.\nM: You're kidding all of them?\nW: I've asked professor Gilers twice already to bring in additional copies of the articles, but no sooner do I place them on the shelves than they are gone. See that girl in the black sweater? She's been waiting for half an hour for these same articles to be returned.\nM: And here I went out of my way to free the whole afternoon to read.\nW: I'm sorry, but there is not a whole lot I can do about it. All I can suggest is that you come in first thing tomorrow morning and try again; we open at eight.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She is studying anthropology.",
                "She is wearing a black sweater.",
                "She works in the library."
              ],
              "correctAnswer": "She works in the library.",
              "variables": {
                "a": "What can infered about the woman who's speaking?"
              }
            },
            {
              "answerOptions": [
                "They do not want to use the reference materials.",
                "They have been keeping the librarian busy.",
                "They have part-time jobs at the library."
              ],
              "correctAnswer": "They have been keeping the librarian busy.",
              "variables": {
                "a": "What can be infered about the students in anthropology 311?"
              }
            }
          ]
        },
        {
          "text": "W: Have you decided which to order?\nM: Yes. First I will have apple juice.\nW: And then?\nM: I will have some chicken.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "At home.",
                "At a dinner party.",
                "At a restaurant."
              ],
              "correctAnswer": "At a restaurant.",
              "variables": {
                "a": "Where does this conversation take place?"
              }
            },
            {
              "answerOptions": [
                "Some pork.",
                "Some chicken.",
                "Some beef."
              ],
              "correctAnswer": "Some chicken.",
              "variables": {
                "a": "What will the man have besides apple juice?"
              }
            }
          ]
        },
        {
          "text": "M: Which countries have you been to?\nW: I've been to most of the countries in Europe, several countries in Asia - China, Japan, Korea, and Thailand - and to the United States and Canada.\nM: I thought you had been to Australia too.\nW: No, but I'm planning on visiting Australia and New Zealand soon. Which is the most beautiful country you've been to?\nM: I think I'd say Norway.\nW: Isn't it really cold there?\nM: Well, the north of Norway is almost always cold, but farther south, it can be fairly warm in summer. It's a wet country, so there's snow almost everywhere in winter.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Canada and Australia.",
                "Singapore and America.",
                "China and Korea."
              ],
              "correctAnswer": "China and Korea.",
              "variables": {
                "a": "Which countries has the woman already been to?"
              }
            },
            {
              "answerOptions": [
                "It is always cold all over the country.",
                "It snows almost everywhere in winter.",
                "It's very dry in summer."
              ],
              "correctAnswer": "It snows almost everywhere in winter.",
              "variables": {
                "a": "What can we learn about Norway?"
              }
            }
          ]
        },
        {
          "text": "W: Hi. Mike. How did your weekend go?\nM: Fine. I went back to visit my grandma in the countryside.\nW: Lucky you. What did you do there?\nM: I went for a walk in the hills with some of my friends.\nW: Was it good?\nM: Yes. the scenery was amazing. The whole hillside was very red.\nW: How wonderful! Do anything else?\nM: We went on a picnic on Sunday.\nW: Did you like it?\nM: Very enjoyable. By the way, Lisa. what about your Weekend?\nW: Don't ask me. Mike.\nM: What happened?\nW: I have got a cold. I could do nothing but lie in bed.\nM: Oh. dear.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He went to visit his grandma in the countryside.",
                "He went for a picnic with his friend in the park.",
                "He stayed at home and doing nothing."
              ],
              "correctAnswer": "He went to visit his grandma in the countryside.",
              "variables": {
                "a": "What did Mike do last week?"
              }
            },
            {
              "answerOptions": [
                "She has got a bad cold.",
                "She has to prepare things for the picnic.",
                "She has a lot of housework to do."
              ],
              "correctAnswer": "She has got a bad cold.",
              "variables": {
                "a": "Why did Lisa lie in bed and do nothing at weekend?"
              }
            }
          ]
        },
        {
          "text": "W: Where are you going to take your vacation?\nM: Hawaii.\nW: That sounds like a great place to visit. Is your family going?\nM: Yes. We plan to go mountain climbing, fishing, swimming, and windsurfing. But most of all, we're planning to relax. My wife is taking a whole bunch of books to read.\nW: Your children must all be excited about it.\nM: Yes, they are. They're counting the days. Are you going to Europe again this summer?\nW: No, not this time. We're going to visit some old friends in Egypt.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She likes reading very much.",
                "She's counting the days.",
                "She will visit some old friends."
              ],
              "correctAnswer": "She likes reading very much.",
              "variables": {
                "a": "What do we know about the man's wife?"
              }
            },
            {
              "answerOptions": [
                "Hawaii.",
                "Europe.",
                "Egypt."
              ],
              "correctAnswer": "Europe.",
              "variables": {
                "a": "Where did the woman probably go last summer?"
              }
            }
          ]
        },
        {
          "text": "M: Any message for me, Miss White?\nW: Just one, Mr. Brown. You had a phone call from someone called Smith, Mary Smith.\nM: Smith? I don't know anyone called Smith. What did she say?\nW: She wouldn't say anything. But it sounded important. I told her you'd call her as soon as you came back.\nM: Well, I think I'd better do it then. Have you got her telephone number?\nW: Yes, it's 44356793.\nM: Have you written it down?\nW: I always do. It's on your desk.\nM: Thank you.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Miss Smith.",
                "Miss White.",
                "Mr. Brown."
              ],
              "correctAnswer": "Miss Smith.",
              "variables": {
                "a": "Who made the telephone call?"
              }
            },
            {
              "answerOptions": [
                "Mr. Brown's address.",
                "Miss Smith's message.",
                "The telephone number."
              ],
              "correctAnswer": "The telephone number.",
              "variables": {
                "a": "What did the woman take down?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 3: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "M: Would you please tell me why you want to work in our kindergarden? You know kids are sometimes so tiresome.\nW: I love children. I can sing to them and teach them how to dance.\nM: Then have you worked in a kindergarden before?\nW: No, but I used to take care of children during summer and winter holidays.\nM: I see. By the way, do you want to work part-time or full-time?\nW: I'd prefer part-time.\nM: When can you work?\nW: I'm free every afternoon. So I can work about 20 hours a week.\nM: OK, Jean, you're hired. You can work here from 2 p.m. to 6 p.m., four days a week, except Friday, Saturday and Sunday.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A cook.",
                "A teacher.",
                "A doctor."
              ],
              "correctAnswer": "A teacher.",
              "variables": {
                "a": "What is the woman going to be?"
              }
            },
            {
              "answerOptions": [
                "8 hours.",
                "6 hours.",
                "4 hours."
              ],
              "correctAnswer": "4 hours.",
              "variables": {
                "a": "How many hours will the woman work every day?"
              }
            }
          ]
        },
        {
          "text": "M: Let's try that song again. You played it well, but try to play the second part a little faster this time.\nW: Ugh. I already played it three times! My hands are too cold to play well.\nM: OK, let's try another song. Play the short, slow piece that you like so much, the one that sounds like guitar music. That should warm up your hands!\nW: Oh, that one is easy! I played it four times this morning. It's my favorite.\nM: Good! You will be a great piano player one day if you keep playing the songs that you enjoy!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "The guitar.",
                "The violin.",
                "The piano."
              ],
              "correctAnswer": "The piano.",
              "variables": {
                "a": "What instrument is the woman playing?"
              }
            },
            {
              "answerOptions": [
                "Four times.",
                "Three times.",
                "Two times."
              ],
              "correctAnswer": "Three times.",
              "variables": {
                "a": "How many times did the woman play the first song?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, Bob, which unit are you learning this week in your English class?\nM: Last week we learned first part of Unit 1. On Monday we finished Unit 1. On Wednesday we'll finish Unit 2. And on Friday we'll finish Unit 3.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Unit 1.",
                "Unit 2.",
                "Unit 3."
              ],
              "correctAnswer": "Unit 1.",
              "variables": {
                "a": "Which unit is Bob learning?"
              }
            },
            {
              "answerOptions": [
                "One and a half.",
                "Two.",
                "Two and a half."
              ],
              "correctAnswer": "Two and a half.",
              "variables": {
                "a": "How many will Bob learn in this week?"
              }
            }
          ]
        },
        {
          "text": "M: Do you like Chinese food?\nW: Yes, Ido.\nM: What's your favorite Chinese food?\nW: Mm. It's hard to say. I like hot and sour soup a lot but I guess I like bean curd better.\nM: Do you eat Chinese food often?\nW: Once in a while.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Yes.",
                "No.",
                "Unclear."
              ],
              "correctAnswer": "Yes.",
              "variables": {
                "a": "Dose the woman like Chinese food?"
              }
            },
            {
              "answerOptions": [
                "Beans.",
                "Bean curd.",
                "Peas."
              ],
              "correctAnswer": "Bean curd.",
              "variables": {
                "a": "What is the woman's favorite Chinese food?"
              }
            }
          ]
        },
        {
          "text": "M: So. What's your uncle like?\nW: Oh, very friendly and open-minded. Don't worry. I'm sure he'll let you give a performance there. The good thing is that a lot of famous people go there. So do reporters and photographers.\nM: Yeah, but what if he doesn't like our music?\nW: He'll like it. He hasn't had a live band for a while, so I think he'd like one for a change.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He plays music.",
                "He has a restaurant.",
                "He is a news reporter."
              ],
              "correctAnswer": "He has a restaurant.",
              "variables": {
                "a": "What does the woman's uncle do?"
              }
            },
            {
              "answerOptions": [
                "A bank.",
                "A band.",
                "A camera."
              ],
              "correctAnswer": "A band.",
              "variables": {
                "a": "What does the man have?"
              }
            }
          ]
        },
        {
          "text": "M: Hello, 6632278.\nW: Hi, Jack. It's me, Ann. I wasn't at school today. Have we got any homework to do for tomorrow?\nM: Let me see. Well, we've got to do the math problems on Page 40 in our textbook.\nW: All right. I've got it.\nM: Then, we have to go on with our reading for English. The history teacher wants us to read the chapter on the History of London for tomorrow, and write down the most important dates and events in that chapter.\nW: Anything else? Ah...ah, music?\nM: No, we haven't any music homework, but the science teacher is giving us a test on Friday, so we have to study for that.\nW: Oh no. I'm so bad at science. I hate it. Thanks, Jack.\nM: Don't mention it. See you tomorrow.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Science",
                "History",
                "Music"
              ],
              "correctAnswer": "Science",
              "variables": {
                "a": "What test are the speakers going to take on Firday?"
              }
            },
            {
              "answerOptions": [
                "To discuss her maths problems",
                "To seek help with her English reading",
                "To ask about the homework for tomorrow"
              ],
              "correctAnswer": "To ask about the homework for tomorrow",
              "variables": {
                "a": "Why does the woman speaker make the phone call?"
              }
            }
          ]
        },
        {
          "text": "W: Jack, would you please read this letter I've just written? I'd like to have your opinion.\nM: I'd be glad to tell you what I think.\nW: If you don't think it's any good, please say so. I really want to get this job.\nM: It looks fine to me. But I have one suggestion.\nW: What is it?\nM: If I were you, I'd change the beginning. You should write about your education first.\nW: Good idea, Jack. What do you think about the second part?\nM: Well, I'm afraid it's too short. You should include much more information about your work experience.\nW: You're right. I'll change it.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "To apply for a job.",
                "To finish a class assignment.",
                "To apologize to someone."
              ],
              "correctAnswer": "To apply for a job.",
              "variables": {
                "a": "What is the aim of the woman's letter?"
              }
            },
            {
              "answerOptions": [
                "Shorten the second part.",
                "Talk about her experience in the end.",
                "Put the education section in the beginning."
              ],
              "correctAnswer": "Put the education section in the beginning.",
              "variables": {
                "a": "What does the man suggest the woman do?"
              }
            }
          ]
        },
        {
          "text": "M: Hey Jane, where are you going this weekend?\nW: Hi, Bob. I'm going to the beach. 13o you want to come too?\nM: Yes, that sounds like fun. Which beach are you going to?\nW: I was thinking of going to Huangdao's Beach. I like to watch the sea birds and wildlife there.\nM: That sounds great! When do you plan to leave?\nW: Well, I think at about four o'clock on Friday.\nM: Great. Where should we meet?\nW: Meet me on Friday in front of my house.\nM: OK, I'll see you then. Bye.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Because she wants to sit in the sun.",
                "Because she wants to watch the waves.",
                "Because she wants to observe the seabirds."
              ],
              "correctAnswer": "Because she wants to observe the seabirds.",
              "variables": {
                "a": "Why does the woman plan to go to Huangdao's Beach?"
              }
            },
            {
              "answerOptions": [
                "Saturday.",
                "Sunday.",
                "Friday."
              ],
              "correctAnswer": "Friday.",
              "variables": {
                "a": "When will they meet again?"
              }
            }
          ]
        },
        {
          "text": "M: I'd like to book a seat on the 8:30 flight to New York on 1st July.\nW: I'm sorry, Sir, that flight is fully booked.\nM: Oh, well, in that case I'll go on the 10:30.\nW: Yes, Sir, we have seats on that flight.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "The 8:30 flight",
                "The 10:30 flight",
                "The 9:30 flight"
              ],
              "correctAnswer": "The 10:30 flight",
              "variables": {
                "a": "Which flight does the man take actually?"
              }
            },
            {
              "answerOptions": [
                "The tickets were all sold out",
                "It has changed its taking-off time",
                "The plane is too crowded"
              ],
              "correctAnswer": "The tickets were all sold out",
              "variables": {
                "a": "What do you know about the flight on 8:30?"
              }
            }
          ]
        },
        {
          "text": "W: Jack, would you like to come to my house with your wife for dinner at six tomorrow evening?\nM: We would like to. Who else will be there?\nW: Well, I also invite the White's.\nM: That sounds great. I enjoy making friends, chatting with others. I always stay at home and feel bored. By the way, is it a formal dinner or informal one?\nW: Informal, of course, just feel at home.\nM: Great! Oh, I can't wait.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "More than four.",
                "Three.",
                "Five."
              ],
              "correctAnswer": "More than four.",
              "variables": {
                "a": "How many people will be at the party?"
              }
            },
            {
              "answerOptions": [
                "He meanns that he is just looking forward to the party.",
                "He means that he hates being late for the party.",
                "He means that he must hurry."
              ],
              "correctAnswer": "He meanns that he is just looking forward to the party.",
              "variables": {
                "a": "What does the man mean by saying \"I can't wait\"?"
              }
            }
          ]
        }
      ]
    }
  ]
}