{
  "courseId": "a79b07cc-6a24-47db-b16a-d52f58622aad",
  "title": "Everyday English Course 22",
  "description": "Improve your English comprehension skills through short everyday conversations and situational dialogues.",
  "imageUrl": "/public/images/courses/end46c00-6746-4c45-a867-a8f08666a5c6.png",
  "totalSections": 3,
  "sections": [
    {
      "title": "Section 1: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "M: Hello, Louise. Have you seen my new supermarket yet?\nW: Yes. I've heard of it actually. I suppose you must like it.\nM: Yes, I mean it's marvelous.\nW: Oh, Jeff. I really can't agree. I don't like it at all. My shop is much better.\nM: You must be mad. I think it's really...you know...so easy to buy everything in one place.\nW: Yes, it's easy. But don't you think the food isn't...I mean small shops usually have much fresher food.\nM: Maybe, but you pay for it. Small shops are more expensive, aren't they?\nW: Yes, I agree with you, but supermarket staff are badly paid and they are really...but you get better service in small shops. They are much more friendly.\nM: No, everyone in my supermarket is very nice.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "People served in shops.",
                "Goods in various qualities.",
                "Shopping in different places."
              ],
              "correctAnswer": "Shopping in different places.",
              "variables": {
                "a": "What are the two speakers generally talking about?"
              }
            },
            {
              "answerOptions": [
                "A salesman in a small shop.",
                "A manager of a supermarket.",
                "A staff of a department store."
              ],
              "correctAnswer": "A manager of a supermarket.",
              "variables": {
                "a": "What is the man?"
              }
            },
            {
              "answerOptions": [
                "They're unfriendly.",
                "They're very nice.",
                "They're well-paid."
              ],
              "correctAnswer": "They're unfriendly.",
              "variables": {
                "a": "What might the woman think of supermarket staff?"
              }
            }
          ]
        },
        {
          "text": "W: Excuse me. Can you tell me the way to the Public Library?\nM: The Public Library? But there are so many public libraries in London. Which one do you want to go to?\nW: The nearest one.\nM: That's rather far away, too. You'd better take a bus. Take the No. 7 bus to the zoo, then change to the No. 9 bus and get off at the end.\nW: And where's the No. 7 bus-stop, please?\nM: Go straight down the street, and turn left at the traffic lights. Then take the second turning on the right, and you'll find the bus-stop near the corner. You can't miss it.\nW: Thank you very much.\nM: Not at all.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In the library.",
                "In a department store.",
                "In the street."
              ],
              "correctAnswer": "In the street.",
              "variables": {
                "a": "Where are the two speakers?"
              }
            },
            {
              "answerOptions": [
                "A woman and his husband.",
                "A woman and a passer-by.",
                "A woman and her friend."
              ],
              "correctAnswer": "A woman and a passer-by.",
              "variables": {
                "a": "Who are the two speakers?"
              }
            },
            {
              "answerOptions": [
                "At the zoo.",
                "At the traffic lights.",
                "At the end of the No. 9 bus."
              ],
              "correctAnswer": "At the zoo.",
              "variables": {
                "a": "Where will the woman change buses?"
              }
            }
          ]
        },
        {
          "text": "W: It's seven o'clock already, dear.\nM: Yes, I know. I decided to work during the evening rush hour.\nW: And so your dinner's cold. Why do you work so hard?\nM: I just start, and then I can't stop.\nW: You can stop any time. You don't need to keep on working at all.\nM: And then what could I do?\nW: We could move to Florida.\nM: Oh, Florida. Is it any better than New York?\nW: It's warm and sunny all year round. No more snow, no more ice.\nM: And what about the children and the grandchildren?\nW: They could come, and visit us every winter.\nM: And what would we do every spring, summer, and fall?\nW: A lot of our friends have moved to Florida. We know a lot of people there.\nM: Well, I'll think about it.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A policeman. Because he works hard.",
                "A postman. Because he often works late.",
                "A taxi driver. Because he often works through the evening rush hours."
              ],
              "correctAnswer": "A taxi driver. Because he often works through the evening rush hours.",
              "variables": {
                "a": "What do you think the man is? Why?"
              }
            },
            {
              "answerOptions": [
                "After the man finished his work.",
                "After they got up.",
                "Before they went out shopping."
              ],
              "correctAnswer": "After the man finished his work.",
              "variables": {
                "a": "When were they having this dialogue?"
              }
            },
            {
              "answerOptions": [
                "Colder.",
                "Wanner.",
                "Rains more."
              ],
              "correctAnswer": "Colder.",
              "variables": {
                "a": "How is the weather in New York compared with the weather in Florida?"
              }
            }
          ]
        },
        {
          "text": "W: Do you collect cola cans, Steve?\nM: No. Why do you ask?\nW: You have so many empty cans here.\nM: Well, my mum wants me to keep all the cans, so that we can sell them after a while.\nW: Aha, you are going to make a millionaire of yourself sooner or later with all those cans.\nM: You bet I will. Well, that's not the point. The point is we separate reusable things from other rubbish. We have to pay the dustman for dealing with rubbish, but if we sell him these cans and other reusable material we pay less.\nW: That sounds a clever idea. Now what are reused in China?\nM: Metal, plastic, paper, books and the like.\nW: Just as we do back home in the States.\nM: And to avoid waste, the government is limiting the production of goods that can be used only once, such as bamboo chopsticks. For example, all the fast food boxes should be made of paper instead of non-reusable material.\nW: That will surely be helpful for a clean environment.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "His mother collects them as a hobby.",
                "He wants to use them again.",
                "He wants to sell them to the dustman."
              ],
              "correctAnswer": "He wants to sell them to the dustman.",
              "variables": {
                "a": "Why does Steve keep empty cans?"
              }
            },
            {
              "answerOptions": [
                "Glass.",
                "Paper.",
                "Metal."
              ],
              "correctAnswer": "Paper.",
              "variables": {
                "a": "What is NOT mentioned as reusable in this dialogue?"
              }
            },
            {
              "answerOptions": [
                "The government limits the use of plastic.",
                "The government produces a lot of bamboo chopsticks.",
                "The government encourages the use of paper for fast food boxes."
              ],
              "correctAnswer": "The government encourages the use of paper for fast food boxes.",
              "variables": {
                "a": "What does the government do to avoid waste?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, Bob. I heard about your accident but I didn't think it would be this bad.\nM: Well, thanks for making me feel better.\nW: I can hardly recognize you. Tell me what happened.\nM: I just got back from Africa where I had a terrible accident in a motorcycle race. I broke both my legs when my motor failed and was hit by another motorcycle. I was laid up in a hospital over there for three weeks.\nW: Three weeks, that's a long time. What did you do while you were in the hospital?\nM: Well, if you can believe it, I read all about motorcycle racing. I love racing even if it hurts.\nW: But I'm afraid you don't make it look very funny. You're lucky to be alive.\nM: That's for sure. I am lucky to be alive.\nW: How soon can you get well? Did the doctor tell you about it?\nM: They say I still need to stay in bed for two weeks or so.\nW: I think you'll get a bit fatter by then. By the way, is there anything I can do for you?\nM: No, thank you. Thank you for the beautiful flowers. It's very kind of you to come to see me.\nW: I'll be going then. Bye.\nM: Bye.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He was badly ill.",
                "He had his legs broken.",
                "He was hit by a car."
              ],
              "correctAnswer": "He had his legs broken.",
              "variables": {
                "a": "What happened to Bob?"
              }
            },
            {
              "answerOptions": [
                "Three weeks ago.",
                "More than three weeks ago.",
                "Five weeks ago."
              ],
              "correctAnswer": "More than three weeks ago.",
              "variables": {
                "a": "When was Bob sent into hospital?"
              }
            },
            {
              "answerOptions": [
                "He read about motorcycle racing.",
                "He decided to give up motorcycle racing.",
                "He tried to become much fatter."
              ],
              "correctAnswer": "He read about motorcycle racing.",
              "variables": {
                "a": "What did Bob do while he was in hospital?"
              }
            }
          ]
        },
        {
          "text": "W: You look rather pale, Mr. Williams. Aren't you feeling well?\nM: It's nothing serious actually. I was sick most of the night. I didn't sleep very well.\nW: What seems to be the matter? Is it the flu?\nM: No, I think it's something I ate. We ate at that new restaurant last night, and I must have eaten something that didn't agree with me.\nW: Was it that new restaurant over on Fourth Street? Opened only two weeks ago?\nM: As a matter of fact, it was. Why do you ask?\nW: Because Jerry ate there last week and had the same kind of problem. He was sick the next day, too.\nM: That's interesting. Maybe the health authorities should look into the matter.\nW: That's what I think. Two people with similar problems in such a short time can't just be coincidence!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Yesterday afternoon.",
                "Last night.",
                "This morning."
              ],
              "correctAnswer": "Last night.",
              "variables": {
                "a": "When did the man begin to feel sick?"
              }
            },
            {
              "answerOptions": [
                "Dirty food.",
                "Lack of sleep.",
                "Too much alcohol."
              ],
              "correctAnswer": "Dirty food.",
              "variables": {
                "a": "What might cause the man's sickness?"
              }
            },
            {
              "answerOptions": [
                "It has caused great losses.",
                "It frightens people greatly.",
                "It has happened twice."
              ],
              "correctAnswer": "It has happened twice.",
              "variables": {
                "a": "Why does the woman think the matter should be looked into?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, Dave. Good to see you could come a long way. Come in.\nM: Wow. Looks like the party is at a high point.\nW: Yeah. And they're eating all of my food. Oh, I'd like you to meet my sister, Carol. She's visiting on the weekend.\nM: Oh. Which one is she?\nW: She's sitting on the sofa over there.\nM: You mean the woman with long black hair?\nW: That's right. Let me introduce her to you. You're both so friendly and adventurous.\nM: And who's the man sitting next to her? Uh, the man wearing the suit jacket?\nW: Oh, that's Bob, my ballet teacher.\nM: Ballet teacher! I never knew you could do ballet.\nW: I started about two months ago. Come on. I'd like you to meet them.\nM: I'm coming.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Colleagues.",
                "Neighbours.",
                "Friends."
              ],
              "correctAnswer": "Friends.",
              "variables": {
                "a": "What is the relationship between the two speakers?"
              }
            },
            {
              "answerOptions": [
                "Her sister.",
                "Her student.",
                "Her teacher."
              ],
              "correctAnswer": "Her sister.",
              "variables": {
                "a": "Who is visiting the woman on the weekend?"
              }
            },
            {
              "answerOptions": [
                "He has just been introduced to her.",
                "She has taken lessons from him.",
                "They have met at a party before."
              ],
              "correctAnswer": "She has taken lessons from him.",
              "variables": {
                "a": "How does the woman know Bob?"
              }
            }
          ]
        },
        {
          "text": "W: How long are you going to be at the gas station?\nM: I don't know for sure. Not long if they're not busy. Maybe an hour.\nW: Could you drop me off at the department store? I want to look at some shoes they advertised on sale.\nM: Sure. I'll probably go over to the stamp market and talk to Tim while they're fixing the car.\nW: Where should I meet you then?\nM: I can pick you up in an hour and a half in front of the drugstore. Is that okay?\nW: Fine with me. I'll see you then.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "To buy some stamps.",
                "To have his car fixed.",
                "To buy some drugs."
              ],
              "correctAnswer": "To have his car fixed.",
              "variables": {
                "a": "What is the man going to do?"
              }
            },
            {
              "answerOptions": [
                "The department store.",
                "The stamp market.",
                "The drugstore,"
              ],
              "correctAnswer": "The department store.",
              "variables": {
                "a": "Where will the woman go?"
              }
            },
            {
              "answerOptions": [
                "An hour later.",
                "An hour and a half later.",
                "Half an hour later."
              ],
              "correctAnswer": "An hour and a half later.",
              "variables": {
                "a": "When will the speakers meet?"
              }
            }
          ]
        },
        {
          "text": "W: Have you got any hobbies, Rod?\nM: Yes, Jessie. I'm fond of fishing, painting, stamp-collecting, and...\nW: Wow, so many! I just like taking photographs.\nM: In my family, everyone has more than one interest. My father likes to build things out of wood and collect baseball caps. He doesn't have time for many hobbies, because his job keeps him busy.\nW: How about your mother?\nM: In her spare time, she likes going to the gym. She also likes making things to decorate our home.\nW: Your sisters and brothers must like fashionable ones.\nM: I've one sister and one brother. My younger brother Alan is 17 years old. He likes singing, playing the piano and skiing. My sister Lisa is 12 years old. Her hobbies include making small things, playing the violin and riding her bicycle around the neighborhood.\nW: Your family has got a variety of interests.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Fishing.",
                "Collecting stamps.",
                "Taking photographs."
              ],
              "correctAnswer": "Taking photographs.",
              "variables": {
                "a": "What is the woman's hobby?"
              }
            },
            {
              "answerOptions": [
                "His father likes decorating his home.",
                "His mother likes going to the gym.",
                "Everyone in his family has three hobbies."
              ],
              "correctAnswer": "His mother likes going to the gym.",
              "variables": {
                "a": "What do we know about the man's family?"
              }
            },
            {
              "answerOptions": [
                "The man.",
                "Lisa.",
                "Alan."
              ],
              "correctAnswer": "Alan.",
              "variables": {
                "a": "Who likes playing the piano?"
              }
            }
          ]
        },
        {
          "text": "W: United Development Company. May I help you?\nM: I'd like to speak to Mr. Hailer, please.\nW: Who shall I say is calling, please?\nM: This is Mr. Dewey from the IM Company.\nW: I'm sorry, Mr. Dewey, but Mr. Halley is not in at the moment.\nM: When will he come in, do you know?\nW: I suppose he won't be in until 12: 00.\nM: May I leave a message?\nW: Certainly.\nM: Please ask him to give me a call as soon as he returns. He has my number.\nW: Very well, Mr. Dewey, I'll do that.\nM: Thank you. Bye-bye.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "By the radio.",
                "Between two friends.",
                "On the phone."
              ],
              "correctAnswer": "Between two friends.",
              "variables": {
                "a": "How does the conversation take place?"
              }
            },
            {
              "answerOptions": [
                "12: 00.",
                "13: 00.",
                "11: 00."
              ],
              "correctAnswer": "12: 00.",
              "variables": {
                "a": "When will Mr. Halley be in?"
              }
            },
            {
              "answerOptions": [
                "To meet him.",
                "To call his number.",
                "To have a dinner."
              ],
              "correctAnswer": "To have a dinner.",
              "variables": {
                "a": "What does the man ask Mr. Halley to do?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 2: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "W: What are the main differences between this country and your country?\nM: Well, in Russia, everything happens very fast. People talk quickly, they drive their cars too fast, the good deals go by really quickly...but here in Canada, it seems like people are a little more relaxed.\nW: Is that true for everything?\nM: No, of course not. In Russia, going to the bank can take hours. The same is true for the post office and the supermarket. In Canada, however, these places are pretty easy to get through quickly.\nW: So, what is it that makes some things go either faster or slower compared to us here in Canada? I was born and raised here, so I guess I don't notice these things. I've also never been outside the country before.\nM: I think the people in Russia are fast movers by nature, at least in the big cities. Public places are still very slow because they haven't tried to do business any differently than they used to.\nW: But in Canada, it's the opposite?\nM: Right. The government here does a great job of solving problems and using new technology to make businesses work better. But I think Canadians are just more calm in general than Russians are... and they're definitely more relaxed than Americans!\nW: Well, I agree with you about that last part!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In the United States.",
                "In Russia.",
                "In Canada."
              ],
              "correctAnswer": "In Canada.",
              "variables": {
                "a": "Where are the speakers now?"
              }
            },
            {
              "answerOptions": [
                "People talk quickly.",
                "The government solves problems well.",
                "Going to the bank often takes a short time."
              ],
              "correctAnswer": "People talk quickly.",
              "variables": {
                "a": "What happens in the man's country?"
              }
            },
            {
              "answerOptions": [
                "She wants to go to Russia.",
                "She has never been abroad before.",
                "She thinks Americans are more relaxed."
              ],
              "correctAnswer": "She has never been abroad before.",
              "variables": {
                "a": "What is true about the woman?"
              }
            }
          ]
        },
        {
          "text": "M: How can I help you, Miss?\nW: Could you break a 20-dollar bill for me?\nM: Sure. How do you want it?\nW: Could I have two 5's and the rest in 1's?\nM: Well, I have some 5's, but I don't have enough 1's. Are quarters fine with you?\nW: Oh, that's even better! In that case, I won't have to worry about the small change for the bus later.\nM: Here you go!\nW: Thanks a million!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Asking for some money in the street.",
                "Paying fares on a bus.",
                "Changing money in a bank."
              ],
              "correctAnswer": "Changing money in a bank.",
              "variables": {
                "a": "What is the woman doing?"
              }
            },
            {
              "answerOptions": [
                "1.",
                "2.",
                "3."
              ],
              "correctAnswer": "2.",
              "variables": {
                "a": "How many 5's will the woman be given?"
              }
            },
            {
              "answerOptions": [
                "Change buses.",
                "Change one million dollars.",
                "Take a bus."
              ],
              "correctAnswer": "Take a bus.",
              "variables": {
                "a": "What do you think the woman is going to do later?"
              }
            }
          ]
        },
        {
          "text": "W: Robbie, this new walkman is really wonderful.\nM: Richard and Marilyn bought it for me for my birthday.\nW: They are so kind. You are very lucky, Robbie, to have such a nice family.\nM: Is something wrong, Alexandra?\nW: No, nothing.\nM: Yes, there is. I can tell. What's the matter? Come on, you can tell me. What's up?\nW: I received a letter from my parents this morning. I miss them very much. The Molinas treat me so nicely and I like being with your family so much...but when I received the letter with photographs of my family, I cried.\nM: You really miss your family,don't you?\nW: Yes, I know I must seem silly. It's not like I have nobody. I like the Molinas very much, and they're so kind to me.\nM: Hey, why don't we go out for a hamburger and French fries? That'll cheer you up. And you can use my walkman.\nW: That's a good idea. But if you go out, please don't complain about your math teacher or your math homework, I want to have fun.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Richard and Alexandra.",
                "Richard and Marilyn.",
                "The Molinas."
              ],
              "correctAnswer": "Richard and Marilyn.",
              "variables": {
                "a": "Who bought the walkman for Robbie's birthday?"
              }
            },
            {
              "answerOptions": [
                "The Molinas didn't treat her nicely.",
                "The letter reminded her of her family.",
                "She had nobody to talk to."
              ],
              "correctAnswer": "The letter reminded her of her family.",
              "variables": {
                "a": "Why did Alexandra cry?"
              }
            },
            {
              "answerOptions": [
                "In a French restaurant.",
                "At Alexandra's home.",
                "At Robbie's home."
              ],
              "correctAnswer": "At Robbie's home.",
              "variables": {
                "a": "Where does the conversation most probably take place?"
              }
            }
          ]
        },
        {
          "text": "W: Robert, you play the guitar, don't you?\nM: I used to. But I haven't played it for quite some time. I don't really have time these days with all my studies. Why do you ask?\nW: I'm trying to organize a group to play at some parties on weekends. We still need a guitar player.\nM: Well, I don't know. But your idea sounds fun to me.\nW: Oh, it will be. I'm more or less in charge of things, so if you want to give it a try, you're in. It's as easy as that. Besides, it's a great chance to get out to meet people.\nM: But I told you I haven't practiced for a long time. I don't know if I remember any songs I used to play.\nW: Don't worry about it. I just thought I'd ask you to try and join us sometime when we were practicing. We'll be practicing for a few months before we give performances.\nM: OK, I'll have a try.\nW: I'm sure you can do it. And it will be fun, too.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A dancer.",
                "A singer.",
                "A student."
              ],
              "correctAnswer": "A student.",
              "variables": {
                "a": "What do you think Robert is?"
              }
            },
            {
              "answerOptions": [
                "At concert halls.",
                "At restaurants.",
                "At some parties."
              ],
              "correctAnswer": "At some parties.",
              "variables": {
                "a": "Where will the group perform?"
              }
            },
            {
              "answerOptions": [
                "He doesn't think he is good enough.",
                "He doesn't have time to practice.",
                "He isn't interested in joining it."
              ],
              "correctAnswer": "He doesn't have time to practice.",
              "variables": {
                "a": "Why is Robert not sure of joining the group?"
              }
            }
          ]
        },
        {
          "text": "M: Come in. Please have a seat.\nW: Thank you.\nM: I'm Paul Turner. Branch Manager.\nW: Katie Thomas, nice to meet you.\nM: I hear that you're looking for temporary office work.\nW: That's right.\nM: How old are you, Katie?\nW: Eighteen.\nM: That's rather young. What experience have you had?\nW: Well, I've just left school, in fact, and I'm looking for a job between now and when I go to college.\nM: It doesn't sound as if we can help, Katie. You see, our clients are very demanding, especially when it comes to new office technology.\nW: Oh, that's no problem. I took extra classes in office skills at school.\nM: Oh, perhaps you'd like to outline what you've been doing?\nW: I started by learning keyboard skills. Then I went in to learn about word processing.\nM: Good. You seem qualified from the technical point of view. But how well do you think you'll get along with people in an office?\nW: I think I'm quite adaptable. I belonged to the drama society, as well as working on the school magazine. And I played a bit of sports. So I'm used to working as part of a team.\nM: Sounds good. Let's see... There's a request from Johnson's Imports for \"a bright youngster...\" .\n{a}",
          "instances": [
            {
              "answerOptions": [
                "16.",
                "17.",
                "18."
              ],
              "correctAnswer": "18.",
              "variables": {
                "a": "How old is Katie?"
              }
            },
            {
              "answerOptions": [
                "A short-term job in an office.",
                "A full-time job at a college.",
                "A permanent job at Johnson's Imports."
              ],
              "correctAnswer": "A short-term job in an office.",
              "variables": {
                "a": "What kind of job is Katie looking for?"
              }
            },
            {
              "answerOptions": [
                "Her extra classes in sport at school.",
                "She has computer skills and used to working with people.",
                "She's adaptable."
              ],
              "correctAnswer": "She has computer skills and used to working with people.",
              "variables": {
                "a": "What qualifications does Katie have for the job?"
              }
            }
          ]
        },
        {
          "text": "M: Oh, who is the beautiful old woman in front of the house?\nW: That's my grandmother.\nM: Oh, then that must be your house in the background. Where is it?\nW: No, that's my grandmother's house. She lives in Kentucky. We live in Boston, about two and a half hours away by plane.\nM: Then, does she live with your uncle or aunt?\nW: No. Since her husband died, she has lived alone.\nM: Alone? But she is so old! Who takes care of her?\nW: She takes care of herself, though she is 81 this year and is beginning to slow down a little. She has a cleaning lady who comes for a few hours a week to clean house and help with the shopping.\nM: But isn't she lonely without family?\nW: Of course not. She has lived in the same neighborhood since she was first married, so she knows all the neighbors, young and old, and she has lots of friends.\nM: Why doesn't she live with you? Don't you miss her?\nW: Well,actually,we talk to her on the phone every week and visit her at least once a year, but we are busy with our lives and so is she. We love to have her visit, but we all know that if she lived with us, we might not get along so well.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She lives by herself.",
                "She's as healthy as before.",
                "She often does some cleaning."
              ],
              "correctAnswer": "She lives by herself.",
              "variables": {
                "a": "What do we know about the grandmother?"
              }
            },
            {
              "answerOptions": [
                "Since her husband died.",
                "Since she was married.",
                "Since her son moved away."
              ],
              "correctAnswer": "Since she was married.",
              "variables": {
                "a": "How long has the grandmother lived in Kentucky?"
              }
            },
            {
              "answerOptions": [
                "Being busy with housework.",
                "Being with relatives.",
                "Being with friends."
              ],
              "correctAnswer": "Being with friends.",
              "variables": {
                "a": "What does the grandmother enjoy about her present life?"
              }
            }
          ]
        },
        {
          "text": "M: Hi, are you being helped?\nW: No, I'm not. I'm interested in some gloves.\nM: All our gloves are here. What do you think of this pair here? It's made of silk.\nW: Hm, it looks nice, but I'd like to have something warm for the winter.\nM: Maybe you would like heavy wool gloves. How about this pair?\nW: I think that's what I want. How much is it?\nM: It's... forty dollars.\nW: It's a little expensive. Do you think it's possible to get a discount?\nM: Hm, since you like it so much, how about a 10 percent discount. That's the best I can offer.\nW: That's good.\nM: Is there anything else I can get for you, a pair of socks?\nW: No, that should be it. Thank you.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A pair of shoes.",
                "A pair of gloves.",
                "A pair of socks."
              ],
              "correctAnswer": "A pair of gloves.",
              "variables": {
                "a": "What is the woman looking for?"
              }
            },
            {
              "answerOptions": [
                "Forty dollars.",
                "Thirty-six dollars.",
                "Thirty dollars."
              ],
              "correctAnswer": "Thirty-six dollars.",
              "variables": {
                "a": "How much will the woman pay?"
              }
            },
            {
              "answerOptions": [
                "It's too expensive.",
                "It's made of wool.",
                "It's made of silk."
              ],
              "correctAnswer": "It's made of silk.",
              "variables": {
                "a": "Why does the woman NOT want the first pair?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, Gary. How handsome you are in the blue coat!\nM: Thank you. I'm very glad to hear that.\nW: I like your new coat very much. Where did you get it?\nM: Well, I got it from the department store where there are many clothes, from shirt to skirt, from jacket to coat.\nW: Oh. I know that store. Clothes there are expensive for me. How much did it cost you?\nM: Not as much as the saleswoman asked for. She wanted $90.\nW: So. how much did you pay for it in the end?\nM: I tried to make her bring down to half the price.\nW: Wow! How smart you are! In fact, I have been attracted by a cool hat in that store for a long time. Can you help me bring its price down?\nM: I'm not sure, but I can have a try.\nW: Then, thank you very much.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Red.",
                "Blue.",
                "Black."
              ],
              "correctAnswer": "Blue.",
              "variables": {
                "a": "What color is the man's coat?"
              }
            },
            {
              "answerOptions": [
                "180 dollars.",
                "90 dollars.",
                "45 dollars."
              ],
              "correctAnswer": "45 dollars.",
              "variables": {
                "a": "How much did the man pay for his coat?"
              }
            },
            {
              "answerOptions": [
                "A hat.",
                "A skirt.",
                "A shirt."
              ],
              "correctAnswer": "A hat.",
              "variables": {
                "a": "What does the woman want to buy?"
              }
            }
          ]
        },
        {
          "text": "W: Oh, look, who's here? Upon my word, if it isn't Mr. White. Oh, Mr. White, you shouldn't have come.\nM: That's all right. I was told the weather was not good enough.\nW: Yes, not ideal for flying.\nM: If it doesn't clear up soon, I'm afraid the flight might be put off.\nW: Let's hope for the best.\nM: Mrs. Smith, do you like traveling by air?\nW: For me there is nothing like traveling by air. It is both speedy and comfortable. Mr. White, there goes the announcement for passengers to board.\nM: Oh, good news for you. The plane will take off on time as it is clearing up.\nW: I think I must go now. Thank you for coming to see me off, Mr. White.\nM: It's a pleasure. Come again, I wish you a pleasant journey.\nW: Thank you. Good-bye.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Excited.",
                "Surprised.",
                "Sad."
              ],
              "correctAnswer": "Surprised.",
              "variables": {
                "a": "What does Mrs. Smith feel when she sees Mr. White?"
              }
            },
            {
              "answerOptions": [
                "Stormy.",
                "Fine.",
                "Rainy."
              ],
              "correctAnswer": "Fine.",
              "variables": {
                "a": "What will the weather be like probably?"
              }
            },
            {
              "answerOptions": [
                "She doesn't enjoy flying much.",
                "She thinks flight is often delayed because of the weather.",
                "She likes it."
              ],
              "correctAnswer": "She likes it.",
              "variables": {
                "a": "How does Mrs. Smith feel about traveling by air?"
              }
            }
          ]
        },
        {
          "text": "M: Welcome to Beijing, Mary. This time you will see the New Beijing.\nW: Thank you indeed.\nM: Is everything settled?\nW: Almost.\nM: What else can I do for you?\nW: I suppose I should look for a bigger house. But I don't see how I can afford one right now.\nM: If only you hadn't spent so much money on your vacation!\nW: You're right. But I really had a happy vacation.\nM: OK, Maybe you can move into Kelly's house and share that with her for a couple of months.\nW: Thank you. But I don't want to bother you too much.\nM: No trouble at all.\nW: How much should I pay for the rent?\nM: About 400 yuan a month.\nW: Great. That's one-third less than it was when I first rented a house.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She hasn't enough money at hand.",
                "She already spent all her money on her vacation.",
                "She will save some money to buy a new house."
              ],
              "correctAnswer": "She will save some money to buy a new house.",
              "variables": {
                "a": "Why cannot the woman rent a bigger house right now?"
              }
            },
            {
              "answerOptions": [
                "By borrowing some money from his friend.",
                "By renting a new house.",
                "By sharing a big house with her friend."
              ],
              "correctAnswer": "By sharing a big house with her friend.",
              "variables": {
                "a": "How can the woman solve the problem at present?"
              }
            },
            {
              "answerOptions": [
                "600 yuan a month.",
                "More than 1,200 yuan a month.",
                "400 yuan a month."
              ],
              "correctAnswer": "600 yuan a month.",
              "variables": {
                "a": "How much did the woman pay when she first rented a house?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 3: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "W: Today's November 15th. It's almost time for Thanks giving.\nM: When is Thanksgiving Day?\nW: It's celebrated on the fourth Thursday in November. What are your plans for it?\nM: I have no idea yet. What about you?\nW: The same as usual. My aunts and uncles and cousins come to our house for dinner.\nM: Oh, your family get together. What do you usually do?\nW: We usually have a big meal. My mother cooks turkey. But I prepare the vegetables. My aunts usually bring the pies. The women cook the meal, and the men wash the dishes.\nM: Really? In my family, when we get together the kids wash the dishes. The whole thing is a lot of work.\nW: Yes, but I like Thanksgiving. I was out of the country last year, and really missed it. That's one time in the year when families get together. John, if you haven't got any plans, why don't you come to my house to spend the holiday with us?\nM: Yes, that sounds like a good idea. Thanks a lot.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Her aunts and uncles.",
                "Her uncles and cousins.",
                "Her aunts and uncles and cousins."
              ],
              "correctAnswer": "Her aunts and uncles and cousins.",
              "variables": {
                "a": "Who spends the holiday with the women's family every year?"
              }
            },
            {
              "answerOptions": [
                "Vegetables.",
                "Pies.",
                "Turkey."
              ],
              "correctAnswer": "Turkey.",
              "variables": {
                "a": "What does the woman's mother usually cook?"
              }
            },
            {
              "answerOptions": [
                "The women.",
                "The kids.",
                "The men."
              ],
              "correctAnswer": "The kids.",
              "variables": {
                "a": "Who washes the dishes in John's family when they get together?"
              }
            }
          ]
        },
        {
          "text": "W: 4373811.\nM: Hello. Is that Jean?\nW: Yes, speaking.\nM: There is a really good film on at the cinema this week. It's called \"Sounds Forever\". Would you like to come and see it with me on Wednesday evening?\nW: No. I'm afraid I can't. I'm going to play at a concert at London University on Wednesday.\nM: What about Friday then?\nW: That would be great. Yes, I'd love to. What time does it start?\nM: At 7:00 pm. Would you like to go for a drink first?\nW: Yes, fine. Is six o'clock OK? We can meet outside the cinema.\nM: OK. See you on Friday then. Bye.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "On Wednesday morning.",
                "On Friday evening.",
                "On Wednesday evening."
              ],
              "correctAnswer": "On Friday evening.",
              "variables": {
                "a": "When are they going to meet?"
              }
            },
            {
              "answerOptions": [
                "A film star.",
                "A musician.",
                "A football player."
              ],
              "correctAnswer": "A musician.",
              "variables": {
                "a": "What is the probable job of the woman?"
              }
            },
            {
              "answerOptions": [
                "To see a film.",
                "To have dinner together.",
                "To enjoy a concert."
              ],
              "correctAnswer": "To see a film.",
              "variables": {
                "a": "What are they going to do?"
              }
            }
          ]
        },
        {
          "text": "W: I heard you got a new roommate. What's he like?\nM: Yeah, Bob moved in last week. He is a nice guy and so far everything is cool except his girlfriend.\nW: Oh? What's wrong with his girlfriend?\nM: She came to see him last weekend. She is a nice girl but there's something wrong with her voice. I tried to smile and be polite, but the whole time all I could think was \"what's wrong with her voice\".\nW: Well, I guess it might take some time to get used to.\nM: I doubt it. Listening to her talk is terrible.\nW: Oh, come on, it's not that bad.\nM: No, it's so much bad. And they invited me out to dinner tonight. I really have no idea how I'm going to pull it off.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A nice guy.",
                "A new roommate.",
                "Bob's girlfriend."
              ],
              "correctAnswer": "Bob's girlfriend.",
              "variables": {
                "a": "Who do you guess made the man unhappy?"
              }
            },
            {
              "answerOptions": [
                "Silent but angry.",
                "Polite.",
                "Excited and sorrowful."
              ],
              "correctAnswer": "Polite.",
              "variables": {
                "a": "What's the attitude the man tried to take towards the girl's voice?"
              }
            },
            {
              "answerOptions": [
                "The man's new roommate is a nice and polite girl.",
                "It will take some time for the man to get used to Bob's girlfriend's voice.",
                "The man doesn't know how to tolerate the girl's action."
              ],
              "correctAnswer": "It will take some time for the man to get used to Bob's girlfriend's voice.",
              "variables": {
                "a": "What can we learn from the conversation?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, Kangkang.\nM: Hi, Jane.\nW: What are you going to do this Saturday evening?\nM: I'm going to a concert.\nW: How exciting! Who is going to sing at the concert?\nM: Xu Song. He is my favorite pop singer.\nW: Where is he going to give the concert?\nM: In the gym.\nW: What time is it going to start?\nM: At 7:30 p. m. Would you like to go with me?\nW: I'd love to, but I'm going to visit my uncle.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "See a film.",
                "Go to a concert.",
                "Do sports."
              ],
              "correctAnswer": "Go to a concert.",
              "variables": {
                "a": "What is Kangkang going to do this Saturday evening?"
              }
            },
            {
              "answerOptions": [
                "In the gym.",
                "At the theater.",
                "At the Music Hall."
              ],
              "correctAnswer": "In the gym.",
              "variables": {
                "a": "Where will the concert be held?"
              }
            },
            {
              "answerOptions": [
                "Yes, she is.",
                "No, she isn't.",
                "No problem."
              ],
              "correctAnswer": "No, she isn't.",
              "variables": {
                "a": "Is Jane going to the concert?"
              }
            }
          ]
        },
        {
          "text": "M: It's lucky that we rode our bike here instead of driving.\nW: It's a good job that we got here early. Look at all those cars there. They'll never get in.\nM: You'd better follow me closely. I don't want to lose you.\nW: Don't worry. I'll keep up.\nM: We go in over there. Gate B. Peter said they're pretty good tickets.\nW: Where are they?\nM: They're right behind the goal.\nW: Oh,do we have to stand up all the time?\nM: That's right.\nW: I hope we can see the match clearly.\nM: That's why we've come early. The earlier, the better.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "By bike.",
                "By car.",
                "By taxi."
              ],
              "correctAnswer": "By bike.",
              "variables": {
                "a": "How did the two speakers get to their destination?"
              }
            },
            {
              "answerOptions": [
                "A film.",
                "A game.",
                "A car race."
              ],
              "correctAnswer": "A game.",
              "variables": {
                "a": "What are the two speakers going to watch?"
              }
            },
            {
              "answerOptions": [
                "To find Peter.",
                "To meet the players.",
                "To get a good place."
              ],
              "correctAnswer": "To get a good place.",
              "variables": {
                "a": "Why did the two speakers arrive early?"
              }
            }
          ]
        },
        {
          "text": "W: It was exactly two years ago that we moved to this town. You started working on your degree, and I started working down at the lab.\nM: It seems like only yesterday. I suppose that I am so busy that I don't even notice how time passes.\nW: I'd expect the opposite. I mean, the way you've been studying, working on experiments and writting dozens of papers. It might seem more like four years than two.\nM: Haven't you ever noticed how time seems to crawl when you have nothing to do? But how time flies when you are busy with what you really like to do?\nW: That's true. Those days when there was not much to do at the lab didn't ever seem to end.\nM: Just wait a little longer. As soon as I finish my degree, we'll open our own chemistry lab.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Husband and wife.",
                "Teacher and student.",
                "Mother and son."
              ],
              "correctAnswer": "Husband and wife.",
              "variables": {
                "a": "What's the probable relationship between the two speakers?"
              }
            },
            {
              "answerOptions": [
                "He is a writer.",
                "He is a student.",
                "He is a chemist."
              ],
              "correctAnswer": "He is a student.",
              "variables": {
                "a": "What does the man do?"
              }
            },
            {
              "answerOptions": [
                "Set up a lab.",
                "Write papers.",
                "Work on experiments."
              ],
              "correctAnswer": "Set up a lab.",
              "variables": {
                "a": "What will they probably do soon?"
              }
            }
          ]
        },
        {
          "text": "M: Someone has stolen my car! I want to report it. The name is Walton-Harry Walton.\nW: Where did you leave your car, Mr. Walton?\nM: In Ludlow Street. Near the traffic lights.\nW: Did you leave your car unlocked?\nM: Of course not.\nW: And what time was this?\nM: This morning. I parked it there before I went to work.\nW: When do you start work?\nM: At nine thirty. But I got in early today. I started at seven.\nW: That explains it.\nM: What do you mean?\nW: We have taken away your car. You can't park your car in Ludlow Street before ten on Friday.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "At 9: 30 a.m..",
                "After 9 a.m..",
                "Before 7 a. m.."
              ],
              "correctAnswer": "Before 7 a. m..",
              "variables": {
                "a": "When did the man park the car?"
              }
            },
            {
              "answerOptions": [
                "He broke a certain traffic rule.",
                "He stopped his car in the middle of the street.",
                "He didn't lock his car."
              ],
              "correctAnswer": "He broke a certain traffic rule.",
              "variables": {
                "a": "Why was the man's car taken away?"
              }
            },
            {
              "answerOptions": [
                "Friday.",
                "Weekend.",
                "We don't know."
              ],
              "correctAnswer": "Friday.",
              "variables": {
                "a": "What day was that day?"
              }
            }
          ]
        },
        {
          "text": "M: This book says that in some parts of Africa, men used to think that very fat women were beautiful. Before a woman married the chief, his servants used to keep her in a special house. Then they fed her all through the day and night for weeks before the wedding.\nW: Why did the women have this treatment?\nM: I don't know. The book says they used to consider it an honor to be the wife of the chief. The women used to become so fat that they could not walk. They used to crawl on their hands and knees instead.\nW: How terrible! I'm sure they wouldn't live for many years. Those women used to suffer a lot because of that custom. I'm glad that they don't do it now.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "The fatter, the more beautiful.",
                "The taller and stronger, the better.",
                "The thinner, the prettier."
              ],
              "correctAnswer": "The fatter, the more beautiful.",
              "variables": {
                "a": "What did some Africans use to think of beauty?"
              }
            },
            {
              "answerOptions": [
                "She was made up to be more beautiful.",
                "She was fed as much as possible to become fat.",
                "She was taken a walk with the chief."
              ],
              "correctAnswer": "She was fed as much as possible to become fat.",
              "variables": {
                "a": "How was a woman treated before marrying a chief?"
              }
            },
            {
              "answerOptions": [
                "She would not live long.",
                "She would enjoy her beauty.",
                "She would not stay with her husband."
              ],
              "correctAnswer": "She would not live long.",
              "variables": {
                "a": "What's the probable effect of the custom on the woman?"
              }
            }
          ]
        },
        {
          "text": "M: Hello, I have just seen your advertisement. You haven't rented it out yet, have you?\nW: No, I haven't. Come in and have a look.\nM: Thank you.\nW: It's just a simple room. My son used to live in it. Now he is grown and long gone, and my husband died last year. So I thought maybe I'd take in a roomer.\nM: A nice, quiet house. That's what I'm looking for.\nW: This way, Sir.\nM: Oh, this is a very pleasant room. How much is the rent?\nW: Fifty dollars a week. I won't charge you anything for electricity, gas and heat. Oh, yes, you can use the kitchen and refrigerator too.\nM: Well, I like this place very much. But, you know, my government doesn't give me much money. So you know what I mean.\nW: Oh, yes. You seem like a very nice young man. What about $ 40?\nM: That's good, Mrs. ...\nW: Price. Susan Price.\nM: My name is Wang Li. I've just come from China to study at the university.\nW: Oh, isn't that lovely?\nM: May I move in tomorrow morning. Mrs. Price.\nW: Fine. I'll be expecting you around ten. If you don't mind, I'd like to have the first two weeks' rent in advance.\nM: OK. I'll give it to you tomorrow morning. See you tomorrow.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Her husband's.",
                "Her son's.",
                "Her guestroom."
              ],
              "correctAnswer": "Her son's.",
              "variables": {
                "a": "Whose room does the woman want to rent out?"
              }
            },
            {
              "answerOptions": [
                "14 dollars.",
                "40 dollars.",
                "50 dollars."
              ],
              "correctAnswer": "40 dollars.",
              "variables": {
                "a": "How much per week will the man pay for the room?"
              }
            },
            {
              "answerOptions": [
                "A salesman.",
                "A university professor.",
                "A foreign student."
              ],
              "correctAnswer": "A foreign student.",
              "variables": {
                "a": "What is the man?"
              }
            }
          ]
        },
        {
          "text": "W: Good morning, sir.\nM: Good morning. I'd like to buy two tickets to New York, please.\nW: When do you want to leave, sir?\nM: Next Saturday.\nW: Just a moment. Yes, we still have some tickets.\nM: How much is a round trip ticket?\nW: Let me see ... 18,168 yuan.\nM: OK. I'd like two round trip tickets to New York. Here's my credit card.\nW: Thank you. May I have your name and passport number, sir?\nM: Michael Smith, passport number: P6363221 and Susan Smith, P6363220.\nW: Fine, and your phone number, please?\nM: 95396188.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Buy air tickets.",
                "Check his order for a flight.",
                "Ask about the price of air tickets."
              ],
              "correctAnswer": "Buy air tickets.",
              "variables": {
                "a": "What does the man want to do?"
              }
            },
            {
              "answerOptions": [
                "Next Sunday.",
                "Next Saturday.",
                "This Sunday."
              ],
              "correctAnswer": "Next Saturday.",
              "variables": {
                "a": "When does Mr. Smith plan to leave for New York?"
              }
            },
            {
              "answerOptions": [
                "A return ticket.",
                "Two tickets to New York.",
                "Two return tickets."
              ],
              "correctAnswer": "Two return tickets.",
              "variables": {
                "a": "What has Mr. Smith decided to have?"
              }
            }
          ]
        }
      ]
    }
  ]
}