{
  "courseId": "09d546de-90ce-4057-bc9d-d72cd7f8526b",
  "title": "Everyday English Course 26",
  "description": "Improve your English comprehension skills through short everyday conversations and situational dialogues.",
  "imageUrl": "/public/images/courses/end46c00-6746-4c45-a867-a8f08666a5c6.png",
  "totalSections": 3,
  "sections": [
    {
      "title": "Section 1: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "M: Hi, Jenny. Is it true you're moving to London?\nW: Yes, it is.\nM: What made you decide to do that?\nW: Work, mainly. I'm sure I'll be able to find a job there.\nM: You're probably right. But where are you going to live?\nW: I hope I'll find a flat to share with somebody. That way it will be cheaper.\nM: Yes, that's a good idea. Are you taking your dog with you?\nW: No, I don't think so. My parents have offered to take care of him, and I don't think he'd be happy in the city.\nM: You're probably right. But aren't you afraid of moving to such a big place, especially after living in a small village?\nW: Not really. I think I'll enjoy myself. There's so much to do there; I expect I won't miss the countryside much and I can always come back and visit.\nM: Well, I just hope you'll invite me to stay when you get settled.\nW: Of course I will.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "To find a nicer place to live in.",
                "To live together with her parents.",
                "To have a better job in a new place."
              ],
              "correctAnswer": "To have a better job in a new place.",
              "variables": {
                "a": "Why is the woman moving?"
              }
            },
            {
              "answerOptions": [
                "In a big city.",
                "In a small village.",
                "In a nearby country."
              ],
              "correctAnswer": "In a small village.",
              "variables": {
                "a": "Where do her parents live?"
              }
            },
            {
              "answerOptions": [
                "She can't take care of it.",
                "Her parents don't want her to take it.",
                "She thinks the dog might not be happy there."
              ],
              "correctAnswer": "She thinks the dog might not be happy there.",
              "variables": {
                "a": "Why doesn't the woman take her dog with her?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, are you Don? I'm Lynn. I saw the advertisement you put on the Internet about selling your car.\nM: Hi, Lynn. Nice to meet you. Thanks for your interest. Here's my car. It's a 2006 Honda Civic. I took a lot of road trips in it! It is not perfect, but it is safe to drive and it has new tires.\nW: Is anything broken?\nM: The radio is broken and the heater is broken, but the air conditioner works well.\nW: I think you should lower the price because the radio and the heater are broken. If you don't lower the price, I don't think I want to buy it.\nM: Sorry, but I'm not lowering the price. It's a very safe car, even if the radio is broken. Would you like to drive the car so you can see if you like it?\nW: No, thank you. I am worried something else is broken too.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In the newspaper.",
                "On a road trip.",
                "On the Internet."
              ],
              "correctAnswer": "On the Internet.",
              "variables": {
                "a": "Where did Lynn learn about the car?"
              }
            },
            {
              "answerOptions": [
                "It is not safe.",
                "The price is too high.",
                "It doesn't drive smoothly."
              ],
              "correctAnswer": "The price is too high.",
              "variables": {
                "a": "Why doesn't Lynn want to buy the car?"
              }
            },
            {
              "answerOptions": [
                "The tires.",
                "The radio.",
                "The air conditioner."
              ],
              "correctAnswer": "The radio.",
              "variables": {
                "a": "What needs to be replaced?"
              }
            }
          ]
        },
        {
          "text": "W: Hello. Milton Hotel. Can I help you?\nM: I want a reservation. Can I have it now?\nW: Of course. What kind of taste do you like for your dinner?\nM: I prefer Chinese dishes.\nW: Would you like to sit in a smoking section, a non-smoking section or an open one?\nM: A non-smoking section.\nW: I'm awfully sorry, but we haven't got the section left now. Would you like to wait for a while?\nM: Not at all. An open section will do, too.\nW: OK. See you then.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Waitress and customer.",
                "Manager and assistant.",
                "Employer and employee."
              ],
              "correctAnswer": "Waitress and customer.",
              "variables": {
                "a": "What is the probable relationship between the speakers?"
              }
            },
            {
              "answerOptions": [
                "A smoking section.",
                "A non-smoking section.",
                "An open section."
              ],
              "correctAnswer": "An open section.",
              "variables": {
                "a": "Which section will the man choose for the dinner?"
              }
            },
            {
              "answerOptions": [
                "A dinner.",
                "A reservation.",
                "Chinese food."
              ],
              "correctAnswer": "A reservation.",
              "variables": {
                "a": "What is the dialogue about?"
              }
            }
          ]
        },
        {
          "text": "M: You know these people who want to visit the company?\nW: Yes. You are meeting them next week, aren't you?\nM: Hum. Where should I take them, the office perhaps?\nW: I suppose you prefer this office because it is more comfortable.\nM: Well. I did think here, yes. But maybe the factory somewhere.\nW: I think they prefer to see where our products are made.\nM: OK, I'll meet them there.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "This week.",
                "Next month.",
                "Next week."
              ],
              "correctAnswer": "Next week.",
              "variables": {
                "a": "When will the man meet these people wanting to visit the company?"
              }
            },
            {
              "answerOptions": [
                "In the restaurant.",
                "In the office.",
                "In the factory."
              ],
              "correctAnswer": "In the office.",
              "variables": {
                "a": "Where does the conversation take place?"
              }
            },
            {
              "answerOptions": [
                "In the factory.",
                "In me office.",
                "In the man's home."
              ],
              "correctAnswer": "In the factory.",
              "variables": {
                "a": "Where does the man decide to meet these people?"
              }
            }
          ]
        },
        {
          "text": "W: Now,Mr. Martin. I've just read your own doctor's report. So you haven't been feeling very well lately, is that right?\nM: It's... it's my leg, doctor. My right leg. I keep getting a strange pain in it.\nW: Could you tell me what the pain is like?\nM: It's like... like boiling water running down my leg. It's been getting worse lately, too. I've been losing sleep.\nW: You mean the pain's been keeping you awake?\nM: Yes, that's right. It's been keeping me awake.\nW: Now, tell me, how long have you had this trouble?\nM: The pain? For about a year now.\nW: Hmm... Have you been getting tired lately after you have had a walk? For example, have you been getting a big short of breath, perhaps?\nM: Why, yes! Yes, I have, doctor!\nW: Hmm... I think we'd better give you a few tests here in the hospital.\nM: Do you think it's serious,doctor?\nW: Probably not.\nM: But... Doctor Cook, my local doctor, thinks it's only that I've been working too hard lately.\nW: That could be the reason. Don't worry, we'll find out soon.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Water is running down his leg.",
                "He can not breathe well after a walk.",
                "He hasn't been sleeping well because of the pain in his leg."
              ],
              "correctAnswer": "Water is running down his leg.",
              "variables": {
                "a": "What is NOT true about the man?"
              }
            },
            {
              "answerOptions": [
                "The woman doesn't know yet.",
                "He was burnt by boiling water.",
                "He has tired himself out in his work."
              ],
              "correctAnswer": "The woman doesn't know yet.",
              "variables": {
                "a": "What has caused the trouble?"
              }
            },
            {
              "answerOptions": [
                "Doctor Cook.",
                "Doctor Martin.",
                "The conversation doesn't tell us."
              ],
              "correctAnswer": "The conversation doesn't tell us.",
              "variables": {
                "a": "What's the woman's name?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, Bill. I haven't seen a film for half a year. Do you have some free time to go to the cinema with me this weekend?\nM: Sure. But I don't have any information about the recent films. What about you?\nW: Well, my workmate tells me that Harry Potter and the Sorcerer's Stone will be on.\nM: What's that?\nW: I don't know. It is said that kids like it a lot.\nM: Perhaps you can take our son there. It's boring for me to sit there for two hours.\nW: Oh, you're that kind of man. Um, a violent film called The Most Wanted will also be on at the same time. Maybe you can come with us.\nM: That's a clever idea. I like American films very much. We can go to the same cinema and come home together, but watch different films.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Husband and wife.",
                "Classmates.",
                "A teacher and his students."
              ],
              "correctAnswer": "Husband and wife.",
              "variables": {
                "a": "What's the relationship between the two speakers?"
              }
            },
            {
              "answerOptions": [
                "Quite often.",
                "Seldom.",
                "From time to time."
              ],
              "correctAnswer": "Seldom.",
              "variables": {
                "a": "How often do they go to the cinema?"
              }
            },
            {
              "answerOptions": [
                "Harry Potter and the Sorcerer's Stone.",
                "The Most Wanted.",
                "Both (A) and (B)."
              ],
              "correctAnswer": "Harry Potter and the Sorcerer's Stone.",
              "variables": {
                "a": "Which film will the woman see according to the talk?"
              }
            }
          ]
        },
        {
          "text": "M: Aw, Jane! What did you have to go and do that for?\nW: Do what?\nM: You know what I am taking about. Why did you go and tell Mrs. Wallace how much money I am going to make? Now she will go and tell the whole world!\nW: Well, I am sorry, Paul.\nM: Yeah, but you know she talks to everybody and their brothers.\nW: Well, I apologize. I guess I wasn't thinking. I got all excited.\nM: Oh, well, it's done now. I guess it doesn't matter that much, anyway. They will know in the end. Everyone in this town got a big nose.\nW: You know, it is really a lot of money for a first job...\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She told the others about his salary.",
                "She told Mrs. Wallace his salary.",
                "She always talks to everybody."
              ],
              "correctAnswer": "She told Mrs. Wallace his salary.",
              "variables": {
                "a": "Why was Paul angry with Jane?"
              }
            },
            {
              "answerOptions": [
                "Because she thought it doesn't matter.",
                "Because she knew everybody would know at last.",
                "Because she got too excited and wasn't thinking."
              ],
              "correctAnswer": "Because she got too excited and wasn't thinking.",
              "variables": {
                "a": "Why did Jane tell Mrs. Wallace the news according to her own explanation?"
              }
            },
            {
              "answerOptions": [
                "People in this town have big noses.",
                "People in this town are always eager to know about others' things.",
                "People don't care about each other."
              ],
              "correctAnswer": "People in this town are always eager to know about others' things.",
              "variables": {
                "a": "What does Paul mean by \"Everyone in this town got a big nose\"?"
              }
            }
          ]
        },
        {
          "text": "W: I can't decide whether to go to university or get a job. What's your opinion?\nM: Well, if I were you, I would go on studying.\nW: But I don't even know what to study.\nM: I advise you to major in economics.\nW: That's what my parents want me to do.\nM: You should take their advice. They know what's best for you. The more you learn, the better job you'll get.\nW: But my friends will have jobs and have a lot of fun while I'm spending all my time doing reading and writing.\nM: But if you go to university, you still have time for fun.\nW: What you say makes sense. I'll think it over. Thank you for your advice.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She can't find a suitable job.",
                "She can't decide whether to go to university or get a job.",
                "She wants to go to college but her parents don't agree."
              ],
              "correctAnswer": "She can't decide whether to go to university or get a job.",
              "variables": {
                "a": "What's the girl's trouble?"
              }
            },
            {
              "answerOptions": [
                "To start working at once.",
                "To wait until a proper job.",
                "To study economics at a university."
              ],
              "correctAnswer": "To study economics at a university.",
              "variables": {
                "a": "What do her parents want her to do?"
              }
            },
            {
              "answerOptions": [
                "Go to university.",
                "Look for a job.",
                "Study at home and depend on her parents."
              ],
              "correctAnswer": "Go to university.",
              "variables": {
                "a": "What might the girl do in the end?"
              }
            }
          ]
        },
        {
          "text": "W: There are pills for everything now, aren't there?\nM: Almost everything. There are pills for colds and pills for headaches.\nW: There are pills for seasickness and pills for airsickness.\nW: Those are the same, aren't they? Being sick on a ship is like being sick on a plane, isn't it?\nW: I suppose so. There are pills to make you sleepy.\nM: And there are pills to keep you awake.\nW: But they're bad for your health, aren't they?\nM: That's right.\nW: There is a pill to make you hungry, isn't there?\nM: I don't know. But there are pills to keep you from being hungry. They're for people who want to lose weight.\nW: There's a pill for almost everything, isn't there?\nM: But there aren't any pills to learn languages, are there?\n{a}",
          "instances": [
            {
              "answerOptions": [
                "There are pills to make you hungry.",
                "There are pills for seasick and homesick.",
                "There are pills for cold and headache."
              ],
              "correctAnswer": "There are pills for seasick and homesick.",
              "variables": {
                "a": "Which of the following is not mentioned?"
              }
            },
            {
              "answerOptions": [
                "Medicine is widely used in life.",
                "With medicine, you can do whatever you like.",
                "Medicine can also help us with learning language."
              ],
              "correctAnswer": "Medicine is widely used in life.",
              "variables": {
                "a": "What can we learn from the dialogue?"
              }
            },
            {
              "answerOptions": [
                "Yes.",
                "No.",
                "It's not clear."
              ],
              "correctAnswer": "It's not clear.",
              "variables": {
                "a": "Is there a pill to make somebody hungry?"
              }
            }
          ]
        },
        {
          "text": "M: (sniffing) Is that a French cigarette?\nW: Pardon?\nM: Is that a French cigarette you're smoking?\nW: Yes, that's right. Why? What's the matter?\nM: I don't understand why yousmoke French cigarettes. They make a terrible smell.\nW: I like them very much. I prefer them to English cigarettes.\nM: Have you got a lot of them?\nW: Yes, about 200, why?\nM: Well... er... could I buy some from you?\nW: Buy some from me? But... you don't like French cigarettes!\nM: No, I don't. But my wife does.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "The woman.",
                "The man.",
                "A new person."
              ],
              "correctAnswer": "The woman.",
              "variables": {
                "a": "Who is smoking a French cigarette?"
              }
            },
            {
              "answerOptions": [
                "He thinks they are too dear.",
                "He thinks they have a bad smell.",
                "He thinks he is going to like them."
              ],
              "correctAnswer": "He thinks they have a bad smell.",
              "variables": {
                "a": "Why doesn't the man like French cigarettes?"
              }
            },
            {
              "answerOptions": [
                "Yes, they both have 200 cigarettes.",
                "Yes, they both like French cigarettes.",
                "Yes, they are both married."
              ],
              "correctAnswer": "Yes, they both like French cigarettes.",
              "variables": {
                "a": "Do the woman and the man's wife have anything in common?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 2: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "W: Hello! 6896443.\nM: Hello! Is that Lucy?\nW: Speaking!\nM: Hi! This is Tom! Can I speak to Lily?\nW: Sorry. She isn't in at the moment. Can I take a message?\nM: Could you please tell her not to wait for me this evening? We planned to go to a party together, but something important came up and I have to rush off. I'll be back in Cairo at the beginning of next week.\nW: Right. I'll tell her. Are you leaving now?\nM: Yes, I leave at half past two. Please give my love to her. Thank you!\nW: You're welcome.\nM: Could you ask her to phone me when she gets in?\nW: Sure. You'd better give me your number.\nM: Yes, it's 13962-72854.\nW: OK. I've recorded it.\nM: Thanks very much indeed. Bye!\nW: Bye!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Because Lily is not at home.",
                "Because Tom will not be in Cairo.",
                "Because Tom will not be free."
              ],
              "correctAnswer": "Because Tom will not be in Cairo.",
              "variables": {
                "a": "Why can not Tom and Lily meet tonight?"
              }
            },
            {
              "answerOptions": [
                "2:15.",
                "2:30.",
                "2:00."
              ],
              "correctAnswer": "2:30.",
              "variables": {
                "a": "What time does the plane take off?"
              }
            },
            {
              "answerOptions": [
                "Teacher and student.",
                "Boss and employer.",
                "Boyfriend and girlfriend."
              ],
              "correctAnswer": "Boyfriend and girlfriend.",
              "variables": {
                "a": "What do we know about Tom and Lily?"
              }
            }
          ]
        },
        {
          "text": "W: This is a lovely house!\nM: Thank you, Jean.\nW: It's very close to your office, isn't it?\nM: Yes, it is. I always walk to work-even when it rains.\nW: I usually take the bus. It takes so long!\nM: How long does it take?\nW: Oh, it takes about 45 minutes.\nM: That's a long time. Well, have some pizza, please!\nW: (Taking a bite.) This is delicious! Do you bake all of your pizza?\nM: Yes, I usually bake something on the weekend or holidays.\nW: You are a wonderful cook!\nM: Thank you.\nW: I never cook at home. It is my husband Andy who usually does all the cooking.\nM: Do you often go out to eat?\nW: Yes, when he doesn't have time to cook, we will go out to eat somewhere.\nM: There are some wonderful restaurants in the city.\nW: Too many! You can eat at a different restaurant every day.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She loves cooking very much.",
                "She often eats in restaurants.",
                "She doesn't like the baked pizza."
              ],
              "correctAnswer": "She often eats in restaurants.",
              "variables": {
                "a": "What do we know about the woman?"
              }
            },
            {
              "answerOptions": [
                "About 14 minutes.",
                "About 20 minutes.",
                "About 45 minutes."
              ],
              "correctAnswer": "About 45 minutes.",
              "variables": {
                "a": "How long does it take Jean to go to work by bus?"
              }
            },
            {
              "answerOptions": [
                "On foot.",
                "By bus.",
                "By bike."
              ],
              "correctAnswer": "On foot.",
              "variables": {
                "a": "How does the man go to work?"
              }
            }
          ]
        },
        {
          "text": "M: Hello? Um, can I get some help over here?\nW: Sure thing. What'll it be?\nM: A menu, please.\nW: We don't serve food - just the beers you see on the wall.\nM: All right. What about that one? It's German, right?\nW: Yeah, it is. Is that what you'd like?\nM: Sure, that'll do. But I'd like a cold one if you've got one.\nW: Sure thing, sweetie. That'll be $6.25.\nM: Say, you're kinda friendly, aren't you?\nW: I suppose it comes with the job. It pays to be nice to people, don't you think?\nM: I suppose it does. That's what my mother said to me anyway. Oh, wait. Wait a second. Oh, no. I can't believe this!\nW: What's wrong?\nM: I think I left my wallet somewhere.\nW: It's gotta be around here. Maybe on the floor?\nM: No. It's not there. I don't know where it could be. Any chance you can be nice and give me that beer for free?\nW: No chance of that happening. If no one's paying, I'm not so nice.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He is ordering a drink.",
                "He is serving customers.",
                "He is buying things at a store."
              ],
              "correctAnswer": "He is ordering a drink.",
              "variables": {
                "a": "What is the man doing in the conversation?"
              }
            },
            {
              "answerOptions": [
                "One should pay others for the work they do.",
                "One should do his job well.",
                "Being nice has rewards."
              ],
              "correctAnswer": "Being nice has rewards.",
              "variables": {
                "a": "What did the man's mother teach him?"
              }
            },
            {
              "answerOptions": [
                "She's sweet.",
                "She's friendly.",
                "She's not very nice."
              ],
              "correctAnswer": "She's friendly.",
              "variables": {
                "a": "What does the man say about the woman?"
              }
            }
          ]
        },
        {
          "text": "W: So how long have you been living in London?\nM: Er, a couple of years. How long have you been working here?\nW: Only a few months. I moved down here for the job. There was no work for me where I came from.\nM: Where did you come from then?\nW: I came from a small village called Arnside near Lancaster a year ago. There was nothing there. So I moved to London.\nM: Do you enjoy working here in this restaurant?\nW: Very much so.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "One year.",
                "A few years.",
                "A couple of months."
              ],
              "correctAnswer": "A few years.",
              "variables": {
                "a": "How long has the man been in London?"
              }
            },
            {
              "answerOptions": [
                "To lead a city life.",
                "To open a restaurant.",
                "To find a job."
              ],
              "correctAnswer": "To find a job.",
              "variables": {
                "a": "Why did the woman leave her hometown?"
              }
            },
            {
              "answerOptions": [
                "London.",
                "Arnside.",
                "Lancaster."
              ],
              "correctAnswer": "Arnside.",
              "variables": {
                "a": "Where did the woman come from?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, Mike. What have you been up to?\nM: Not much. I started exercising.\nW: Trying to get in shape?\nM: Yeah, and I need to start improving my health.\nW: Me, too. What are you doing besides exercising?\nM: That's about all.\nW: I think if you eat better, it will also help a lot.\nM: Sleep is important, too. I heard people who sleep an average of eight hours a day have less health problems.\nW: Looks like there are a lot of things to do to stay healthy.\nM: True. But I think it is worth it. When you get older, you want to be healthy and active.\nW: Absolutely.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Exercising.",
                "Eating well.",
                "Sleeping well."
              ],
              "correctAnswer": "Exercising.",
              "variables": {
                "a": "What is the man doing to keep fit?"
              }
            },
            {
              "answerOptions": [
                "2.",
                "3.",
                "4."
              ],
              "correctAnswer": "3.",
              "variables": {
                "a": "How many ways to keep fit are mentioned?"
              }
            },
            {
              "answerOptions": [
                "They haven't seen each other for a long time.",
                "They will exercise together soon.",
                "They both consider health important in their lives."
              ],
              "correctAnswer": "They both consider health important in their lives.",
              "variables": {
                "a": "What can we learn from the conversation?"
              }
            }
          ]
        },
        {
          "text": "W: David, we shouldn't sit here doing nothing.\nM: Why not? It's Saturday afternoon, isn't it?\nW: Yes, but there's so much to do around the house.\nM: It can wait.\nW: We ought to finish washing down the kitchen walls and cupboards.\nM: We can do that tomorrow. We don't have to do it today.\nW: All right. That's a good idea.\nM: Talking about washing down the kitchen-where's Bob?\nW: He's having lunch with Georgia.\nM: What! Again?\nW: He should be back soon.\nM: He shouldn't spend so much time with that girl.\nW: You must be patient, David. Nineteen's a very difficult age, you know?\nM: Yes, I know. But he ought to be studying more.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In the morning.",
                "In the afternoon.",
                "In the evening."
              ],
              "correctAnswer": "In the afternoon.",
              "variables": {
                "a": "When does the conversation take place?"
              }
            },
            {
              "answerOptions": [
                "Paint the walls.",
                "Move the cupboards.",
                "Wash down the kitchen."
              ],
              "correctAnswer": "Wash down the kitchen.",
              "variables": {
                "a": "What do the two speakers plan to do tomorrow?"
              }
            },
            {
              "answerOptions": [
                "In a restaurant.",
                "In his bedroom.",
                "In the kitchen."
              ],
              "correctAnswer": "In a restaurant.",
              "variables": {
                "a": "Where is Bob now?"
              }
            }
          ]
        },
        {
          "text": "M: So, tell me, what's the one thing that really makes you unhappy about modem technology?\nW: I'm happy to get a chance to speak out. I know that a lot of people like the convenience of cell phones, but I find them truly irritating. People don't seem to know when to leave them at home. I hate it when people use their cell phones in a restaurant or a store. It's probably none Of my business, but it drives me crazy. One night in a movie theater, some cell phone began to ring and a guy behind me began to have a conversation right there during the movie. And the people who talk on the phone while they drive, well, they're putting the rest of us in danger, aren't they? There should be a law against it.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Modern technology.",
                "Dangerous driving.",
                "Behaviors in the theatcr."
              ],
              "correctAnswer": "Modern technology.",
              "variables": {
                "a": "What are the speakers talking about?"
              }
            },
            {
              "answerOptions": [
                "That she gets a chance to speak out.",
                "People like the convenience of cell phones.",
                "The way people use their cell phones in public places."
              ],
              "correctAnswer": "The way people use their cell phones in public places.",
              "variables": {
                "a": "What makes the woman unhappy about?"
              }
            },
            {
              "answerOptions": [
                "She believes the guy's phone rang behind her.",
                "She believes that law is needed.",
                "She believes she is in danger."
              ],
              "correctAnswer": "She believes that law is needed.",
              "variables": {
                "a": "What do we know about the woman?"
              }
            }
          ]
        },
        {
          "text": "M: Where are you going for your holiday this year, Jane?\nW: Florida.\nM: Great! How long are you going to stay there?\nW: One week. Just for Christmas time.\nM: Have you got any friends there?\nW: No. I have always wanted to go, but I've been too busy. Now I've got a week's holiday, and I can enjoy Christmas special prices. My dream will come true.\nM: Lovely! I guess you will certainly go to Disneyland.\nW: You are right. You have been there, haven't you?\nM: Yes, but just a couple of days.\nW: Tell me something about it, will you?\nM: There are so many things to see in the park. It has several main sections. They are named Main Street, Frontier Land, Fantasy Land, Tomorrow Land and Adventure Land. The park is often called a \"Magic Kingdom\".\nW: It must be an unforgettable experience for you.\nM: That's true, especially the Magic Mountain and Fantasy Land. I'm sure you'll enjoy your visit too.\nW: Thank you. I believe so.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Only one day.",
                "Two or three days.",
                "For Christmas time."
              ],
              "correctAnswer": "For Christmas time.",
              "variables": {
                "a": "How long will Jane stay in Florida?"
              }
            },
            {
              "answerOptions": [
                "He has been to Disneyland.",
                "He has read a book about Disneyland.",
                "He has seen a film introduction to Disneyland."
              ],
              "correctAnswer": "He has been to Disneyland.",
              "variables": {
                "a": "What can be concluded about the man?"
              }
            },
            {
              "answerOptions": [
                "Four.",
                "Five.",
                "Six."
              ],
              "correctAnswer": "Five.",
              "variables": {
                "a": "How many sections is Disneyland made up of?"
              }
            }
          ]
        },
        {
          "text": "W: Hi, Jack. Who are you writing to?\nM: I'm writing to my parents telling them I'll stay here this summer.\nW: You're not going home? I thought you were going on a trip to Japan with your family.\nM: Well, I intended to go with them, but I thought again and changed my mind.\nW: Tell me. I'm interested in knowing what keeps you from joining your beloved family and staying here. It certainly is not studying.\nM: No, certainly not. Michael arranged for me to work at his uncle's institution.\nW: How much will you be paid?\nM: Judy, I don't do it for money, but for experience. Besides, it's voluntary work.\nW: You work without payment? That's really something.\nM: When will you leave for home?\nW: Tomorrow. We'll fly to Hawaii two days after. I really have to pack now.\nM: Go then. Have a nice vacation!\nW: I'll send you postcards.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In Japan.",
                "In Hawaii.",
                "At his university."
              ],
              "correctAnswer": "At his university.",
              "variables": {
                "a": "Where will the man stay for the summer?"
              }
            },
            {
              "answerOptions": [
                "To prepare for his exams.",
                "To do some voluntary work.",
                "To earn money for his tuition."
              ],
              "correctAnswer": "To do some voluntary work.",
              "variables": {
                "a": "What's the man going to do?"
              }
            },
            {
              "answerOptions": [
                "In a day.",
                "In two days.",
                "In three days."
              ],
              "correctAnswer": "In three days.",
              "variables": {
                "a": "How soon will the woman get to her destination?"
              }
            }
          ]
        },
        {
          "text": "M: Hey, I'm calling to say that I'm running late to the airport. Can you make sure that the plane doesn't take off without me?\nW: I'll try.\nM: Thank you. I'm just sitting here in traffic. There must be an accident or something. I've been here for 30 minutes, and I've barely made it onto the bridge.\nW: Oh, that's not good.\nM: This traffic is really stressing me out. I don't want to have to take a later flight!\nW: I'm sure you'll be able to make it. The plane doesn't leave for another 2 hours.\nM: Yes, but Google Maps is telling me that I won't be at the airport for another hour and 45 minutes, which means I'll only have 15 minutes to check my bags, get through security, and arrive at the gate. That's impossible!\nW: You can ask to skip to the head of the line in security. They're usually pretty good about that when you think you might miss your flight.\nM: I hope so.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He's stuck in traffic.",
                "He had an accident.",
                "He didn't make it onto the bridge in time."
              ],
              "correctAnswer": "He's stuck in traffic.",
              "variables": {
                "a": "Why will the man be late?"
              }
            },
            {
              "answerOptions": [
                "In 45 minutes.",
                "In two hours.",
                "In 30 minutes."
              ],
              "correctAnswer": "In two hours.",
              "variables": {
                "a": "When is the plane scheduled to leave?"
              }
            },
            {
              "answerOptions": [
                "Positive.",
                "Stressed out.",
                "Apologetic."
              ],
              "correctAnswer": "Stressed out.",
              "variables": {
                "a": "How does the man probably feel?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 3: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "W: Did you go out today?\nM: With my bad luck? What good would it have done if I'd gone out?\nW: If you'd looked for a job,you might have found one.\nM: But I've been looking for one over a year. Today wouldn't have been any different.\nW: I know how bad you feel, but if you don't keep on looking, you'll never get a job.\nM: If I'd stayed in Puerto Rico in the first place, I wouldn't have had so much trouble.\nW: What would you have done? There are more people out of work there than there are here.\nM: I could have had a farm of my own if I'd stayed there.\nW: You? Up the mountains, with nobody to talk to, but the children?\nM: I don't like the city. There are too many people. There's too much noise, too much dust.\nW: I like here.\nM: Yes, because your brother's here. This is really your home.\nW: Well, maybe we should go to Puerto Rico for a visit anyway. You could see Andis Nanco.\nM: You really mean that? I'd like to see the island again and feel the sunshine and here everyone's speaking Spanish.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He is out of work.",
                "He isn't used to the life there.",
                "He has nobody else to talk to."
              ],
              "correctAnswer": "He is out of work.",
              "variables": {
                "a": "Why does the man feel bad?"
              }
            },
            {
              "answerOptions": [
                "Disappointing.",
                "Exciting.",
                "Encouraging."
              ],
              "correctAnswer": "Encouraging.",
              "variables": {
                "a": "In what way is the woman speaking to the man?"
              }
            },
            {
              "answerOptions": [
                "To look for a job together.",
                "To have a visit.",
                "To move to the island."
              ],
              "correctAnswer": "To have a visit.",
              "variables": {
                "a": "According to the dialogue,what is their last decision?"
              }
            }
          ]
        },
        {
          "text": "W: Can I help you?\nM: Yes, please. I'd like some oranges.\nW: Do you want Florida or California oranges?\nM: Which do you think are better?\nW: Florida oranges are sweet but they are small. But California oranges have no seeds.\nM: Then give me five California oranges.\nW: Anything else?\nM: I also want some bananas. How do you sell them?\nW: One dollar a pound. How many do you want?\nM: Give me four and see how much they are.\nW: They are just one pound.\nM: Good. How much do I owe you?\nW: Three dollars.\nM: Here you are.\nW: Thank you.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "They are sour.",
                "They are small.",
                "They have no seeds."
              ],
              "correctAnswer": "They have no seeds.",
              "variables": {
                "a": "What do we know about California oranges?"
              }
            },
            {
              "answerOptions": [
                "Four.",
                "Five.",
                "Nine."
              ],
              "correctAnswer": "Four.",
              "variables": {
                "a": "How many bananas does the man buy?"
              }
            },
            {
              "answerOptions": [
                "One dollar.",
                "Two dollars.",
                "Three dollars."
              ],
              "correctAnswer": "Two dollars.",
              "variables": {
                "a": "How much are the oranges?"
              }
            }
          ]
        },
        {
          "text": "M: I'd like to add some Chinese traditional elements in the decoration of my new house.\nW: That's great! I like this style very much. And I think if you want to embody the Chinese elements, you should use the red color. It is the most representative color in China, and sometimes it is called \"Chinese Red\".\nM: Oh, yes, I agree with you. And as for the door and the windows, I also like to use lattice. I think it is the most important elements of Chinese decorating.\nW: Yes. I think you have a good understanding of the Chinese style. And I suggest you'd better hang two Chinese landscape paintings.\nM: Oh. That's a good idea. I will buy them in the afternoon. And I'd like to paint the walls again and buy a new sofa.\nW: What color do you want to paint?\nM: I don't know exactly, but I'd like to use fresh colors. I think these colors look vivid.\nW: What about the sofa?\nM: I have no idea about it.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Tomorrow.",
                "This weekend.",
                "Today."
              ],
              "correctAnswer": "Today.",
              "variables": {
                "a": "When will the man buy the paintings?"
              }
            },
            {
              "answerOptions": [
                "Yellow.",
                "Brown.",
                "Black."
              ],
              "correctAnswer": "Yellow.",
              "variables": {
                "a": "What kind of color will the walls probably be?"
              }
            },
            {
              "answerOptions": [
                "He is decorating his new house.",
                "He will buy a red sofa.",
                "He is a Chinese."
              ],
              "correctAnswer": "He is decorating his new house.",
              "variables": {
                "a": "What do we know about the man?"
              }
            }
          ]
        },
        {
          "text": "W: Good morning, Blackwood Sports Club. Can I help you?\nM: Yes, I would like to order a set of golf clubs, please. Can you deliver them to my house?\nW: Yes, certainly. Just let me get the order form here and I'll take down your information. Can I have your name please?\nM: Bill White.\nW: And your membership number?\nM: It's G, 844-9192.\nW: Thank you. Now where would you like the golf clubs delivered?\nM: 89 Sea Road, Swansea.\nW: And could I get your email address and phone number please?\nM: My email address is bwhite@uk.net. My office number is 0782-403583 and you can reach me at home at 0782-624989.\nW: 0782-624989. Thank you.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A set of golf clubs.",
                "A pair of golf gloves.",
                "Some golf balls."
              ],
              "correctAnswer": "A set of golf clubs.",
              "variables": {
                "a": "What does the man want?"
              }
            },
            {
              "answerOptions": [
                "To his office.",
                "To his house.",
                "To his club."
              ],
              "correctAnswer": "To his house.",
              "variables": {
                "a": "Where does he want them to be delivered?"
              }
            },
            {
              "answerOptions": [
                "0782-403583",
                "0782-624989",
                "0782-449192"
              ],
              "correctAnswer": "0782-403583",
              "variables": {
                "a": "What's his office number?"
              }
            }
          ]
        },
        {
          "text": "M: Before making out a plan for sightseeing trips for you, I'd be glad to know if you have anything special in mind that you'd like to see.\nW: Well, as a matter of fact, we were discussing this question last night. We all spoke of the Great Wall, one of the seven wonders of the world. We wouldn't want to leave China without seeing that. If it could possibly be arranged, how far is it from here?\nM: Only about 50 kilometers. Just an hour and a half's trip by car. We'll put down at the Great Wall then.\nW: Good! And we've heard quite a lot about the Summer Palace. We'd like to see that, too.\nM: All right, the Summer Palace, well, and there are a number of places that I think you'd find interesting, the Temple of Heaven, the Former Imperial Palaces and the Ming Tombs.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A teacher.",
                "A tour guide.",
                "A driver."
              ],
              "correctAnswer": "A tour guide.",
              "variables": {
                "a": "What does the man most possibly do?"
              }
            },
            {
              "answerOptions": [
                "The Summer Palace and the Great Wall.",
                "The Summer Palace and the Ming Tombs.",
                "The Great Wall and the Temple of Heaven."
              ],
              "correctAnswer": "The Summer Palace and the Great Wall.",
              "variables": {
                "a": "Where does the woman specially want to visit?"
              }
            },
            {
              "answerOptions": [
                "Half an hour.",
                "One hour.",
                "One and a half hours."
              ],
              "correctAnswer": "One and a half hours.",
              "variables": {
                "a": "How long does it take to go to the Great Wall by car from where they are?"
              }
            }
          ]
        },
        {
          "text": "M: What's that book you just picked up, Mary?\nW: The one Prof. Lee uses inhis course.\nM: Oh, I see. You'd better have it if you want to pass that course.\nW: But it costs $30. I simply can't afford it.\nM: Did you check the used booksection here? Maybe they have it.\nW: No, they don't. I asked.\nM: Why don't you get it fromthe library?\nW: I've been trying for months, and it's always out. There are over 50 students in the course, and every single one wants the book.\nM: Listen, you know my roommate Henry, don't you? He took the same course last year, and I remember he owns a copy. Ican borrow it from him for you.\nW: Oh, that'll be great! Thankyou, Jim!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "School friends.",
                "Teacher and student.",
                "Librarian and library user."
              ],
              "correctAnswer": "School friends.",
              "variables": {
                "a": "What is the probable relationship between the speakers?"
              }
            },
            {
              "answerOptions": [
                "It's sold at a discount price.",
                "It's important for her study.",
                "It's written by Professor Lee."
              ],
              "correctAnswer": "It's important for her study.",
              "variables": {
                "a": "Why does Jim suggest Mary buy the book?"
              }
            },
            {
              "answerOptions": [
                "Share his book with her.",
                "Lend her some money.",
                "Ask Henry for help."
              ],
              "correctAnswer": "Ask Henry for help.",
              "variables": {
                "a": "What will Jim do for Mary?"
              }
            }
          ]
        },
        {
          "text": "M: When are you leaving?\nW: I'm leaving on Sunday night.\nM: What's your schedule?\nW: I arrive in Wellington on Monday, attend a conference there on Tuesday, and leave for Brisbane early Wednesday morning.\nM: How long will you stay there?\nW: I'll see our new agent Mr. Graig there on Thursday. I'm free on Friday, but I'm catching the 10 o'clock plane on Saturday to go to the fair in Sydney.\nM: You've got a full schedule.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "On Monday.",
                "On Tuesday.",
                "On Wednesday."
              ],
              "correctAnswer": "On Wednesday.",
              "variables": {
                "a": "When will the woman leave for Brisbane?"
              }
            },
            {
              "answerOptions": [
                "Meet Mr. Graig.",
                "Go to a fair.",
                "Attend a conference."
              ],
              "correctAnswer": "Meet Mr. Graig.",
              "variables": {
                "a": "What will she do on Thursday?"
              }
            },
            {
              "answerOptions": [
                "In Brisbane.",
                "In Wellington.",
                "In Sydney."
              ],
              "correctAnswer": "In Sydney.",
              "variables": {
                "a": "Where is the fair?"
              }
            }
          ]
        },
        {
          "text": "M: It's a beautiful day, isn't it?\nW: Yes, nice and sunny.\nM: It's much better than last week. It was too warm then.\nW: I'm glad summer is over. I like autumn best.\nM: So do I. It's neither too hot nor too cold. The sky is clear and blue.\nW: It's a good time to have a picnic. Do you want to have one this weekend.\nM: I'd love to, but I think it's going to rain. The weatherman said it will.\nW: I don't think he's right. It hasn't rained for a week.\nM: But he is usually right in his weather news.\nW: I'm sure we'll have fine weather for our picnic.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Nice and sunny.",
                "Too warm.",
                "Neither hot nor cold."
              ],
              "correctAnswer": "Too warm.",
              "variables": {
                "a": "What was the weather like last week?"
              }
            },
            {
              "answerOptions": [
                "Summer.",
                "Winter.",
                "Autumn."
              ],
              "correctAnswer": "Autumn.",
              "variables": {
                "a": "What season is it now?"
              }
            },
            {
              "answerOptions": [
                "He thinks it'll rain.",
                "He doesn't think it'll rain.",
                "He thinks it'll be cloudy."
              ],
              "correctAnswer": "He thinks it'll rain.",
              "variables": {
                "a": "What does the man think the weather will be like this weekend?"
              }
            }
          ]
        },
        {
          "text": "W: I want to have my hair done. Do you have any suggestions?\nM: You can take a look at this magazine. It has some of the newest styles.\nW: Er, I like face style. It's pretty. Do you think it suits me?\nM: Well, do you really want to keep your hair that long? I think you will look better with short hair.\nW: I'll leave that out to you. I'm ready for a change.\nM: Do you want to change the color of your hair? It will be shinier in wine red and will light up your face.\nW: Yeah, I believe so. But would that do much harm to my hair?\nM: Not really. We have some of the best hair care products.\nW: Em, maybe on other day. By the way, how much do you charge?\nM: 80 dollars in total.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A magazine.",
                "Hair care products.",
                "A bottle of red wine."
              ],
              "correctAnswer": "A magazine.",
              "variables": {
                "a": "What does the man show the woman?"
              }
            },
            {
              "answerOptions": [
                "Long.",
                "Short.",
                "Shoulder-length."
              ],
              "correctAnswer": "Short.",
              "variables": {
                "a": "How will the woman's hair look?"
              }
            },
            {
              "answerOptions": [
                "She thinks it's too expensive.",
                "She's afraid it might damage her hair.",
                "She doesn't like the suggested color."
              ],
              "correctAnswer": "She's afraid it might damage her hair.",
              "variables": {
                "a": "Why doesn't the woman want to change the color of her hair?"
              }
            }
          ]
        },
        {
          "text": "M: Excuse me. Do you know where Davies Auditorium is?\nW: I'm not sure. I'm looking for it too because I have a class there at 10:30. I think it's this way.\nM: Do you mind if I walk with you?\nW: No. What class do you have in Davies?\nM: I'm taking the introductory economics class. I hear it's a big class.\nW: Yes. My roommate took the class last semester and she said there were over 400 people in the lecture hall.\nM: Wow. I hope the lecturer is good, because, if he isn't, the class will be boring. I hate boring classes!\nW: Oh, look. Here's Davies. I hope you have a good class. Hope it's not too boring!\nM: Yes, me too. Thanks for your help.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Advanced economics.",
                "Introductory economics.",
                "Advanced physics."
              ],
              "correctAnswer": "Introductory economics.",
              "variables": {
                "a": "What class is the man trying to find?"
              }
            },
            {
              "answerOptions": [
                "Walking on campus.",
                "Waiting in a dormitory lounge.",
                "Eating at a dinning hall."
              ],
              "correctAnswer": "Walking on campus.",
              "variables": {
                "a": "What are the two speakers probably doing when the conversation takes place?"
              }
            },
            {
              "answerOptions": [
                "She took the class last semester.",
                "Her roommate took the course last semester.",
                "She heard about it on the school radio station."
              ],
              "correctAnswer": "Her roommate took the course last semester.",
              "variables": {
                "a": "How does the woman know that the economics class had a lot of students?"
              }
            }
          ]
        }
      ]
    }
  ]
}