{
  "courseId": "5c8ba293-0b27-4bb2-9cd5-b59f16f5ca6e",
  "title": "Everyday English Course 32",
  "description": "Improve your English comprehension skills through short everyday conversations and situational dialogues.",
  "imageUrl": "/public/images/courses/end46c00-6746-4c45-a867-a8f08666a5c6.png",
  "totalSections": 3,
  "sections": [
    {
      "title": "Section 1: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "M: The floor looks super clean. Did you call the cleaning company?\nW: Nope. My foot is broken. I stay at home. So I did it myself.\nM: With a broken foot? Was that a good idea?\nW: Don't worry, Dave.\nM: You could have called Brenda. She would have done it for you.\nW: I'm not asking your little sister to clean my floors, Dave. Anyway, it wasn't as hard as you think. I have been using a Roomba recently.\nM: Oh, that cleaning robot? I'm jealous, Sandra. I wanted one, but I didn't have 500 extra dollars.\nW: I know. They're so expensive. I got mine from my boss when I was Employee of the Year two years ago.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Sandra's foot.",
                "Cleaning the floor.",
                "Housekeeping costs."
              ],
              "correctAnswer": "Cleaning the floor.",
              "variables": {
                "a": "What is the conversation mainly about?"
              }
            },
            {
              "answerOptions": [
                "Dave's sister.",
                "Sandra's boss.",
                "Dave's house cleaner."
              ],
              "correctAnswer": "Dave's sister.",
              "variables": {
                "a": "Who is Brenda?"
              }
            }
          ]
        },
        {
          "text": "M: Can I help you?\nW: Yes, I am looking for a pair of gloves. I think I wear size six.\nM: The gloves are on this counter. Let's see... How about the blue pair? The color suits you and they are washable, too.\nW: Oh, I'll try them on. They seem to fit. How much shall I pay you?\nM: They are on sales this week. They have been reduced to twenty-five dollars.\nW: All right. I will take them.\nM: They are very nice.\nW: Thank you.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Salesman and customer.",
                "Bank clerk and customer.",
                "Waiter and customer."
              ],
              "correctAnswer": "Salesman and customer.",
              "variables": {
                "a": "What's the probable relationship between the two speakers?"
              }
            },
            {
              "answerOptions": [
                "20 dollars.",
                "50 dollars.",
                "25 dollars."
              ],
              "correctAnswer": "25 dollars.",
              "variables": {
                "a": "How much should the woman pay for the gloves?"
              }
            }
          ]
        },
        {
          "text": "M: What time do these stores close?\nW: Most of them close at six.\nM: How about the department store?\nW: I think that's open until nine.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "At six.",
                "At nine.",
                "At seven."
              ],
              "correctAnswer": "At six.",
              "variables": {
                "a": "What time do most stores close?"
              }
            },
            {
              "answerOptions": [
                "At six.",
                "At nine.",
                "At sever."
              ],
              "correctAnswer": "At nine.",
              "variables": {
                "a": "What time does the department store close?"
              }
            }
          ]
        },
        {
          "text": "M: So, do you have any special plans for this year?\nW: Yes, I'm going to join the Drama Club.\nM: Really?\nW: Yeah. I'd like to act in the school play. How about you? Are you going to do anything special this year?\nM: Well, I really want to learn to play the guitar, so I'm going to take music lessons. I'd love to play in a band some day.\nW: Wow, that's great.\nM: And I'm going to study a lot this year. I have to get good grades.\nW: So do I!\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Join the Drama Club.",
                "Learn to play the guitar.",
                "Take music lessons."
              ],
              "correctAnswer": "Join the Drama Club.",
              "variables": {
                "a": "What's the woman's plan for this year?"
              }
            },
            {
              "answerOptions": [
                "She's going to act in the school play.",
                "She's going to have some special plans.",
                "She's going to study a lot for good grades."
              ],
              "correctAnswer": "She's going to study a lot for good grades.",
              "variables": {
                "a": "What does the woman mean by saying \"So do I\"?"
              }
            }
          ]
        },
        {
          "text": "M: Great party, isn't it?\nW: Sure is. Jane and Ted always have great parties.\nM: This is my first. Jane and I teach at the same school.\nW: Oh, so you're a teacher?\nM: Yeah, history. What about you?\nW: I work for General Motors.\nM: What do you do there?\nW: I'm a manager's assistant.\nM: Oh, I see. By the way, my names's Bob Evans.\nW: Glad to meet you. I'm Jane Taylor.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "At a party.",
                "In a school.",
                "On a road."
              ],
              "correctAnswer": "At a party.",
              "variables": {
                "a": "Where do the two persons meet?"
              }
            },
            {
              "answerOptions": [
                "She is a student.",
                "She is a manager assistant.",
                "She is a manager."
              ],
              "correctAnswer": "She is a manager assistant.",
              "variables": {
                "a": "What is the woman?"
              }
            }
          ]
        },
        {
          "text": "W: Wake up. It's almost eight o'clock.\nM: No, please. Let me sleep on! I couldn't get to sleep until 3 o'clock this morning.\nW: Why? What's wrong with you?\nM: I felt pain all over my body. Can you get me some medicine?\nW: Will aspirin do?\nM: No, aspirin isn't strong enough.\nW: Then I can do nothing but call for a doctor.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He is doing some medicine research.",
                "He talked with his friend.",
                "He felt pain."
              ],
              "correctAnswer": "He felt pain.",
              "variables": {
                "a": "Why did the man get to sleep so late?"
              }
            },
            {
              "answerOptions": [
                "Call for a doctor.",
                "Give him some stronger medicine.",
                "Nothing."
              ],
              "correctAnswer": "Call for a doctor.",
              "variables": {
                "a": "What will the woman do for the man?"
              }
            }
          ]
        },
        {
          "text": "W: So you are leaving for the U. S. tonight?\nM: Don't ask. I am not going.\nW: Why?\nM: Because I have to stay here for a meeting with my boss.\nW: Oh, well, never mind. Now you can come to Helen's party tonight.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Disappointed.",
                "Encouraged.",
                "Delighted."
              ],
              "correctAnswer": "Disappointed.",
              "variables": {
                "a": "How is the man feeling?"
              }
            },
            {
              "answerOptions": [
                "Have a meeting.",
                "Go to a party.",
                "Fly to the US."
              ],
              "correctAnswer": "Go to a party.",
              "variables": {
                "a": "What will the man probably do tonight?"
              }
            }
          ]
        },
        {
          "text": "W: I'm sorry, I can't follow you. Would you mind saying that slowly?\nM: No, of course not.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She can't catch the man because he mils too fast.",
                "She can't understand the man because he speaks too fast.",
                "She can't follow the man because they are strangers."
              ],
              "correctAnswer": "She can't understand the man because he speaks too fast.",
              "variables": {
                "a": "What does the woman mean?"
              }
            },
            {
              "answerOptions": [
                "He will speak as fast as ever.",
                "Slow down a bit.",
                "Speak even louder."
              ],
              "correctAnswer": "Slow down a bit.",
              "variables": {
                "a": "What will the man probably do?"
              }
            }
          ]
        },
        {
          "text": "W: Can I talk to you for a moment,Jack?\nM: Of course,Jane. Sit down. What is it?\nW: I've decided to leave.\nM: Leave?\nW: Yes.\nM: Oh,no. Is it because we're moving out of London?\nW: Well,yes. But there are other reasons.\nM: I see. You never like working here.\nW: No, no. I've enjoyed working here. But...\nM: But what?\nW: Well, I haven't time to do other things. I've worked here for five years. And I'd like to do something different.\nM: What do you mean, something different?\nW: I want to travel. You know, I have never been to other countries.\nM: Really?\nW: Yes. I want to live abroad and learn to speak a different language.\nM: What can I say? I'm really sorry. But I understand.\nW: Thank you, Jack.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Because she does not like the job.",
                "Because she wants to do something different.",
                "Because she does not want to live outside London."
              ],
              "correctAnswer": "Because she wants to do something different.",
              "variables": {
                "a": "Why does Jane want to leave her present job?"
              }
            },
            {
              "answerOptions": [
                "Canada.",
                "Australia.",
                "Italy"
              ],
              "correctAnswer": "Italy",
              "variables": {
                "a": "Which of the following countries is Jane most likely to go if she is given a job there?"
              }
            }
          ]
        },
        {
          "text": "W: I enjoy going through a secondhand bookstore, don't you? It's interesting to see what people used to enjoy reading. Did you see this old book of children's stories?\nM: Some of these books aren't so old, though... See? This mystery was published only six years ago. It cost seventy-five cents. You can't beat that.\nW: Hey! Look at this!\nM: What? Are you getting interested in nineteenth century poetry all of a sudden?\nW: No. Look at the inscription! Someone gave this book as a present, and wrote a note on the inside of the front cover. It's dated 1893. Maybe it's worth something.\nM: Everything on that shelf is worth fifty cents.\nW: But if this is a signature of someone who is well known, it might bring a lot more. I hear William Shakespeare's signature is worth about a million dollars.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "In a library.",
                "In a school.",
                "In a bookstore."
              ],
              "correctAnswer": "In a bookstore.",
              "variables": {
                "a": "Where does this conversation take place?"
              }
            },
            {
              "answerOptions": [
                "He gave gifts to millions of people.",
                "He was a very wealthy man in his times.",
                "His signature is worth a lot of money."
              ],
              "correctAnswer": "His signature is worth a lot of money.",
              "variables": {
                "a": "Why is William Shakespeare mentioned in the conversation?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 2: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "M: I'd like a room for tonight, please?\nW: Single or double?\nM: Single.\nW: Do you have a reservation?\nM: No, I don't.\nW: Okay, we still have some rooms available.\nM: I'd like a private bath, if possible.\nW: All right. Room 128.\nM: What's the price of the room?\nW: $ 26.5 a day.\nM: Fine. I'll take it.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "A room with a private bath for one person.",
                "A room without a bath.",
                "A room with a bath for one person."
              ],
              "correctAnswer": "A room with a private bath for one person.",
              "variables": {
                "a": "What kind of room does the man want?"
              }
            },
            {
              "answerOptions": [
                "$ 26.5.",
                "$ 2.65.",
                "$ 25.6."
              ],
              "correctAnswer": "$ 26.5.",
              "variables": {
                "a": "How much will the man pay for the room a day?"
              }
            }
          ]
        },
        {
          "text": "M: Mark was born in the year of the Sheep.\nW: Mark's Sheep? In which year was he born?\nM: Yeah. He was born in nineteen seventy nine. That's why he's so creative.\nW: Dale was born in nineteen eighty.\nM: Then Dale's a Monkey.\nW: Well, he's funny, so that's perfect for him.\nM: Haha, you're right.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Sheep.",
                "Monkey",
                "Pig"
              ],
              "correctAnswer": "Sheep.",
              "variables": {
                "a": "What sign does Mark have?"
              }
            },
            {
              "answerOptions": [
                "Creative.",
                "Funny",
                "Cute"
              ],
              "correctAnswer": "Funny",
              "variables": {
                "a": "What does the woman think of Dale?"
              }
            }
          ]
        },
        {
          "text": "M: How can I help you, Ms Johnson?\nW: Mmm... First, I'd like to order thirty coats, order number P25J5.\nM: OK, order number P25J5, coats, thirty.\nW: How much are they?\nM: Forty-five dollars each.\nW: OK. And gloves, order number P28D5. How much are they?\nM: Five dollars a pair. How many do you need?\nW: Fifty.\nM: Gloves, fifty pairs, five dollars a pair, P28D5. OK.\nW: And shoes. Mmm... Twenty-five pairs of order number P26T5.\nM: Shoes, order number P26T5, twenty-five pairs at eighteen dollars a pair. Is that OK?\nW: Yes, that's fine.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "25.",
                "30.",
                "50."
              ],
              "correctAnswer": "30.",
              "variables": {
                "a": "How many coats does the woman want?"
              }
            },
            {
              "answerOptions": [
                "P25G5.",
                "P26T5.",
                "P28D5."
              ],
              "correctAnswer": "P28D5.",
              "variables": {
                "a": "What is the order number for gloves?"
              }
            }
          ]
        },
        {
          "text": "M: Maths Department, Dr Webster speaking.\nW: Hello, Professor Webster. This is Janet Hill calling. I live two doors down from your teaching assistant, Don Williams. Don asked me to call you because he's lost his voice and can't talk to you himself.\nM: Lost his voice? That's too bad. Is there anything I can do for him?\nW: Well, he has a class this afternoon from 2:30 to 4:00, and he won't be able to make it.\nM: Does he want me to try to find somebody else to teach it?\nW: No, not exactly. What he wants to do is to get someone to go in for him-just to pass back the mid term exam papers. He's already marked them. And they're on the desk in his office. The whole thing wouldn't take more than...Oh, ten minutes or so.\nM: 2:30, you say? Well, I'm free then, and I am going there anyway, so I could do it for him. Where's his class?\nW: Carter Hall, Room 214. Will you need his office key to get the exams? I could bring it to you.\nM: Well, actually, that won't be necessary. We have a master key in the Maths Department, so I can get into his office.\nW: Thank you, Professor Webster.\nM: My pleasure.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "He can't find his office key.",
                "He's unable to talk.",
                "He doesn't like his classroom."
              ],
              "correctAnswer": "He's unable to talk.",
              "variables": {
                "a": "What's Don's problem?"
              }
            },
            {
              "answerOptions": [
                "Mark the latest homework.",
                "Put a notice on the classroom door.",
                "Return some exam papers to his students."
              ],
              "correctAnswer": "Return some exam papers to his students.",
              "variables": {
                "a": "What does Don want someone to do for him?"
              }
            }
          ]
        },
        {
          "text": "W: What happened? I've been waiting for almost an hour.\nM: Vm sorry, but I had car trouble.\nW: Oh, that's too bad. Couldn't you have telephoned?\nM: I was going to, but I didn't have any change for a pay phone.\nW: You could've gotten some change in a store.\nM: But I was out on the edge of town. There wasn't any place to get change.\nW: Well, at least you're here now. No need to wait any longer. So, let's get started.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "His car broke down.",
                "He broke his phone.",
                "He lost his way."
              ],
              "correctAnswer": "His car broke down.",
              "variables": {
                "a": "What happened to the man?"
              }
            },
            {
              "answerOptions": [
                "He had no time.",
                "He forgot the number.",
                "He had no coins."
              ],
              "correctAnswer": "He had no time.",
              "variables": {
                "a": "Why did the man fail to call the woman?"
              }
            }
          ]
        },
        {
          "text": "W: How many holidays do you have in the U.S.?\nM: Er, I'm not quite sure. I just know some.\nW: For example?\nM: Mmm..., Mother's Day, National Day, Thanksgiving Day, Christmas Day, New Year's Day, and Valentine's Day.\nW: Not bad. When does its National Day come? And the Valentine's Day?\nM: The National Day comes on July 4th and the latter on February 14th.\nW: Talking of the National Day, who is the Father of the state? Benjamin Franklin or George Washington?\nM: George Washington, of course.\nW: Besides Washington, who else is regarded as a great president?\nM: Abraham Lincoln, I'm one hundred per cent sure.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "They were talking about the US holidays and so on.",
                "They were talking about the US language and so on.",
                "They were talking about the US presidents and so on."
              ],
              "correctAnswer": "They were talking about the US holidays and so on.",
              "variables": {
                "a": "What were the two speakers talking about?"
              }
            },
            {
              "answerOptions": [
                "Benjamin Franklin.",
                "George Washington.",
                "Abraham Lincoln."
              ],
              "correctAnswer": "George Washington.",
              "variables": {
                "a": "Who is the Father of the state?"
              }
            }
          ]
        },
        {
          "text": "M: I want to take the children out next Saturday.\nW: Next Saturday? That's eleventh, isn't it?\nM: No, it's the twelfth.\nW: Oh, yes, the twelfth. Where do you want to take them?\nM: To the zoo.\nW: To the zoo? You took them, there last month. I didn't think they enjoyed that visit.\nM: That's not what they told me.\nW: I think the beach is a better place.\nM: OK. That's the beach.\nW: What time are you going to pick them up?\nM: At 7 in the morning.\nW: Then I'll get ready for them half an hour earlier.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Sunday.",
                "Next Saturday.",
                "The eleventh."
              ],
              "correctAnswer": "Next Saturday.",
              "variables": {
                "a": "When is the man going to take the children out?"
              }
            },
            {
              "answerOptions": [
                "The zoo.",
                "The beach.",
                "The park."
              ],
              "correctAnswer": "The zoo.",
              "variables": {
                "a": "Where did the man go with the children last month?"
              }
            }
          ]
        },
        {
          "text": "M: What shall we do this weekend?\nW: Do you have something special in mind?\nM: No. not really. I just thought it might be fun to do something new.\nW: Do something for a change, you mean?\nM: Yes, something different.\nW: I usually go shopping and have my hair cut during the weekend and you usually watch football matches on TV.\nM: Yes. you often have tea with your friends. And I sometimes play cards with my friends. We have seldom done anything together since we were married.\nW: Now I've got an idea. Why don't we go for a picnic this weekend?\nM: Good idea! I will choose the place and you can prepare the food.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Play cards.",
                "Have tea.",
                "Go Shopping."
              ],
              "correctAnswer": "Have tea.",
              "variables": {
                "a": "What does the woman like to do with her friends?"
              }
            },
            {
              "answerOptions": [
                "Husband and wife.",
                "Brother and sister.",
                "Father and daughter."
              ],
              "correctAnswer": "Husband and wife.",
              "variables": {
                "a": "What's the relationship between the speakers?"
              }
            }
          ]
        },
        {
          "text": "M: Did you have your television repaired?\nW: Yes, but not by the place you recommended\nM: Why not? The repair is very good and thecharges are so reasonable.\nW: That may be, but I couldn't find it.\nM: But you couldn't miss it. I told you the first right after the railroad bridge.\nW: I took that. I went to the end of the road. There is no such a place.\nM: Wait a minute. Perhaps it is the second right. Yes. I think it is.\nW: I should have known. Whenever someone says \"You can't miss it\", you can be sure that you won't find it.\nM: I'm really sorry for my bad memory.\nW: That's OK.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "At somewhere we don't know.",
                "At the store the man recommended.",
                "At the first right after the railroad bridge."
              ],
              "correctAnswer": "At somewhere we don't know.",
              "variables": {
                "a": "Where did the woman have her television repaired?"
              }
            },
            {
              "answerOptions": [
                "The charges are reasonable.",
                "Anyone can find it.",
                "The good repair and reasonable charges."
              ],
              "correctAnswer": "The good repair and reasonable charges.",
              "variables": {
                "a": "Why did the man recommend the repair shop?"
              }
            }
          ]
        },
        {
          "text": "W: When did you become interested in collecting stamps?\nM: Oh, when I was about ten years old.\nW: Ten years old? So you have loved it for 9 years.\nM: Yeah, it's really an exciting hobby. You know, the first postage stamps were issued in Britain in 1840.\nW: Really? I didn't know that. What's on the first postage stamps?\nM: Well, look, here's a picture of the first two stamps issued.\nW: Oh, they both bear a picture of Queen Victoria, don't they?\nM: Yes, I wish I had the originals, then I would be a wealthy man instead of a poor stamp collector.\nW: But I believe collecting stamps gives you much pleasure which not all wealthy men can enjoy.\nM: Yes, I do agree.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "10.",
                "9.",
                "12."
              ],
              "correctAnswer": "10.",
              "variables": {
                "a": "How old was the man when he became interested in collecting stamps?"
              }
            },
            {
              "answerOptions": [
                "A picture of Britain.",
                "A picture of the queen's palace.",
                "A picture of Queen Victori"
              ],
              "correctAnswer": "A picture of Queen Victori",
              "variables": {
                "a": "What is on the first postage stamps?"
              }
            }
          ]
        }
      ]
    },
    {
      "title": "Section 3: English Practice",
      "description": "Learn to understand and respond to basic English dialogues used in daily situations.",
      "questionTemplates": [
        {
          "text": "W: I visited the new museum near the city center last month. It opened two weeks ago. You'd like it.\nM: Why? Is there lots of information about trees?\nW: No. It's mainly about wild birds that live in the forest. When I went there, there was a special plant exhibition, and they're having a study day for teenagers there about different kinds of clouds.\nM: That's useful for me when I go sailing.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Two weeks ago.",
                "Last week.",
                "Last month."
              ],
              "correctAnswer": "Last month.",
              "variables": {
                "a": "When did the woman visit the new museum?"
              }
            },
            {
              "answerOptions": [
                "Clouds.",
                "Plants.",
                "Wild birds."
              ],
              "correctAnswer": "Clouds.",
              "variables": {
                "a": "What can teenagers learn about on the study day?"
              }
            }
          ]
        },
        {
          "text": "M: Hello, Mrs. Tailor, is Peter there?\nW: No. He is out on his bicycle at the moment.\nM: Oh! Can he go swimming this afternoon?\nW: Sorry, Jack. He's got a basketball match this afternoon.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "On the phone.",
                "In the street.",
                "In a restaurant."
              ],
              "correctAnswer": "On the phone.",
              "variables": {
                "a": "Where does the conversation take place?"
              }
            },
            {
              "answerOptions": [
                "Ride bicycle.",
                "Go to swimming.",
                "Take part in a basketball match."
              ],
              "correctAnswer": "Take part in a basketball match.",
              "variables": {
                "a": "What is Peter going to do this afternoon?"
              }
            }
          ]
        },
        {
          "text": "M: I'm going to the store. What do we need?\nW: Um, what do you want for dinner tonight?\nM: How about chicken?\nW: We had chicken last night.\nM: Yeah, that was really good. I want some more of that.\nW: I'll make more next week. How about beef?\nM: I've got sick of that.\nW: What about noodles for tonight?\nM: Sure, I'd like that. I'll get some noodles and some mushrooms and onions.\nW: Sounds good. Oh, and get some potatoes and tomatoes for a salad.\nM: Do we have dessert?\nW: No, we don't. Why don't you get a melon?\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Chicken.",
                "Noodles.",
                "Beef."
              ],
              "correctAnswer": "Noodles.",
              "variables": {
                "a": "What are they going to have for tonight?"
              }
            },
            {
              "answerOptions": [
                "Wife and husband.",
                "Boss and secretary.",
                "Customer and shop assistant."
              ],
              "correctAnswer": "Wife and husband.",
              "variables": {
                "a": "What may be the relationship between the two speakers?"
              }
            }
          ]
        },
        {
          "text": "W: Why didn't you come to the cinema last night? I waited for you for a long time.\nM: I'm sorry, but I had something more important to do yesterday evening, so I wasn't able to come.\nW: But why not tell me?\nM: I did. I called you many times, but you had your mobile phone power off.\nW: Oh, I didn't bring it with me because I left it recharging at home.\nM: I'm really sorry to have missed the film.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She saw a film.",
                "She went shopping.",
                "She watched a football match."
              ],
              "correctAnswer": "She saw a film.",
              "variables": {
                "a": "What did the woman do last night?"
              }
            },
            {
              "answerOptions": [
                "The woman's mobile phone was stolen.",
                "The woman's mobile phone was power off.",
                "The man had something important to do."
              ],
              "correctAnswer": "The woman's mobile phone was power off.",
              "variables": {
                "a": "Why couldn't the man keep in touch with the woman last night?"
              }
            }
          ]
        },
        {
          "text": "W: What's your favourite game?\nM: I like to play table tennis. How about you?\nW: I like swimming and skating.\nM: Isn't it hard to learn skating?\nW: No, what you need is balance.\nM: Could you teach me how to do it?\nW: Sure, anytime when you are free.\nM: Do I have to buy a pair of skates?\nW: I don't think it's necessary. Why not rent them?\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Tennis.",
                "Swimming.",
                "Table tennis."
              ],
              "correctAnswer": "Table tennis.",
              "variables": {
                "a": "What game does the man enjoy?"
              }
            },
            {
              "answerOptions": [
                "To borrow a pair.",
                "To hire a pair.",
                "To buy a pair."
              ],
              "correctAnswer": "To hire a pair.",
              "variables": {
                "a": "What does the woman suggest the man do if he has no skates?"
              }
            }
          ]
        },
        {
          "text": "W: If that man gives me any more letters to type, I'll scream. He's given me ten already today, and there'll be more when I get back from coffee break. I'll be here till midnight.\nM: Calm down, Franny. He can't make you stay after five. Finish what you can, and leave the rest for Mary.\nW: But they're important letters, Joe. They should go out tonight.\nM: That's not your worry. If they're important, he should have given them to you earlier.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Her boss.",
                "Her husband.",
                "Her friend."
              ],
              "correctAnswer": "Her boss.",
              "variables": {
                "a": "Who is the woman complaining about?"
              }
            },
            {
              "answerOptions": [
                "Finishing her job earlier.",
                "Leaving the task to others.",
                "Asking others for help."
              ],
              "correctAnswer": "Leaving the task to others.",
              "variables": {
                "a": "What is the man's advice?"
              }
            }
          ]
        },
        {
          "text": "W: Hello, Ben. You're getting ready for tomorrow's lessons, aren't you?\nM: Yes, but I'm a bit nervous. I have no idea what'll happen in class and how I'll get along with my classmates.\nW: I understand how you're feeling. Just take it easy. You'll make a lot of friends very soon.\nM: Thank you. I'll try my best to get used to my new school life as soon as possible. By the way, what time does the first class begin?\nW: At 8 o'clock. But before that we have 10 minutes to hand in homework and then 20 minutes for morning reading.\nM: So we must get to school before 7:30, right?\nW: Right.\nM: How long does each class last?\nW: 45 minutes, I think, with a 10 or 15 minutes' break.\nM: Well, I hear that lunchtime is nearly 12 o'clock and I'll be starving by then.\nW: Don't worry. During the break after the second class, we can buy something to eat.\nM: That's good.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Do morning exercise.",
                "Hand in homework.",
                "Do their homework."
              ],
              "correctAnswer": "Hand in homework.",
              "variables": {
                "a": "What should the students do before morning reading?"
              }
            },
            {
              "answerOptions": [
                "At about 9.00.",
                "At about 9:40.",
                "At about 10.30."
              ],
              "correctAnswer": "At about 9:40.",
              "variables": {
                "a": "When can they buy something to eat before lunchtime?"
              }
            }
          ]
        },
        {
          "text": "M: I want to take the children out next Saturday.\nW: That's eleventh, isn't it?\nM: NO, it's twelfth.\nW: Where do you want to take them?\nM: To the zoo.\nW: I remember you took them there last month. They don't like it.\nM: Really? But that'S not what they told me.\nW: I think the beach is a better place to go.\nM: Okay, then, we can go to the beach.\nW: I'll get them ready for you in the morning.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Tenth.",
                "Eleventh.",
                "Twelfth."
              ],
              "correctAnswer": "Twelfth.",
              "variables": {
                "a": "When is the man going to take the children out?"
              }
            },
            {
              "answerOptions": [
                "They like going to the zoo.",
                "They like to go to the beach.",
                "They dislike going to the zoo."
              ],
              "correctAnswer": "They like going to the zoo.",
              "variables": {
                "a": "What did the children tell their father about the trip to the zoo?"
              }
            }
          ]
        },
        {
          "text": "M: You look pale, Linda. Is everything all right?\nW: No. I lost my textbook on my way back from school.\nM: Did you stop by any place?\nW: Yes. I stopped by a post office to buy some stamps.\nM: Think carefully whether you put your book down.\nW: Maybe you are right. I will go back and see if it is still there. Thank you.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "She lost her bag.",
                "She lost her way.",
                "She lost her book."
              ],
              "correctAnswer": "She lost her book.",
              "variables": {
                "a": "Why did Linda look pale?"
              }
            },
            {
              "answerOptions": [
                "A shop.",
                "A post office.",
                "A drug store."
              ],
              "correctAnswer": "A post office.",
              "variables": {
                "a": "Where did she stop by?"
              }
            }
          ]
        },
        {
          "text": "W: How can I get to your house?\nM: Oh, it's very easy. My house is only five minutes' walk from the station. Turn right outside the station, and then it's the third street on the left. You can't miss it. It's got the number on the gate. It's exactly opposite the park.\nW: I see. Thanks.\n{a}",
          "instances": [
            {
              "answerOptions": [
                "Opposite the station.",
                "Across from the park.",
                "Next to the bank."
              ],
              "correctAnswer": "Across from the park.",
              "variables": {
                "a": "Where is the man's house?"
              }
            },
            {
              "answerOptions": [
                "On foot.",
                "In the man's car.",
                "By taxi."
              ],
              "correctAnswer": "On foot.",
              "variables": {
                "a": "How will the woman probably go to the man's house from the station?"
              }
            }
          ]
        }
      ]
    }
  ]
}